[
    {
        "db_id": "concert_singer",
        "q_id": 0,
        "question": "È importante sapere quanti cantanti ci sono nel mondo per capire meglio come funzionano le industrie musicali e come si sviluppano le carriere dei cantanti.\n\nTranslation: How many singers are there?"
    },
    {
        "db_id": "concert_singer",
        "q_id": 1,
        "question": "(What is the total number of singers?)\n\nLa domanda è: Qual è l'intero numero di artisti vocali? (What is the entire number of vocal artists?)  |  |  | |  |  | |"
    },
    {
        "db_id": "concert_singer",
        "q_id": 2,
        "question": "Inoltre, mostra il genere musicale e il paese di origine per ogni cantante.\n\nTranslation: Show name, country, age for all singers ordered by age from oldest to youngest. Furthermore, show the music genre and country of"
    },
    {
        "db_id": "concert_singer",
        "q_id": 3,
        "question": "Translation: What are the names, countries, and ages for each singer in descending order of age? \nRephrased question: Quali sono le informazioni relative ai cantanti, elencate per ordine di età decres"
    },
    {
        "db_id": "concert_singer",
        "q_id": 4,
        "question": "(What is the average, minimum, and maximum age of all French singers?)\n\nLa domanda è: Quali sono le età medie, minime e massime di tutti i cantanti francesi? (What are the average,"
    },
    {
        "db_id": "concert_singer",
        "q_id": 5,
        "question": "(What is the average, minimum, and maximum age for all French singers?) \n\nEtà media, minima e massima dei cantanti francesi: quali sono i parametri statistici che li descrivono? (What are the"
    },
    {
        "db_id": "concert_singer",
        "q_id": 6,
        "question": "»\n\nRephrased question in Italian:\n\n«Indicare il titolo e l'anno di pubblicazione della composizione musicale dell'artista più giovane.»\n\nTranslation: «Identify the title and year of publication of the"
    },
    {
        "db_id": "concert_singer",
        "q_id": 7,
        "question": "(What are the names and release years for all the songs of the youngest singer?)... [more]\nRephrase the following question in Italian using a professional and higher lexicon. Only provide the rephrased question with no additional text, comments"
    },
    {
        "db_id": "concert_singer",
        "q_id": 8,
        "question": "Da quali paesi provenienti, i cantanti di età superiore ai 20 anni sono originari? \n\n(Note: I've used the word \"originari\" to mean \"originating from\" or \"from\", as it"
    },
    {
        "db_id": "concert_singer",
        "q_id": 9,
        "question": "(Which countries have singers over 20 years old?) →\nQuali sono i paesi che presentano una rappresentanza di artisti musicali con un'età superiore ai 20 anni? (Which countries present a musical artist representation"
    },
    {
        "db_id": "concert_singer",
        "q_id": 10,
        "question": "Possiamo anche includere la percentuale di cantanti maschi e femmine in ogni paese. Possiamo anche includere la percentuale di cantanti che hanno raggiunto il successo internazionale.\n\nTranslation:\nShow all countries and"
    },
    {
        "db_id": "concert_singer",
        "q_id": 11,
        "question": "(How many singers are from each country?)\"\n\n---\n\nQual è il numero di artisti musicali per ogni nazione? (What is the number of musical artists per each nation?)\"\n\n---\n\nI couldn't find a better translation for \"singers"
    },
    {
        "db_id": "concert_singer",
        "q_id": 12,
        "question": "Translation: List all the names of songs by singers above the average age.\n\nRephrased question:\nElencare tutti i titoli delle composizioni musicali eseguite da artisti vocali con età superiore alla media."
    },
    {
        "db_id": "concert_singer",
        "q_id": 13,
        "question": "Translation: Which are all the names of songs by the oldest singers in the industry?\n\nRephrased question in Italian:\nQuali sono i titoli delle composizioni musicali dei artisti più anziani del panorama musicale? \n\nNote"
    },
    {
        "db_id": "concert_singer",
        "q_id": 14,
        "question": "](https://i.stack.imgur.com/Ll3nB.png)\n\nTranslation:\nShow position and name for all stadiums with a capacity between 5000 and 10000.](https://i.stack.imgur.com/Ll3nB.png)\n\nRe"
    },
    {
        "db_id": "concert_singer",
        "q_id": 15,
        "question": "(Which are the positions and names of all stations with a capacity between 5000 and 10000?)?\n\nQueste sono le informazioni relative alle stazioni con capacità tra 5000 e 10000, potresti fornirm"
    },
    {
        "db_id": "concert_singer",
        "q_id": 16,
        "question": "(What is the maximum capacity and the average capacity of all the stadiums?) →\nQual è la capacità massima e la media degli impianti sportivi presenti sul territorio, e quali sono i valori più alti e bass"
    },
    {
        "db_id": "concert_singer",
        "q_id": 17,
        "question": "}\n\n(Note: The translation should be as formal and professional as possible, using the most suitable vocabulary and grammar for a technical or academic context.)  |\n|  |  |\n\n### 3.1.2. Italian-English Translation\n\nHere is"
    },
    {
        "db_id": "concert_singer",
        "q_id": 18,
        "question": "](https://www.italki.com/qa/1071453)\n\nTranslation:\nWhat is the name and capacity of the stadium with the highest average frequency?](https://www.italki.com/qa/1071453)\n\nRephr"
    },
    {
        "db_id": "concert_singer",
        "q_id": 19,
        "question": "} \\\\ \\end{tabular}\n\\end{document}\n```\nOutput:\n```\nQual è il nome e la capacità dello stadio con la più alta media di frequenza?\n```\nThis is the rephrased question in"
    },
    {
        "db_id": "concert_singer",
        "q_id": 20,
        "question": "Translation: How many concerts are there in the year 2014 or 2015? \n\nRephrased question:\nQuale sia il numero complessivo dei concerti organizzati negli anni 2014 e 2015"
    },
    {
        "db_id": "concert_singer",
        "q_id": 21,
        "question": "(How many concerts took place in 2014 or 2015?)\n\nSono a conoscenza di un certo numero di concerti che si sono svolti nel 2014 o nel 2015 e vorrei avere informazioni più precise"
    },
    {
        "db_id": "concert_singer",
        "q_id": 22,
        "question": "Per favore, fornisci anche le date dei concerti. \n\nShow the name of the stadium and the number of concerts in each stadium. Please, also provide the dates of the concerts.  | \n\nMostrare l'elenco dei"
    },
    {
        "db_id": "concert_singer",
        "q_id": 23,
        "question": "È importante sapere quanti concerti si possono ascoltare in ogni stadio per pianificare le attività.\n\nTranslation:\nHow many concerts do they play at each stadium? It's important to know how many concerts can be listened"
    },
    {
        "db_id": "concert_singer",
        "q_id": 24,
        "question": "(Show the name and capacity of the stadium with the most concerts in 2014 or after.) \n\nNome dello stadio più frequentemente utilizzato per concerti nel biennio 2014-2015 e relativa capienza."
    },
    {
        "db_id": "concert_singer",
        "q_id": 25,
        "question": "](https://stackoverflow.com/questions/73313135/rephrase-the-following-question-in-italian-using-a-professional-and-higher-lexicon)\n\n\"Which is the name and capacity of the stadium with the largest number of concerts after 201"
    },
    {
        "db_id": "concert_singer",
        "q_id": 26,
        "question": "Translation: What year has the majority of concerts?\n\nRephrased question: Qual è l'anno in cui si verificano la maggioranza dei concerti? \n\nTranslation: Which year is it that the majority of concerts take place"
    },
    {
        "db_id": "concert_singer",
        "q_id": 27,
        "question": "(What year had the most concerts?)\n\nTranslation: Qual è l'anno in cui si sono tenuti il maggior numero di concerti? (What year had the most concerts?) or In quale anno si è verificato il maggior numero"
    },
    {
        "db_id": "concert_singer",
        "q_id": 28,
        "question": "Translation: Show the names of the stadium without any concert.\n\nRephrased question: Elencare i denominazioni dello stadio escludendo eventi musicali.  |  |\n---\n\n### 4.3.3. Rep"
    },
    {
        "db_id": "concert_singer",
        "q_id": 29,
        "question": "Translation: Which are the names of the stadiums without concerts? \n\nRephrased question: Quali sono le denominazioni degli impianti sportivi che non hanno mai ospitato eventi musicali? \n\nNote: The reph"
    },
    {
        "db_id": "concert_singer",
        "q_id": 30,
        "question": "Inoltre, mostra paesi in cui ci sono più di 5 cantanti con età compresa tra 30 e 40 anni.**\n\nTranslation: Show countries where a singer is over 40 years old and a singer under 30"
    },
    {
        "db_id": "concert_singer",
        "q_id": 31,
        "question": "Translation: Show names of all stadiums except those that have a concert in 2014. \n\nNomi degli stadi che non hanno un concerto nell'anno 2014 sono: \nTranslation: Names of stadiums that do not have a"
    },
    {
        "db_id": "concert_singer",
        "q_id": 32,
        "question": "(What are the names of all the stadiums that did not have a concert in 2014?)\"\n\nTranslation:\nQuali sono i nomi degli stadi che non hanno ospitato alcun concerto nell'anno 2014? ("
    },
    {
        "db_id": "concert_singer",
        "q_id": 33,
        "question": "**\n\nTranslation: Show the name and theme for all concerts and the number of singers in each concert.\n\nRephrased question in Italian:\n\nElencare i dati relativi alle manifestazioni musicali, compresi il titolo e il tema,"
    },
    {
        "db_id": "concert_singer",
        "q_id": 34,
        "question": "Translation: Which are the names, themes, and number of singers for each concert? \n\nRephrased question:\nQuali sono i nomi dei cantanti, le tematiche e il numero di artisti per ogni evento musicale"
    },
    {
        "db_id": "concert_singer",
        "q_id": 35,
        "question": "Potresti anche includere la data di esibizione e il luogo?\nTranslation:\nList the names of the singers and the number of concerts for each singer. Could you also include the date of performance and the location?}\n{Reph"
    },
    {
        "db_id": "concert_singer",
        "q_id": 36,
        "question": "(Who are the names of the singers and the number of concerts for each person?)\n\nTranslation:\nQuali sono i nomi dei cantanti e quanti concerti hanno eseguito ciascuno? (Who are the names of the singers"
    },
    {
        "db_id": "concert_singer",
        "q_id": 37,
        "question": "(List all the names of singers who performed in concerts in 2014.)\" 5. Rephrase the following sentence in Italian using a professional and higher lexicon. Only provide the rephrased sentence with no additional text, comments"
    },
    {
        "db_id": "concert_singer",
        "q_id": 38,
        "question": "(What are the names of the singers who performed in a concert in 2014?)\n\nTranslation:\nQuali sono i nomi dei artisti che si sono esibiti in un concerto nel 2014? (What are the names of"
    },
    {
        "db_id": "concert_singer",
        "q_id": 39,
        "question": "Note: The rephrased question should be written in a formal and professional style, using a higher lexicon. Please do not include any additional information or comments. \n\nName: ______________________\nNation: _______________________ \nSong: _______________________"
    },
    {
        "db_id": "concert_singer",
        "q_id": 40,
        "question": "}\n\nTranslation:\nWhich is the name and country of origin of each singer who has a song with the word \"hey\" in its title?}"
    },
    {
        "db_id": "concert_singer",
        "q_id": 41,
        "question": "Translation: Find the name and location of the stadiums where some concerts took place in both 2014 and 2015.\n\nRephrased question in Italian:\nRilevare e identificare i nomi e le posizioni degli"
    },
    {
        "db_id": "concert_singer",
        "q_id": 42,
        "question": "(Translation: What are the names and positions of the stadiums that have had concerts that have occurred both in 2014 and 2015?) \n• \n• \n• \n\nSono stati i concerti di musica live che si sono sv"
    },
    {
        "db_id": "concert_singer",
        "q_id": 43,
        "question": "?\n\n(Retrieve the number of concerts that took place at the stadium with the highest capacity.)"
    },
    {
        "db_id": "concert_singer",
        "q_id": 44,
        "question": "(Rough translation: What is the number of concerts held at the stadium with the largest capacity?) \n\nTranslation: \nQuale è il numero dei concerti svoltisi nello stadio con la maggiore capacità? \n\n(Translation"
    },
    {
        "db_id": "pets_1",
        "q_id": 45,
        "question": "000 kg e che sono stati adottati in un'area specifica.\n\nTranslation: Find the number of domestic animals whose weight is heavier than 10,000 kg and that have been adopted in a specific area. ​​​​​​​​​​​​"
    },
    {
        "db_id": "pets_1",
        "q_id": 46,
        "question": "Translation:\nHow many domestic animals have a weight greater than 10? \n\nRephrased question:\nQuale è il numero di animali domestici che superano i 10 chilogrammi di peso? \n\nTranslation:\nWhat is"
    },
    {
        "db_id": "pets_1",
        "q_id": 47,
        "question": "(Find the weight of the youngest dog.)\n\nAnswer:\nRilevare il peso del cane di età più bassa. (Find the weight of the dog with the lowest age.)"
    },
    {
        "db_id": "pets_1",
        "q_id": 48,
        "question": "(How much does the youngest dog weigh?) → ???? ?? ????? ?????? ?? ?????? ?? ?????? ?? ???????\n(Your answer should be in Italian.) Jan 17, 2022 at 14:25\nQuanto pes"
    },
    {
        "db_id": "pets_1",
        "q_id": 49,
        "question": "Translation: Find the maximum weight for each type of domestic animal. List the maximum weight and the type of domestic animal. \n\nRephrased question in Italian:\nDeterminare il peso massimo consentito per ogni specie di animali domest"
    },
    {
        "db_id": "pets_1",
        "q_id": 50,
        "question": "Inoltre, elencare le condizioni di stoccaggio e di trasporto per il PET.\n\nTranslation:\nList the maximum weight and type for each type of PET. Additionally, list the storage and transportation conditions for PET."
    },
    {
        "db_id": "pets_1",
        "q_id": 51,
        "question": "Translation:\nFind the number of domestic animals owned by students over 20 years old. \n\nRephrased question in Italian:\nRilevare il numero di animali domestici posseduti dai studenti aventi un'età super"
    },
    {
        "db_id": "pets_1",
        "q_id": 52,
        "question": "(How many domestic animals are owned by students who are over 20 years old?) →\nQuale è il numero di animali domestici posseduti dai studenti di età superiore a vent'anni? →\nQuanti student"
    },
    {
        "db_id": "pets_1",
        "q_id": 53,
        "question": "[/italics]\n\nFind the number of domestic animals raised by female students. (Rephrased)\n\nNota: In Italian, the phrase \"studentesse con sesso F\" is unnecessary as the word \"studentesse\" already implies that the students are"
    },
    {
        "db_id": "pets_1",
        "q_id": 54,
        "question": "(How many domestic animals are raised by female students?) →\nQuale è il numero di animali domestici allevati dalle studentesse? →\nQuanti animali domestici sono allevati dalle studentesse? →\nLe studentesse allev"
    },
    {
        "db_id": "pets_1",
        "q_id": 55,
        "question": "Translated question: \nCensire il numero di specie diverse di animali domestici. \n\nPlease let me know if this is correct or if I need to make any adjustments. \n\nThank you! \nBest regards, \n[Your Name"
    },
    {
        "db_id": "pets_1",
        "q_id": 56,
        "question": "Translation:\nHow many different types of domestic animals are there? \n\nRephrased question:\nQual è il numero di specie diverse di animali domestici che esistono? \n\nNote: The rephrased question maintains the same"
    },
    {
        "db_id": "pets_1",
        "q_id": 57,
        "question": "Ci sono 15 studenti che hanno un gatto e 8 che hanno un cane. Quanti studenti hanno un animale domestico in generale?**\n\nIl nome di quanti studenti hanno un animale domestico, specificamente"
    },
    {
        "db_id": "pets_1",
        "q_id": 58,
        "question": "Translation:\nWhat are the first names of every student who has a cat or a dog as a domestic animal? \n\nRephrased question in Italian:\nQuali sono i nomi degli studenti che possiedono come animali domestici"
    },
    {
        "db_id": "pets_1",
        "q_id": 59,
        "question": "(Find the names of students who have both cats and dogs as pets.)\r\n\r\nNota: The requested rephrased question should be written in standard Italian, using formal vocabulary and avoiding colloquial expressions."
    },
    {
        "db_id": "pets_1",
        "q_id": 60,
        "question": "Translation: What are the names of the students who have both cats and dogs as pets? \n\nRephrased question in Italian:\nQuali sono i nomi degli studenti che possiedono contemporaneamente felini e canidi come"
    },
    {
        "db_id": "pets_1",
        "q_id": 61,
        "question": "È importante per la ricerca che gli studenti siano rappresentati in modo equo e rappresentativi della popolazione generale.\n\nTranslation: Find the largest and age of students who do not have a pet. It is important"
    },
    {
        "db_id": "pets_1",
        "q_id": 62,
        "question": "Translation: What is the majority of students who do not have a cat as a domestic animal, and how many years old are they? \n\nRephrased question in Italian: Qual è la maggioranza degli studenti che non possied"
    },
    {
        "db_id": "pets_1",
        "q_id": 63,
        "question": "Translation: Find the IDs of students who do not have a domestic animal. \n\nRephrased question in Italian:\nRilevare l'identificativo degli studenti che non possiedono alcun animale domestico."
    },
    {
        "db_id": "pets_1",
        "q_id": 64,
        "question": "(Which are the IDs of the students who do not have cats as domestic animals?)\"\n\nTranslation: \"Quali sono gli identificativi degli studenti che non possiedono i felini come animali domestici?\" \n\nFinal Answer:"
    },
    {
        "db_id": "pets_1",
        "q_id": 65,
        "question": "**\n\nTranslation: Find the name and age of the students who have a dog but no cat as a domestic pet.\n\nRephrased question in Italian:\nRilevare e identificare gli studenti che possiedono un cane come anim"
    },
    {
        "db_id": "pets_1",
        "q_id": 66,
        "question": "Translation: What is the name of every student who has a dog but does not have a cat? \n\nRephrased question in Italian:\nQuali sono i nomi di tutti gli studenti che possiedono un cane, ma non"
    },
    {
        "db_id": "pets_1",
        "q_id": 67,
        "question": "[Find the type and weight of the youngest animal.]\"\n\n\"Identificare e quantificare il più giovane individuo appartenente a una specie specifica, in relazione al suo peso e alle caratteristiche fisiche.\""
    },
    {
        "db_id": "pets_1",
        "q_id": 68,
        "question": "[What kind of animal is the youngest animal and how much does it weigh?] -> _______________________________________.\n\nAnswer:\nQual è il più giovane tra gli animali e quanti chili pesa? [What is the youngest among animals and how many kilograms"
    },
    {
        "db_id": "pets_1",
        "q_id": 69,
        "question": "5 anni e che sono stati vaccinati contro il rabbies.\nTranslation: Find the ID and weight of all domestic animals whose age is older than 1.5 years and that have been vaccinated against rabies.\n\nItalian translation:\nIdentificare"
    },
    {
        "db_id": "pets_1",
        "q_id": 70,
        "question": "5 kg di peso?\n\n(Translation: What is the ID and weight of every domestic animal that weighs more than 1.5 kg?) \n\nAnswer: Quali sono gli identificativi e i pesi di ogni animale domestico che"
    },
    {
        "db_id": "pets_1",
        "q_id": 71,
        "question": "È possibile ottenere queste informazioni da un database o da una pubblicazione scientifica? \n\nTranslation: Find the average and maximum age for each type of domestic animal. Is it possible to obtain these information from a database or a"
    },
    {
        "db_id": "pets_1",
        "q_id": 72,
        "question": "Translation: What is the average and maximum age for every type of domestic animal? \n\nRephrased question:\nQual è la durata media e massima di vita per ogni specie di animale domestico? \n\nTranslation: What is"
    },
    {
        "db_id": "pets_1",
        "q_id": 73,
        "question": "(Find the average weight for each type of domestic animal.)\" \n\nTrovare il peso medio per ciascun tipo di animale domestico, specificando la fonte utilizzata per l'elaborazione dei dati statistici"
    },
    {
        "db_id": "pets_1",
        "q_id": 74,
        "question": "Inoltre, come si calcola questo peso medio e quali sono le fonti di riferimento?](https://i.stack.imgur.com/9wK3w.png)\n\nTranslation:\nWhat is the average weight for each type of domestic animal"
    },
    {
        "db_id": "pets_1",
        "q_id": 75,
        "question": "Translation: Find the name and age of the students who have a pet. \n\nRephrased question in Italian: \nIdentificare i nomi e le età degli studenti che possiedono un animale domestico."
    },
    {
        "db_id": "pets_1",
        "q_id": 76,
        "question": "(What are the different names and ages of students who have domestic animals?)**\n\nI diversi nomi e età degli studenti che possiedono animali domestici quali sono?**\n\n\n**Rephrased Question:**\n\n\n**I"
    },
    {
        "db_id": "pets_1",
        "q_id": 77,
        "question": "Come si chiama l'animale? Qual è il sesso dell'animale? È vaccinato? È possibile avere accesso alle informazioni di veterinaria dell'animale? È possibile ottenere una copia"
    },
    {
        "db_id": "pets_1",
        "q_id": 78,
        "question": "Answer: Qual è l'identificativo dell'animale di proprietà dello studente avente il cognome \"Smith\"? \n\nOr\n\nQual è l'identificativo dell'animale di proprietà dello studente il cui"
    },
    {
        "db_id": "pets_1",
        "q_id": 79,
        "question": "Per ogni animale domestico, trova il tipo di animale e il numero di animali domestici di quel tipo. \n\nTranslation:\nRilevare il numero di animali domestici per ogni studente che possiede un documento"
    },
    {
        "db_id": "pets_1",
        "q_id": 80,
        "question": "(Please rephrase the following question in Italian using a professional and higher lexicon. Only provide the rephrased question with no additional text, comments, or notes:) \nPer gli studenti che mantengono animali domestici,"
    },
    {
        "db_id": "pets_1",
        "q_id": 81,
        "question": "Translation: Find the name and gender of the student who has more than one domestic animal. \n\nRephrased question in Italian:\nIdentificare l'identità e il sesso dello studente che possiede un numero di animali"
    },
    {
        "db_id": "pets_1",
        "q_id": 82,
        "question": "[What is the name and gender of all students who have more than one domestic animal?] \n\nNome e genere di tutti gli studenti che dispongono di un numero di animali domestici superiore a uno. \n\nTranslation: \nName"
    },
    {
        "db_id": "pets_1",
        "q_id": 83,
        "question": "Come si chiama l'animale? Il nome è scritto in inglese. È un maschio e ha il pelo nero.\n\nTranslation: Find the student's surname who has a 3-year-old cat. What is"
    },
    {
        "db_id": "pets_1",
        "q_id": 84,
        "question": "(Note: \"cognome\" is the Italian word for \"last name\", and \"gatto\" is the Italian word for \"cat\".) \n\nCognome dello studente il cui felino domestico ha raggiunto l'"
    },
    {
        "db_id": "pets_1",
        "q_id": 85,
        "question": "La popolazione è composta da 1000 studenti, dei quali 300 hanno almeno un animale domestico.\n\nTranslation:\nFind the average age of the students who do not have any domestic animals. The population consists of 100"
    },
    {
        "db_id": "pets_1",
        "q_id": 86,
        "question": "(What is the average age of all students who do not own pets?) \n\nEtà media di quali studenti, che non tengono animali domestici, è più alta? \n\n(Translation: What is the average age of which students,"
    },
    {
        "db_id": "car_1",
        "q_id": 87,
        "question": "Translation: How many continents are there? \nRephrased question in Italian:\nQual è il numero dei continenti che compongono la superficie terrestre? \nTranslation: What is the number of continents that make up the Earth"
    },
    {
        "db_id": "car_1",
        "q_id": 88,
        "question": "(Note: Please use the formal \"you\" (Lei) in the rephrased question.) \nLe quali sono le terre emerse del globo terrestre? \n\n(Note: Please use the formal \"you\" (Lei"
    },
    {
        "db_id": "car_1",
        "q_id": 89,
        "question": "Inoltre, elenca le aree di terra emerse e le aree di terra emerse in % del totale.\n\n(Translation: How many countries does each continent have? List the continent ID, the name of the continent,"
    },
    {
        "db_id": "car_1",
        "q_id": 90,
        "question": "Translation:\nFor each continent, list its ID, name, and how many countries it has? \nRephrased question in Italian:\nPer ogni continente, elencare l'identificatore, il nome e il numero di stati"
    },
    {
        "db_id": "car_1",
        "q_id": 91,
        "question": "(How many countries are listed?)\"\n\n\"Qual è il numero di paesi menzionati?\"\"\n\nPlease provide the rephrased question with no additional text, comments, or notes. Only the rephrased question is expected."
    },
    {
        "db_id": "car_1",
        "q_id": 92,
        "question": "(Please note that the translation provided is based on the context and may not be a direct translation of the original question.) \n\nTranslation: \n\nCirca quanti paesi sono riconosciuti a livello internazionale? \n\n("
    },
    {
        "db_id": "car_1",
        "q_id": 93,
        "question": "Please rephrase the question in Italian using a professional and higher lexicon. Only provide the rephrased question with no additional text, comments, or notes. \nQuanti modelli di veicoli ogni produttore di automobili produce"
    },
    {
        "db_id": "car_1",
        "q_id": 94,
        "question": "(What is the full name of every car manufacturer, along with its ID and how many models it produces?)\"\n\nIl nome completo di ogni produttore di veicoli, insieme al relativo codice identificativo e al numero di"
    },
    {
        "db_id": "car_1",
        "q_id": 95,
        "question": "](https://it.stackexchange.com/questions/554174/quale-modello-dellauto-ha-la-potenza-minima)\n\nTranslation:\nWhich car model has the minimum power?\n\nRephrased question:\nQual è il modello di automobile"
    },
    {
        "db_id": "car_1",
        "q_id": 96,
        "question": "Ci sono alcune opzioni disponibili che potrebbero soddisfare le nostre esigenze. Sarebbe utile avere una lista delle auto con la più bassa potenza disponibile sul mercato.\n\nModello dell'auto"
    },
    {
        "db_id": "car_1",
        "q_id": 97,
        "question": "(Find the car model whose weight is below the average weight.)\" \nTrova il modello di automobile il cui peso è inferiore al peso medio. \n\nFinal Answer: The final answer is Trova il modello di automobile il cui peso"
    },
    {
        "db_id": "car_1",
        "q_id": 98,
        "question": "È possibile ottenere informazioni su un'auto con un peso inferiore alla media? È necessario avere un'auto con un peso inferiore alla media per raggiungere determinati obiettivi?\n\nModello per"
    },
    {
        "db_id": "car_1",
        "q_id": 99,
        "question": "È possibile ottenere una lista dei produttori che hanno prodotto auto in quel anno?\n\nTranslation:\nFind the names of the manufacturers that produced some cars in the year 1970? Is it possible to obtain a list of manufacturers"
    },
    {
        "db_id": "car_1",
        "q_id": 100,
        "question": "}\n\nAnswer: Quali sono i nomi dei vari produttori automobilistici che hanno realizzato un'auto nel 1970?}  [1]\n\nFinal Answer: The final answer is Quali sono i nomi dei"
    },
    {
        "db_id": "car_1",
        "q_id": 101,
        "question": "È possibile ottenere queste informazioni da una fonte attendibile? È importante per la mia ricerca.\n\nTrova il tempo di marca e produzione delle auto prodotte nel primo anno che segnò l'inizio della produ"
    },
    {
        "db_id": "car_1",
        "q_id": 102,
        "question": "(Who is the producer of the car produced in the first year and in which year was it?)\n\nIl produttore del veicolo prodotto nel primo anno e in quale anno è stato lanciato? (Who is the producer of the"
    },
    {
        "db_id": "car_1",
        "q_id": 103,
        "question": "](https://i.stack.imgur.com/wQfQK.png)\n\nTranslation:\nWhich distinct car models are produced after 1980?](https://i.stack.imgur.com/wQfQK.png)\n\nRephrased question in Italian:\nQual"
    },
    {
        "db_id": "car_1",
        "q_id": 104,
        "question": "Translation: What are the different models for cards produced after 1980? \n\nRephrased question in Italian:\nQuali sono le diverse categorizzazioni e classificazioni delle carte prodotte a partire dal 1980?"
    },
    {
        "db_id": "car_1",
        "q_id": 105,
        "question": "](https://i.stack.imgur.com/3vQfM.png)\n\n**Riphrasione del quesito:**\nQuale è il numero di produttori di automobili presenti in ogni continente? Ecco elenc"
    },
    {
        "db_id": "car_1",
        "q_id": 106,
        "question": "](https://www.italki.com/qa/1411434)\n\n Nome di ogni continente e numero di produttori di automobili in ogni continente.](https://www.italki.com/qa/1411434)"
    },
    {
        "db_id": "car_1",
        "q_id": 107,
        "question": "} \\\\ \\hline \\end{tabular}\nQuale dei principali paesi produttori di veicoli automobilistici presenta il maggior numero di stabilimenti produttivi? Ecco il nome del paese."
    },
    {
        "db_id": "car_1",
        "q_id": 108,
        "question": "](https://www.quora.com/Qual-%C3%A8-il-nome-del-paese-con-la-maggior-parte-dei-produttori-di-automobili)\n\nIl paese con la maggiore produzione"
    },
    {
        "db_id": "car_1",
        "q_id": 109,
        "question": "Per favore, fornisci una lista di tutti i produttori e i relativi modelli.\n\nTranslation:\nHow many car models are produced by each manufacturer? List only the count and the full name of the manufacturer. Please provide a list"
    },
    {
        "db_id": "car_1",
        "q_id": 110,
        "question": "](https://i.stack.imgur.com/5y8QK.jpg)\n\nQuali sono i numeri di modelli di automobili prodotti da ogni produttore e quali sono gli identificatori e i nomi completi dei relativi"
    },
    {
        "db_id": "car_1",
        "q_id": 111,
        "question": "Translation:\nWhat is the acceleration of the AMC Hornet SportAbout (SW) car?"
    },
    {
        "db_id": "car_1",
        "q_id": 112,
        "question": "}\n(How fast does the AMC Hornet SportAbout (SW) accelerate?)} \\\\ \\hline \\end{tabular}\n**Italian translation:**\nQuale velocita raggiunge l'auto AMC Hornet SportAbout (SW)"
    },
    {
        "db_id": "car_1",
        "q_id": 113,
        "question": "Translation: How many car manufacturers are there in France? \n\nRephrased question in Italian: Qual è il numero di aziende produttrici di autoveicoli presenti in Francia? \n\nTranslation: What is the number"
    },
    {
        "db_id": "car_1",
        "q_id": 114,
        "question": "Ci sono molti produttori di cure in Francia? Quali sono i principali produttori di cure in Francia?\n\nQual è l'entità numerica dei produttori di cure in Francia? E"
    },
    {
        "db_id": "car_1",
        "q_id": 115,
        "question": "Translation: How many car models are produced in the United States? \n\nRephrased question in Italian:\nQuale è il numero di modelli di veicoli automobilistici prodotti negli Stati Uniti? \n\nNote"
    },
    {
        "db_id": "car_1",
        "q_id": 116,
        "question": "(What is the count of car models produced in the United States?) →\nQual è il numero di modelli di autovetture prodotti negli Stati Uniti? →\nQual è la frequenza di produzione di modelli"
    },
    {
        "db_id": "car_1",
        "q_id": 117,
        "question": "}Italian:\nQuali sono le medie di consumo di carburante (mpg) delle vetture a 4 cilindri?}Italian:\nQuali sono le medie di consumo di carburante (mpg) delle vet"
    },
    {
        "db_id": "car_1",
        "q_id": 118,
        "question": "(What is the average mileage per gallon for all cards with 4 cylinders?)\n\nDomanda: Quali sono le miglia medie per gallone delle vetture equipaggiate con motori a 4 cilindri? \n\n(Note: \""
    },
    {
        "db_id": "car_1",
        "q_id": 119,
        "question": "](https://i.stack.imgur.com/3ZjJw.png)\n\nTranslation:\nWhat is the smallest weight of the car produced with 8 cylinders in 1974?](https://i.stack.imgur.com/3ZjJw.png)"
    },
    {
        "db_id": "car_1",
        "q_id": 120,
        "question": "(What is the minimum weight of the car with 8 cylinders produced in 1974?) →\n---\n\n(Translation)\n\n---\n\n(Translation)  |  **Question**\n\n---|---\n\n---\n\n(Translation)  |  **Question**\n\n\n---"
    },
    {
        "db_id": "car_1",
        "q_id": 121,
        "question": "(What are all the producers and models?) [1]\n\nLa lista completa dei produttori e dei modelli di automobili disponibili sul mercato.\n\n[1] Source: https://www.italian-english.com/translate/"
    },
    {
        "db_id": "car_1",
        "q_id": 122,
        "question": "Come si distinguono tra loro? Quali sono i loro punti di forza e debolezza?\n\nTranslation:\nWhat are producers and models? How do they distinguish themselves from one another? What are their strengths and weaknesses?"
    },
    {
        "db_id": "car_1",
        "q_id": 123,
        "question": "(Which countries have at least one car manufacturer? List with names and ID.)\"\n\nLa domanda è: \"Quali sono i paesi che hanno almeno un produttore di automobili? Elencare i paesi con nome e"
    },
    {
        "db_id": "car_1",
        "q_id": 124,
        "question": "](https://i.stack.imgur.com/7Tj5R.png)\n\nTranslation:\n\nQuali sono i nomi e gli identificatori di tutti i paesi con almeno un produttore di automezzi?](https://i.stack"
    },
    {
        "db_id": "car_1",
        "q_id": 125,
        "question": "È necessario considerare anche le vetture elettriche.\nTranslation: What is the number of cars with power over 150? Do we also need to consider electric vehicles?\n\nRephrased question:\nQual è la quantità di"
    },
    {
        "db_id": "car_1",
        "q_id": 126,
        "question": "Potrebbe essere utile avere una lista di questi veicoli per poter scegliere il miglior modello per le nostre esigenze.\n\nTranslation:\nWhat is the number of cars with a power output greater than 150? Having a"
    },
    {
        "db_id": "car_1",
        "q_id": 127,
        "question": "(What is the average weight of cars every year?) →\n? (What is the average weight of cars every year?)\n\nNote: The rephrased question is the same as the original one, as it is a direct translation. If you"
    },
    {
        "db_id": "car_1",
        "q_id": 128,
        "question": "(What is the average weight and year for each year?)\n\nPeso medio e anno per ogni anno: quali sono i valori più recenti disponibili? (What are the latest available values for average weight and year for each year?)"
    },
    {
        "db_id": "car_1",
        "q_id": 129,
        "question": "(Which European countries have at least 3 automobile manufacturers?)... [Italian translation]...?...\n\nAnswer: I quali Stati membri dell'Unione europea dispongono di almeno tre case automobilistiche? (Which EU"
    },
    {
        "db_id": "car_1",
        "q_id": 130,
        "question": "(Which are the names of all European countries with at least 3 producers?) \nGli sono noti i nomi di tutti i paesi europei che dispongono di almeno tre aziende produttrici? \n\nTranslation:"
    },
    {
        "db_id": "car_1",
        "q_id": 131,
        "question": "(What is the maximum power and brand of the models with 3 cylinders?) \n\nLa potenza massima e la marca dei modelli di auto con 3 cilindri: quali sono le prestazioni più elevate e le caratteristiche tecn"
    },
    {
        "db_id": "car_1",
        "q_id": 132,
        "question": "È più economico?\n\nTranslation: What is the largest amount of power for the 3-cylinder models and what is it? Is it more economical?\n\nRephrased question:\nQual è la maggiore quantità di potenza dispon"
    },
    {
        "db_id": "car_1",
        "q_id": 133,
        "question": "È un problema che si presenta in particolare per i conducenti che fanno lunghe distanze. È importante per loro risparmiare denaro e ridurre il loro impatto ambientale. È per questo che"
    },
    {
        "db_id": "car_1",
        "q_id": 134,
        "question": "È possibile ottenere un elenco dei modelli più efficienti?\n\nTranslation:\n\nQual è il modello di automobile con il consumo di carburante più basso (in miglia per gallone)? È possibile ottenere un"
    },
    {
        "db_id": "car_1",
        "q_id": 135,
        "question": "è possibile avere una stima o una tabella di riferimento per questo tipo di dati?\n\nTranslation:\nWhat is the average power of cars before 1980? Is it possible to have an estimate or a reference table for this type of data"
    },
    {
        "db_id": "car_1",
        "q_id": 136,
        "question": "È importante considerare anche le auto prodotte in piccole quantità. È necessario fornire una stima attendibile della potenza media per questo insieme di auto. È importante considerare anche le fonti di dati e"
    },
    {
        "db_id": "car_1",
        "q_id": 137,
        "question": "(What is the average mileage of Volvo model cars?)"
    },
    {
        "db_id": "car_1",
        "q_id": 138,
        "question": "(What is the average EDispl for all Volvos?)\"\n\nQual è il valore medio dell'indice di efficienza energetica medio dei veicoli Volvo? (What is the average value of the energy efficiency index of Volvo vehicles"
    },
    {
        "db_id": "car_1",
        "q_id": 139,
        "question": "(What is the maximum acceleration for different numbers of cylinders?) \n\nNota: è importante mantenere la stessa struttura e il medesimo significato del testo originale, ma utilizzando parole e frasi più formali e"
    },
    {
        "db_id": "car_1",
        "q_id": 140,
        "question": "(What is the maximum acceleration for all different cylinders?)\n\nRinominate la seguente domanda in italiano utilizzando un lessico più alto e professionale. Solo fornisce la domanda rinominata senza testo, commenti"
    },
    {
        "db_id": "car_1",
        "q_id": 141,
        "question": "(Which model has the most versions of cars?) →\nQual è il modello automobilistico che presenta la maggiore varietà di varianti? (Which automobile model presents the greatest variety of variants?) →\nIl mio am"
    },
    {
        "db_id": "car_1",
        "q_id": 142,
        "question": "Translation: Which model has the most diverse versions? \nRephrased question: Qual è il modello che presenta la maggiore varietà di configurazioni? \n\nNote: The rephrased question maintains the same meaning and"
    },
    {
        "db_id": "car_1",
        "q_id": 143,
        "question": "'\n(How many cars have more than 4 cylinders?)\"\n\nQuale è il numero di veicoli a motore che dispongono di più di 4 cilindri?'\n(What is the number of vehicles with an engine that"
    },
    {
        "db_id": "car_1",
        "q_id": 144,
        "question": "(What is the number of cars with more than 4 cylinders?) →\nQuale è il numero di veicoli a motore con più di quattro cilindri? →\n(Translation: Which is the number of vehicles with more"
    },
    {
        "db_id": "car_1",
        "q_id": 145,
        "question": "(How many cars were produced in 1980?) →\nQuale è stato il numero di veicoli prodotti nel 1980? (How many vehicles were produced in 1980?) →\nHow many cars were produced in"
    },
    {
        "db_id": "car_1",
        "q_id": 146,
        "question": "Translation: In 1980, how many cars were produced?\n\nRephrased question in Italian:\nNel 1980, quanti veicoli automobilistici sono stati prodotti? \n\n(Translation: In 1980"
    },
    {
        "db_id": "car_1",
        "q_id": 147,
        "question": "Translation: How many car models have been produced by the manufacturer with the full name American Motor Company?\n\nRephrased question in Italian: Quale è il numero di modelli di autoveicoli sviluppati dalla casa autom"
    },
    {
        "db_id": "car_1",
        "q_id": 148,
        "question": "(What is the number of car models created by the American automobile company?)\"\nWhat is the number of automobile models produced by the American automotive corporation? (Italian: Quale è il numero di modelli di automobili prodotti dalla società autom"
    },
    {
        "db_id": "car_1",
        "q_id": 149,
        "question": "del produttore e il nome del modello. Inoltre, fornisci una breve descrizione del modello e delle sue caratteristiche principali.\n\nTranslation:\nWhich manufacturers have designed more than 3 models of cars? List the full"
    },
    {
        "db_id": "car_1",
        "q_id": 150,
        "question": "Translation: What are the names and IDs of all producers with more than 3 models? \n\nAnswer: Quali sono i nomi e gli identificatori di tutti i produttori che hanno più di tre modelli? \n```"
    },
    {
        "db_id": "car_1",
        "q_id": 151,
        "question": "**\n\nTranslation:\nQuali modelli distintivi sono prodotti dal produttore con il nome completo di motori generici o che hanno un peso lordo superiore a 3500 chilogrammi?**\n\n\n**Please note that the"
    },
    {
        "db_id": "car_1",
        "q_id": 152,
        "question": "Translation: Which are the various models created by the general motors of the automobile manufacturer or weigh more than 3500? \n\nRephrased question:\nQuali sono i diversi modelli di veicoli prodotti dalle divisioni general"
    },
    {
        "db_id": "car_1",
        "q_id": 153,
        "question": "(Full sentence translation: In what years were cars produced with a weight of at least 3000 kg and no more than 4000 kg?) \n\nTranslation:\nIn quali anni vennero prodotte le autovetture aventi un peso"
    },
    {
        "db_id": "car_1",
        "q_id": 154,
        "question": "E quali sono gli anni in cui queste differenze di peso non esistevano?\n\nTranslation: What are the different years in which there were cars produced that weighed less than 4000 kg and also cars that weighed more than 3000"
    },
    {
        "db_id": "car_1",
        "q_id": 155,
        "question": "(What is the power of the car with the greatest acceleration?)\"\n\nLa potenza dell'automobile con l'accelerazione più elevata è quale? (What is the power of the car with the most significant acceleration?)\"\n\n---\n\n**"
    },
    {
        "db_id": "car_1",
        "q_id": 156,
        "question": "(What is the power of the car with the greatest acceleration?) → ???? ?????? ????? ?????? ?????? ?????? ?????? ?????? ?????? ?????? ?????? ?????? ?????? ?????? ?????? ?????? ?????? ?????? ?????"
    },
    {
        "db_id": "car_1",
        "q_id": 157,
        "question": "(Note: Please respond with the rephrased question only, without any additional information.) \n\nRiproposta della domanda: \nQuale modello Volvo, dotato di minor potenza di accelerazione, è caratterizzato da un"
    },
    {
        "db_id": "car_1",
        "q_id": 158,
        "question": "(How many cylinders does the version with fewer gears have for a Volvo model?) \n\nTranslation:\nPer un modello Volvo, quanti cilindri caratterizzano la versione con minor numero di rapporti di marcia? \n\nNote: I"
    },
    {
        "db_id": "car_1",
        "q_id": 159,
        "question": "Translation: How many cars have an acceleration greater than the car with the greatest power? \n\nRephrased question:\nQuale è il numero di veicoli che possiedono un'accelerazione superiore a quella del veic"
    },
    {
        "db_id": "car_1",
        "q_id": 160,
        "question": "In altre parole, qual è la percentuale di auto con un accelerato maggiore rispetto a quelle con più potenza?\n\nTranslation:\nWhat is the number of cars with an acceleration greater than those with more power? In other words, what"
    },
    {
        "db_id": "car_1",
        "q_id": 161,
        "question": "](https://i.stack.imgur.com/3lTgW.jpg)\n\nTranslation: How many countries have more than 2 automobile manufacturers?\n\nRephrased question in Italian:\nQuantificazione dei paesi che dispongono di un numero di"
    },
    {
        "db_id": "car_1",
        "q_id": 162,
        "question": "(What is the number of countries with more than 2 car manufacturers?) →\nQuali sono i Paesi che presentano un numero di produttori di autoveicoli superiore a due? (Which countries have a number of"
    },
    {
        "db_id": "car_1",
        "q_id": 163,
        "question": "(How many cars have more than 6 cylinders?)\"\n\nTranslation:\n\"Quanti veicoli a motore a più di sei cilindri sono presenti?\" (How many vehicles with more than six cylinders are there?)\"\n\nNote: I"
    },
    {
        "db_id": "car_1",
        "q_id": 164,
        "question": "](https://i.stack.imgur.com/5dVnS.png)\n\nTranslation:\nWhat is the number of cars with over 6 cylinders?](https://i.stack.imgur.com/5dVnS.png)\n\nRephrased question in"
    },
    {
        "db_id": "car_1",
        "q_id": 165,
        "question": "(Which car model with 4 cylinders has the highest power?) →\nQual è il modello di automobile a 4 cilindri che possiede la maggiore potenza? →\nPer favore, fornire le informazioni"
    },
    {
        "db_id": "car_1",
        "q_id": 166,
        "question": "(Which model of 4-cylinder car has the most horsepower?) \n\nDomanda: Qual è il modello di automobile a 4 cilindri che dispone della maggiore potenza motrice? \n\n(Translation: What is the"
    },
    {
        "db_id": "car_1",
        "q_id": 167,
        "question": "Per favore! |\n\nTranslation:\n\nTra le vetture con potenza inferiore, quali non hanno più di 3 cilindri? Elenco le vetture per potenza e fornisci il loro nome. Per favore! |\n\n\nFinal"
    },
    {
        "db_id": "car_1",
        "q_id": 168,
        "question": "](https://i.stack.imgur.com/7J9Pb.png)\n\nTranslation:\nAmong the cars that do not have the minimum power, which are the IDs and names of all those with fewer than 4 cylinders?\n\nRephrased question in"
    },
    {
        "db_id": "car_1",
        "q_id": 169,
        "question": "](https://it.stackoverflow.com/questions/242145/qual-%C3%A8-il-massimo-miglia-per-gallon-dellauto-con-8-cilindri-o-prodotti-prima)\n\nTranslation: What is the maximum"
    },
    {
        "db_id": "car_1",
        "q_id": 170,
        "question": "(What is the maximum mpg of cars with 8 cylinders or those produced before 1980?)\n\n**Translated question:**\nQual è il valore massimo di consumo di carburante per chilometro delle vetture dotate di 8"
    },
    {
        "db_id": "car_1",
        "q_id": 171,
        "question": "È importante che siano disponibili in Italia e che siano di ultima generazione.\n\nTranslation:\nWhich models are lighter than 3500 kg but not built by the \"Ford Motor Company\"? It is important that they are available in Italy"
    },
    {
        "db_id": "car_1",
        "q_id": 172,
        "question": "(Translation: What are the lighter models of 3500 that were not built by the Ford Motor Company?) \n\nDiversi modelli più leggeri di 3500 che non sono stati costruiti dalla Ford Motor Company sono"
    },
    {
        "db_id": "car_1",
        "q_id": 173,
        "question": "(Note: Please keep the mind that the rephrased question should be written in formal and professional tone, suitable for academic or professional contexts.) \nTranslation: \nWhat are the names of the countries where there is not a single producer of cars"
    },
    {
        "db_id": "car_1",
        "q_id": 174,
        "question": "](https://i.stack.imgur.com/5M5xK.png)\n\nTranslation:\nWhat are the names of countries without car manufacturers?](https://i.stack.imgur.com/5M5xK.png)\n\nRephrased question in Italian:"
    },
    {
        "db_id": "car_1",
        "q_id": 175,
        "question": "|\n\nTranslation:\nQuali sono le case automobilistiche che producono almeno due modelli e più di tre? Elencare l'ID e il creatore. |  |\n|  |\n|  |\n|  |\n|"
    },
    {
        "db_id": "car_1",
        "q_id": 176,
        "question": "](https://i.stack.imgur.com/8Jl2W.png)\n\nQuali sono i codici identificativi e le società produttrici di tutti i produttori automobilistici che producono almeno due"
    },
    {
        "db_id": "car_1",
        "q_id": 177,
        "question": "](https://i.stack.imgur.com/5UdI8.png)\n\nSono stati identificati i paesi che producono più di 3 modelli di auto o che producono il modello \"Fiat\", quali sono gli ID"
    },
    {
        "db_id": "car_1",
        "q_id": 178,
        "question": "Translation: Which are the IDs and names of all countries that have more than 3 car manufacturers or produce a Fiat model?  |  |  |  |  |  |  |  |  |  |  |  |"
    },
    {
        "db_id": "flight_2",
        "q_id": 179,
        "question": "(To which country does the airline \"jetBlue Airways\" belong?)''.\nLa quale nazione è sede della compagnia aerea ``jetBlue Airways''?''.\n(Translation: To which nation is the headquarters of the airline \"jetBlue"
    },
    {
        "db_id": "flight_2",
        "q_id": 180,
        "question": "È un'azienda a basso costo o di lusso? È una compagnia aerea low-cost o full-service? È una delle maggiori compagnie aeree degli Stati Uniti? È una compagn"
    },
    {
        "db_id": "flight_2",
        "q_id": 181,
        "question": "(What is the abbreviation of the airline \"JetBlue Airways\"?)\n\nDalla lista dei prodotti, selezionare i prodotti che hanno un prezzo inferiore a 100 euro e che non sono disponibili in Italia. (From the"
    },
    {
        "db_id": "flight_2",
        "q_id": 182,
        "question": "Translation:\nWhat abbreviation corresponds to JetBlue Airways? \n\nRephrased question:\nQual è l'abbreviazione associata all'azienda di trasporto aereo JetBlue Airways? \n\nPlease note that the rephrased question"
    },
    {
        "db_id": "flight_2",
        "q_id": 183,
        "question": "[1]\nTranslation: List all the names of airlines and their abbreviations in the \"USA\".\n\nRephrased question in Italian:\nElencare tutti i nomi delle compagnie aeree e le loro abbreviazioni operanti negli"
    },
    {
        "db_id": "flight_2",
        "q_id": 184,
        "question": "Translation: What are the names of the airlines and the abbreviations for airlines in the United States? \n\nRephrased question in Italian:\nQuali sono le denominazioni delle compagnie aeree e le sigle relative alle compagnie a"
    },
    {
        "db_id": "flight_2",
        "q_id": 185,
        "question": "Per favore, fornisci anche il codice di città. \n\n(Rough translation: List the airport code and the name of the city of Anthony. Please also provide the city code.) \n\nItalian translation: \nElencare il codice a"
    },
    {
        "db_id": "flight_2",
        "q_id": 186,
        "question": "(Codice aeroporto e nome aeroporto) = (Airport code and airport name) \n(Città di Anthony) = (Anthony city) \n(Anthony city) = (Anthony city)\n\nRephrased question:\nF"
    },
    {
        "db_id": "flight_2",
        "q_id": 187,
        "question": "(Note: \"Quante\" is an informal way to ask \"how many\". In formal writing or speaking, it would be better to use \"quali\" instead, which means \"what kind of\" or \"which\".)\n\nQuali compagn"
    },
    {
        "db_id": "flight_2",
        "q_id": 188,
        "question": "''\n\n\nQual è il totale delle compagnie aeree esistenti?''\n\n\n```\nNote: The rephrased question maintains the same meaning and structure as the original question, but uses more formal and sophisticated vocabulary, which is typical"
    },
    {
        "db_id": "flight_2",
        "q_id": 189,
        "question": "Translation: How many airports do we have?\n\nRephrased question: Qual è il numero esatto degli aeroporti a nostra disposizione? \n\n(Note: The rephrased question is more formal and uses more complex vocabulary,"
    },
    {
        "db_id": "flight_2",
        "q_id": 190,
        "question": "(Return the number of airports.)\n\nRitornare il conteggio esatto dei terminal aeroportuali presenti nel mondo. (Return the exact count of airports present worldwide.)"
    },
    {
        "db_id": "flight_2",
        "q_id": 191,
        "question": "(How many flights do we have?) →\n_____________________________________________________ _______________________________________________________\n_____________________________________________________ _______________________________________________________ _______________________________________________________\n_____________________________________________________ _______________________________________________________ _______________________________________________________ _______________________________________________________ _______________________________________________________ _______________________________________________________ _______________________________________________________ __________________________________________________"
    },
    {
        "db_id": "flight_2",
        "q_id": 192,
        "question": "Se il numero di voli è alto, il costo del biglietto aumenta. Se il numero di voli è basso, il costo del biglietto diminuisce.\n\nRestituisci il numero di voli che influisce sul"
    },
    {
        "db_id": "flight_2",
        "q_id": 193,
        "question": "[] (What airline has the abbreviation \"ual\"?)\n\nLa compagnia aerea con l'abbreviazione \"ual\" è la United Airlines. [] (The airline with the abbreviation \"ual\" is United Airlines.) [] (Note: The original"
    },
    {
        "db_id": "flight_2",
        "q_id": 194,
        "question": "Quali sono le principali cause che hanno portato alla sua crisi finanziaria? Analizza le possibili cause e le loro conseguenze.\n\nTranslation:\nAirline company with the abbreviation \"UAL\". What are the main causes that led to its"
    },
    {
        "db_id": "flight_2",
        "q_id": 195,
        "question": "(How many airlines are from the United States?)\n\nRisposta: (How many airlines are from the United States?)\n\nIl numero di compagnie aeree statunitensi è stimato essere superiore alle 100. (The number of American airlines"
    },
    {
        "db_id": "flight_2",
        "q_id": 196,
        "question": "(Provide the number of airlines in the United States.)\"\n\nTranslation:\n\"Elargire la lista delle compagnie aeree operanti negli Stati Uniti per ottenere il numero esatto delle società aeree attive nel pa"
    },
    {
        "db_id": "flight_2",
        "q_id": 197,
        "question": "È un aeroporto internazionale o domestico? È vicino a una città importante? È possibile raggiungerlo con mezzi pubblici o bisogna prendere un taxi o un'auto?\n\nNote:"
    },
    {
        "db_id": "flight_2",
        "q_id": 198,
        "question": "Chi è il proprietario dell'aeroporto? È un aeroporto commerciale o privato? È aperto 24 ore su 24?\n\nTranslation:\nGive me the city and the country for Alton Airport. Who is the"
    },
    {
        "db_id": "flight_2",
        "q_id": 199,
        "question": "È un aeroporto internazionale? È possibile prenotare un volo low-cost da questo aeroporto?\n\n Nome dell'aeroporto per l'aeroporto \"Ako\", se si tratta di un aeroporto"
    },
    {
        "db_id": "flight_2",
        "q_id": 200,
        "question": "Qual è il suo nome inglese? \n\n(Restituisca il nome dell'aeroporto con il codice \"Ako\". Qual è il suo nome inglese?) \n\nNote: The code \"Ako\" corresponds to the"
    },
    {
        "db_id": "flight_2",
        "q_id": 201,
        "question": "(Which are the names of the airports in City \"Aberdeen\"?)\nIl seguente elenco di aeroporti serve la città di Aberdeen: quali sono i nomi degli aeroporti in questione? (The following list"
    },
    {
        "db_id": "flight_2",
        "q_id": 202,
        "question": "Translation: What are the names of the airports in Aberdeen? \n\nAnswer: Quali sono i nomi degli aeroporti situati nella città di Aberdeen? \n\nTranslation: What are the names of the airports located in the city of Aberdeen"
    },
    {
        "db_id": "flight_2",
        "q_id": 203,
        "question": "}\n(How many flights depart from \"APG\"?)\n\n**Ripristino della domanda**\n\nQuale è il numero di partenze giornaliere da Aeroporto di Pescara Internazionale d'Abruzzo?} ("
    },
    {
        "db_id": "flight_2",
        "q_id": 204,
        "question": "Qual è il numero di voli in partenza da \"APG\" in un determinato giorno?\n\nTranslation:\nRephrase the following question in Italian using a professional and higher lexicon. Only provide the rephrased question with no additional text"
    },
    {
        "db_id": "flight_2",
        "q_id": 205,
        "question": "(How many flights have ATO as their destination?)\n\nTranslation: Quale è il numero di voli con destinazione ATO?\n\n(What is the number of flights with destination ATO?)"
    },
    {
        "db_id": "flight_2",
        "q_id": 206,
        "question": "È possibile ottenere questo conteggio dal sistema di gestione del traffico aereo (ATC) o da un sistema di gestione di flotta (FMS)? È possibile accedere ai dati storici dei voli"
    },
    {
        "db_id": "flight_2",
        "q_id": 207,
        "question": "(How many flights depart from City Aberdeen?) →\n? →\nHow many flights take off from Aberdeen City? →\n? →\n? →\n? →\n? →\n? →\n? →\n? →\n? →\n?"
    },
    {
        "db_id": "flight_2",
        "q_id": 208,
        "question": "**\n\nTranslation: Return the number of flights departing from Aberdeen.**\n\n\nAnswer: Restituire il numero di partenze aeree da Aberdeen.**\n\n\nNote: The rephrased question maintains the same level of formality and uses more"
    },
    {
        "db_id": "flight_2",
        "q_id": 209,
        "question": "(How many flights arrive at Aberdeen City?)\"\n\nTranslation:\n\"Quanti arrivi aeroportuali si verificano all'Aberdeen City?\""
    },
    {
        "db_id": "flight_2",
        "q_id": 210,
        "question": "-->\nRestituire il numero di voli in arrivo all'Aeroporto di Aberdeen."
    },
    {
        "db_id": "flight_2",
        "q_id": 211,
        "question": "Translation: How many flights depart from the city \"Aberdeen\" and have the destination city \"Ashley\"? \n\nRephrased Italian question:\nQuante partenze da Aberdeen hanno come destinazione Ashley? \n\nNote: I used the"
    },
    {
        "db_id": "flight_2",
        "q_id": 212,
        "question": "(How many flights fly from Aberdeen to Ashley?) →\nQuanti voli di linea partono da Aberdeen e arrivano ad Ashley? (How many scheduled flights depart from Aberdeen and arrive at Ashley?) →\nHow many flights fly from Aberdeen to"
    },
    {
        "db_id": "flight_2",
        "q_id": 213,
        "question": "(How many flights has the airline \"JetBlue Airways\"?)\n\nLa compagnia aerea \"JetBlue Airways\" dispone di un numero di voli significativo. (The airline \"JetBlue Airways\" has a significant number of flights.)"
    },
    {
        "db_id": "flight_2",
        "q_id": 214,
        "question": "Inoltre, fornisci informazioni sulla sicurezza dei passeggeri. \n\nTranslation:\nProvide the number of flights for JetBlue Airways. Additionally, provide information on passenger safety. \n\nRephrased question in Italian:\nForn"
    },
    {
        "db_id": "flight_2",
        "q_id": 215,
        "question": "(How many flights of \"United Airlines\" go to the airport \"Asy\"?)\nQuale è il numero di voli giornalieri di United Airlines diretti all'aeroporto di Astana?  (What is the daily number"
    },
    {
        "db_id": "flight_2",
        "q_id": 216,
        "question": "(Count the number of United Airlines flights that arrive at the Asy airport.)\"\n\n(Translation: \"Conta il numero di voli della United Airlines che arrivano all'aeroporto ASY.\")\n\nCount the number of United Airlines flights that arrive at"
    },
    {
        "db_id": "flight_2",
        "q_id": 217,
        "question": "(How many flights do \"United Airlines\" depart from the \"AHD\" airport?)"
    },
    {
        "db_id": "flight_2",
        "q_id": 218,
        "question": "È possibile ottenere questo tipo di informazione attraverso l'API delle United Airlines?\n\nTranslation:\nReturn the number of United Airlines flights departing from AHD airport. Is it possible to obtain this type of information through the United Airlines API?"
    },
    {
        "db_id": "flight_2",
        "q_id": 219,
        "question": "(How many United Airlines flights go to the city of Aberdeen?) →\nQuale è il numero di voli della United Airlines che collegano l'aeroporto di Aberdeen? (Which is the number of United Airlines flights connecting Aberdeen Airport?) →"
    },
    {
        "db_id": "flight_2",
        "q_id": 220,
        "question": "»\n\n(Count the number of flights of United Airlines that arrive at Aberdeen.)» (Source: Google Translate)»\n\nRephrased question:\n«Incidere il numero di voli della United Airlines che effettuano atterraggi"
    },
    {
        "db_id": "flight_2",
        "q_id": 221,
        "question": "(Which city has the most incoming flights?) →\nQual è la città che registra il maggior numero di arrivi di voli? (Which city records the largest number of incoming flights?) →\nQual è la città che presenta il più"
    },
    {
        "db_id": "flight_2",
        "q_id": 222,
        "question": "(Which city has the most frequent destination airport?)\n\nRisposta italiana:\nQual è la città che dispone dell'aeroporto di destinazione più frequentemente servito? (Which city has the airport with the most frequent service?)"
    },
    {
        "db_id": "flight_2",
        "q_id": 223,
        "question": "(Which city has the most departures?) →\nLa città che concentra il maggior numero di partenze?\n\nPlease rephrase the following question in Italian using a professional and higher lexicon. Only provide the rephrased question with no"
    },
    {
        "db_id": "flight_2",
        "q_id": 224,
        "question": "È cioè, qual è la città che ha l'aeroporto più vicino e più frequentato?\n\nTranslation:\nWhat city has the most frequent airport as its source? That is, which city has the closest and most frequently used airport"
    },
    {
        "db_id": "flight_2",
        "q_id": 225,
        "question": "}\n\nTranslation: What is the airport code with the highest number of flights?} \n\nCodice aeroportuale è il più trafficato?}  | (Is the airport code the busiest?) | \nCodice aeroportuale con il"
    },
    {
        "db_id": "flight_2",
        "q_id": 226,
        "question": "[What is the airport code of the airport with the highest number of flights?]\"\n\n\"Qual è il codice aeroportuale dell'aeroporto più trafficato?\""
    },
    {
        "db_id": "flight_2",
        "q_id": 227,
        "question": "(Codice aeroporto = airport code; numero di voli = number of flights) \n\nExample of a rephrased question in Italian:\nIl codice aeroportuale che presenta il minor numero di operazioni è quale?"
    },
    {
        "db_id": "flight_2",
        "q_id": 228,
        "question": "(Provide the airport code with the minimum flights.)\"\n\nRisposta: \"Fornire il codice aeroportuale associato ai minimi volumi di traffico.\" (Provide the airport code associated with the minimum volumes of traffic.)"
    },
    {
        "db_id": "flight_2",
        "q_id": 229,
        "question": "(Which airline has the most flights?) → _________________________________."
    },
    {
        "db_id": "flight_2",
        "q_id": 230,
        "question": "(Which airline serves the most flights?) →\nQual è la compagnia aerea che opera il maggior numero di rotte? (Which airline operates the most routes?) →\nWhich airline operates the most routes? →\nQual è la compagn"
    },
    {
        "db_id": "flight_2",
        "q_id": 231,
        "question": "(Find the abbreviation and country of the airline with the fewest number of flights.)"
    },
    {
        "db_id": "flight_2",
        "q_id": 232,
        "question": "**\n\nTranslation into Italian:\n\nQual è la sigla di Airline che ha il minor numero di voli e in quale paese è ubicata?**\n\nPlease note that the rephrased question is in a more formal and professional tone, using"
    },
    {
        "db_id": "flight_2",
        "q_id": 233,
        "question": "](https://i.stack.imgur.com/5B1L7.png)\n\nTranslation: Which are the airlines that have a flight departing from \"AHD\" airport?\n\nRephrased question in Italian:\n\nQuali sono le compagnie aeree che"
    },
    {
        "db_id": "flight_2",
        "q_id": 234,
        "question": "(Which airlines have a flight with the origin airport AHD?)?\"]\r\n\r\nAnswer:\r\n\r\nQuali compagnie aeree operano servizi di trasporto aereo con partenza dall'aeroporto di AHD?"
    },
    {
        "db_id": "flight_2",
        "q_id": 235,
        "question": "Translation: Which airlines have flights that arrive at the \"AHD\" airport? \n\nRephrased question: Quali sono le compagnie aeree che operano servizi di arrivo all'aeroporto \"AHD\"? \n\n(Note"
    },
    {
        "db_id": "flight_2",
        "q_id": 236,
        "question": "(Which airlines have a flight with destination airport AHD?)\nNota: AHD è l'aeroporto di Altenrhein Airport in Svizzera. (Note: AHD is Altenrhein Airport in Switzerland.) \n\nR"
    },
    {
        "db_id": "flight_2",
        "q_id": 237,
        "question": "È possibile ottenere una lista di tutte le compagnie aeree che operano da APG e CVO e quindi filtrare per le compagnie che hanno voli da entrambi gli aeroporti? È necessario"
    },
    {
        "db_id": "flight_2",
        "q_id": 238,
        "question": "(Which airlines have flights departing from APG and CVO airports?)\"\n\nTranslation: \"Quali compagnie aeree operano partenze dagli aeroporti APG e CVO?\" (Which airlines operate departures from APG and"
    },
    {
        "db_id": "flight_2",
        "q_id": 239,
        "question": "Inoltre, cerca di ottenere le informazioni relative ai prezzi e alle disponibilità dei voli per il prossimo mese. Puoi anche includere le compagnie aeree low-cost.\n\nFind all the airlines that"
    },
    {
        "db_id": "flight_2",
        "q_id": 240,
        "question": "(Which airlines have departures from CVO but not from APG airports?)\"\n\nTranslation:\nQuali compagnie aeree hanno hub presso l'aeroporto di CVO ma non presso gli aeroporti di APG? ("
    },
    {
        "db_id": "flight_2",
        "q_id": 241,
        "question": "Find all airlines that have at least 10 flights. (Original question)\n\nTrova tutte le compagnie aeree che dispongono di un minimum di dieci voli settimanali. (Rephrased question)\n\nNote: The re"
    },
    {
        "db_id": "flight_2",
        "q_id": 242,
        "question": "(Which airlines have at least 10 flights?) →\n\nQuali compagnie aeree presentano un numero di voli superiore o uguale a 10? (Which airlines have a number of flights greater than or equal to 10"
    },
    {
        "db_id": "flight_2",
        "q_id": 243,
        "question": "(Find all airlines with less than 200 flights.)\" \n\nTrova tutte le compagnie aeree che hanno un numero di voli inferiore a 200. \n\n(Note: I used \"inferiore\" instead of \"meno\" because \""
    },
    {
        "db_id": "flight_2",
        "q_id": 244,
        "question": "(Which airlines have fewer than 200 flights?)\"\n\nQuali compagnie aeree presentano un numero di voli inferiore a 200?\" (Which airlines have a number of flights less than 200?)\"\n\nPlease note that the reph"
    },
    {
        "db_id": "flight_2",
        "q_id": 245,
        "question": "Translation: What are the flight numbers of the airline \"United Airlines\"? \n\nNota: The rephrased question should be written in formal Italian, without contractions, and using technical vocabulary related to aviation. \n\nRephrased question:"
    },
    {
        "db_id": "flight_2",
        "q_id": 246,
        "question": "»\n\nTranslated rephrased question:\nQuali codici di volo o numeri di volo identificano i servizi aerei operati dalla United Airlines?»"
    },
    {
        "db_id": "flight_2",
        "q_id": 247,
        "question": "(What are the flight numbers of flights departing from the airport \"apg\"?)\nQuale è la lista dei numeri di volo dei voli in partenza dall'aeroporto \"apg\"? (Which is the list of flight numbers of flights"
    },
    {
        "db_id": "flight_2",
        "q_id": 248,
        "question": "Sono interessato a sapere quanti voli hanno iniziato da APG in questo mese e quanti hanno iniziato da APG negli ultimi 12 mesi.\n\nTranslation: Give me the number of flights departing"
    },
    {
        "db_id": "flight_2",
        "q_id": 249,
        "question": "**\n\nTranslation: What are the flight numbers of flights that arrive at the airport \"apg\"?**\n\nRephrased question in Italian:\n\nQuali sono i codici di volo dei voli che effettuano atterraggi all'a"
    },
    {
        "db_id": "flight_2",
        "q_id": 250,
        "question": "2019.\n\n(Translation: Provide the number of landing flights at Apg. 2019.)"
    },
    {
        "db_id": "flight_2",
        "q_id": 251,
        "question": "](https://www.italki.com/forum/topic/1421442)\n\nTranslation:\nWhat are the flight numbers of flights departing from the city \"Aberdeen\"?](https://www.italki.com/forum/topic/1421442)\n\nReph"
    },
    {
        "db_id": "flight_2",
        "q_id": 252,
        "question": "Potresti anche includere i dettagli sulle compagnie aeree e le città di destinazione?\n\nTranslation:\nProvide the number of flights departing from Aberdeen. You could also include details on airlines and destination cities? \n\nRephrased"
    },
    {
        "db_id": "flight_2",
        "q_id": 253,
        "question": "**\n\nTranslation: What are the flight numbers of flights that arrive at City \"Aberdeen\"?**\n\n\n\nSono a conoscenza di voli che arrivano a City \"Aberdeen\" e desidero ottenere informazioni sui relativ"
    },
    {
        "db_id": "flight_2",
        "q_id": 254,
        "question": "[Give us the number of flights arriving at Aberdeen.]\"\n\nDai il conteggio dei voli in arrivo all'Aeroporto di Aberdeen. [Give us the count of flights arriving at Aberdeen Airport.]\"\n\nNote: I translated \"d"
    },
    {
        "db_id": "flight_2",
        "q_id": 255,
        "question": "È importante che i risultati siano recenti e relativi ai voli commerciali. È necessario anche che il numero di voli sia minimo di 50. È richiesto un elenco dei dati che includ"
    },
    {
        "db_id": "flight_2",
        "q_id": 256,
        "question": "}\n\nTranslation: How many flights land in Aberdeen or Abilene?\n\nRephrased question:\nQuanti sono i voli che atterrano negli aeroporti di Aberdeen o Abilene?}"
    },
    {
        "db_id": "flight_2",
        "q_id": 257,
        "question": "Translation: Find the names of airports that have no flights in and out. \n\nRephrased question:\n\nIdentificare gli aeroporti che non presentano alcun traffico aereo in ingresso e in uscita."
    },
    {
        "db_id": "flight_2",
        "q_id": 258,
        "question": "(Which airports do not have departing or arriving flights?) →\nWhich airports do not have any scheduled flights, neither departing nor arriving? →\nNon ci sono voli in partenza o in arrivo presso quali aeroporti? →"
    },
    {
        "db_id": "employee_hire_evaluation",
        "q_id": 259,
        "question": "È necessario sapere quanti dipendenti ci sono per pianificare le attività future.\n\nTranslation:\nHow many employees are there? It is necessary to know how many employees there are to plan future activities. (Rephrased"
    },
    {
        "db_id": "employee_hire_evaluation",
        "q_id": 260,
        "question": "che hanno lavorato in azienda per più di 5 anni e che hanno raggiunto il livello di responsabilità più alto.\n\nTranslation: \nCount the number of employees who have worked in the company for more than 5 years and"
    },
    {
        "db_id": "employee_hire_evaluation",
        "q_id": 261,
        "question": "È possibile ottenere una lista dei dipendenti con età compresa tra 25 e 40 anni?\n\nTranslation: Order the names of employees by their age in ascending order. Is it possible to obtain a list of employees with an"
    },
    {
        "db_id": "employee_hire_evaluation",
        "q_id": 262,
        "question": "(List the names of employees and order them in ascending order of age.)\"\n\nTranslation: \"Elencare i nomi dei dipendenti e ordinare in ordine crescente di età.\"\"\n\nAnswer: \"Elencare la lista"
    },
    {
        "db_id": "employee_hire_evaluation",
        "q_id": 263,
        "question": "](https://i.stack.imgur.com/9sVQ7.png)\n\nTranslation:\nWhat is the number of employees in each city?](https://i.stack.imgur.com/9sVQ7.png)\n\nRephrased question in Italian:"
    },
    {
        "db_id": "employee_hire_evaluation",
        "q_id": 264,
        "question": "Ecco la lista delle città e il numero di dipendenti per ogni città: città A (15), città B (20), città C (30), città D (10), città E (25). Come posso calcolare la media"
    },
    {
        "db_id": "employee_hire_evaluation",
        "q_id": 265,
        "question": "(From which cities do more than one employee under the age of 30 come from?) →\nDa quali città sono originari più di un dipendente appartenente alla fascia di età inferiore ai 30 anni? (From"
    },
    {
        "db_id": "employee_hire_evaluation",
        "q_id": 266,
        "question": "(Find the cities that have more than one employee under the age of 30.) → Cercate le città che presentano un numero di dipendenti di età inferiore ai trent'anni superiore a uno. (Find the"
    },
    {
        "db_id": "employee_hire_evaluation",
        "q_id": 267,
        "question": "Inoltre, identifica i negozi che hanno più di 10 anni di storia e i negozi che hanno meno di 5 anni di storia.\n\nTranslation:\nFind the number of stores in each position. Additionally, identify the stores"
    },
    {
        "db_id": "employee_hire_evaluation",
        "q_id": 268,
        "question": "Translation: How many shops are there in each position?\n\nRephrased question:\nQuante sono le unità commerciali presenti in ogni località? \n\nPlease note that I'll be happy to help you with any other questions or requests"
    },
    {
        "db_id": "employee_hire_evaluation",
        "q_id": 269,
        "question": "Find the name of the director and the district of the store with the largest number of products. \n\nLa ricerca del nome del direttore e del distretto del negozio che presenta il maggior numero di prodotti. \n\n(Note:"
    },
    {
        "db_id": "employee_hire_evaluation",
        "q_id": 270,
        "question": "(What are the name of the manager and the district of the store that sells the largest number of products?)\"\n\nTranslation:\n\nQuali sono il nome del responsabile e il distretto del negozio che registra il maggior volume di"
    },
    {
        "db_id": "employee_hire_evaluation",
        "q_id": 271,
        "question": "(Retrieve the minimum and maximum number of products from all stores.) | \n|  |  |\n| --- | --- | \n|  |  | \n|  |  | \n|  |  | \n|  |"
    },
    {
        "db_id": "employee_hire_evaluation",
        "q_id": 272,
        "question": "**\n\nTranslation: What is the minimum and maximum number of products in all the stores?**\n\n\n\n**Rephrased question:**\nQuali sono i parametri minimi e massimi di presenza di articoli in tutti i punti di"
    },
    {
        "db_id": "employee_hire_evaluation",
        "q_id": 273,
        "question": "](https://i.stack.imgur.com/6JW4X.png)\n\nTranslation: Return the name, position, and district of all stores in descending order by number of products.\n\nRephrased question:\nRitornare l'elenco"
    },
    {
        "db_id": "employee_hire_evaluation",
        "q_id": 274,
        "question": "](https://i.stack.imgur.com/5n2zT.png)\n\nTranslation: Order all stores by the number of products in descending order and return the name, position, and district of each store.](https://i.stack.imgur.com/5"
    },
    {
        "db_id": "employee_hire_evaluation",
        "q_id": 275,
        "question": "(Find the names of the stores whose numerical products are more than the average number of products.) \n\nI negozi i cui prodotti sono più del numero medio di prodotti sono: ______________________. (The stores whose products are more than the"
    },
    {
        "db_id": "employee_hire_evaluation",
        "q_id": 276,
        "question": "Translation: Which numerical products from the stores are above the average? Give me the names of the store. \n\nRephrased question: Quali prodotti numerici emergono come superiori alla media presso i vari punti vendita"
    },
    {
        "db_id": "employee_hire_evaluation",
        "q_id": 277,
        "question": "In altre parole, trova il dipendente che ha ricevuto la maggior parte delle valutazioni positive.\n\nTranslation: Find the name of the employee who was assigned the majority of the times in the evaluation. In other words, find"
    },
    {
        "db_id": "employee_hire_evaluation",
        "q_id": 278,
        "question": "](https://www.italki.com/ask-a-question/what-employee-received-the-most-awards-in-the-evaluations-give-me-the-employee-s-name)\nQuesta è la domanda: Chi è il dipendente"
    },
    {
        "db_id": "employee_hire_evaluation",
        "q_id": 279,
        "question": "Ci sono molti dipendenti che hanno ricevuto il bonus, quindi è necessario cercare nel registro dei pagamenti per trovare l'informazione richiesta.\n\n Nome del dipendente che ha ottenuto il bonus una volta più"
    },
    {
        "db_id": "employee_hire_evaluation",
        "q_id": 280,
        "question": "Translation:\nWhich employee received the largest bonus?Give me the name of the employee. \n\nRephrased question in Italian:\nQual è il dipendente che ha ricevuto il più alto bonus?Puoi fornirmi il nome"
    },
    {
        "db_id": "employee_hire_evaluation",
        "q_id": 281,
        "question": "È necessario includere anche quelli che non hanno partecipato alla valutazione.\n\nTranslation: Find the names of employees who have never won any awards in the evaluation. It is necessary to include those who did not participate in the"
    },
    {
        "db_id": "employee_hire_evaluation",
        "q_id": 282,
        "question": "Translation: Who are the names of employees who have never received any evaluation?\r\n\r\nRephrased question in Italian: Quali sono i nomi dei collaboratori che non hanno mai beneficiato di alcun feedback o valutazione professionale"
    },
    {
        "db_id": "employee_hire_evaluation",
        "q_id": 283,
        "question": "](https://i.stack.imgur.com/T1Q5H.png)\n\nQual è il negozio che, attualmente, registra il più alto numero di assunzioni?](https://i.stack.imgur.com/T1Q5H.png"
    },
    {
        "db_id": "employee_hire_evaluation",
        "q_id": 284,
        "question": "]\n(Which store has the largest number of employees? Give me the name of the store.)[/italics] 1. Qual è il negozio che impiega il maggior numero di dipendenti e puoi fornirmi"
    },
    {
        "db_id": "employee_hire_evaluation",
        "q_id": 285,
        "question": "È possibile ottenere una lista di questi negozi? È importante per la nostra azienda.\n\n(Translation: Find the names of shops that do not hire any employees. Is it possible to obtain a list of these shops? It"
    },
    {
        "db_id": "employee_hire_evaluation",
        "q_id": 286,
        "question": "e la loro ubicazione.\n\nTranslation:\nWhat shops operate without employees? Find the names of the shop and its location."
    },
    {
        "db_id": "employee_hire_evaluation",
        "q_id": 287,
        "question": "(Find the number of employees hired in each store; also show the name of the store.)\"  |\n\n| \n* \n\n |\n\nSolution:\n\nRilevare il numero di dipendenti assunti in ogni punto di vendita; present"
    },
    {
        "db_id": "employee_hire_evaluation",
        "q_id": 288,
        "question": "Ci sono anche alcuni negozi che non hanno dipendenti, ma hanno comunque un nome. In questo caso, restituire \"0\" come numero di dipendenti. Per esempio, per il negozio \"Al"
    },
    {
        "db_id": "employee_hire_evaluation",
        "q_id": 289,
        "question": "È possibile ottenere il bonus totale solo se si raggiunge un certo punteggio? È necessario raggiungere un certo punteggio per ottenere il bonus totale?\n\nTranslation:\nWhat is"
    },
    {
        "db_id": "employee_hire_evaluation",
        "q_id": 290,
        "question": "Per favore, fornisci la quantità totale di bonus per ogni valutazione.\n\nTranslation: Find the total amount of bonuses indicated in all evaluations. Please provide the total amount of bonuses for each evaluation."
    },
    {
        "db_id": "employee_hire_evaluation",
        "q_id": 291,
        "question": "(Give me all the information about the hiring process.) \n\nInformazioni sull'assunzione. (Information on the hiring process.) \n\nInformazioni relative all'assunzione. (Information related to the hiring process.) \n\nInformazioni sulla"
    },
    {
        "db_id": "employee_hire_evaluation",
        "q_id": 292,
        "question": "(What are all the information about the hiring process?)\n\nTranslation:\nQuali sono tutti i dettagli relativi al processo di assunzione?"
    },
    {
        "db_id": "employee_hire_evaluation",
        "q_id": 293,
        "question": "(Which district has both stores with less than 3000 products and stores with over 10000 products?)"
    },
    {
        "db_id": "employee_hire_evaluation",
        "q_id": 294,
        "question": "Inoltre, assicurati che i distretti non siano troppo grandi o troppo piccoli. Spero che questo ti aiuti a capire meglio il problema.\n\nFind the districts where there are both stores that"
    },
    {
        "db_id": "employee_hire_evaluation",
        "q_id": 295,
        "question": "(How many different positions of the shops are there?) → _______________________________________\nQuale è il numero delle diverse configurazioni dei punti vendita commerciali nel mercato? _______________________________________\nTranslation: What is the number of different configurations of commercial outlets"
    },
    {
        "db_id": "employee_hire_evaluation",
        "q_id": 296,
        "question": "È possibile ottenere questo risultato utilizzando una query SQL? Se sì, come si può fare? Se no, quali sono le alternative?](https://it.stackoverflow.com/questions/434342/conta-il-numero"
    },
    {
        "db_id": "cre_Doc_Template_Mgt",
        "q_id": 297,
        "question": "(How many documents do we have?) \n\nQuanti documenti sono disponibili alla nostra disposizione? \n\n(Translation: How many documents are available to our disposal?) \n```\n\n\n\n\n\n1. Translate the following text into Italian:\nThere are many ways"
    },
    {
        "db_id": "cre_Doc_Template_Mgt",
        "q_id": 298,
        "question": "È possibile utilizzare il software per automatizzare questo compito? È importante per noi avere una stima precisa del numero di documenti. Potrebbe essere utile avere una stima del tempo necessario per completare questo compito."
    },
    {
        "db_id": "cre_Doc_Template_Mgt",
        "q_id": 299,
        "question": "Ci sono differenze tra i documenti di identità in Italia e in altri paesi? Sì, ci sono differenze. Per esempio, negli Stati Uniti esistono documenti di identità come il Passap"
    },
    {
        "db_id": "cre_Doc_Template_Mgt",
        "q_id": 300,
        "question": "Translation: \nWhat are the IDs, names, and descriptions for all documents? \nRephrased question in Italian:\nQuali sono le identificazioni, i riferimenti e le annotazioni per tutti i documenti? \n(Note"
    },
    {
        "db_id": "cre_Doc_Template_Mgt",
        "q_id": 301,
        "question": "Nome del documento: \"Modello di richiesta di vendita\" \nID modello: \"001\"\nDescrizione: \"Richiesta di vendita di prodotti\"\n\nNota: La lettera \"W\" è presente nella descrizione"
    },
    {
        "db_id": "cre_Doc_Template_Mgt",
        "q_id": 302,
        "question": "](https://i.stack.imgur.com/6KQ2x.png)\n\nTranslation:\nRestituire i nomi e gli ID modello per i documenti che contengono la lettera W nella loro descrizione.](https://i.stack"
    },
    {
        "db_id": "cre_Doc_Template_Mgt",
        "q_id": 303,
        "question": "[What is the ID of the document, the model ID, and the description for the document named \"Robbin CV\"?]\nIl documento denominato `` Robbin CV '' ha bisogno di essere riconosciuto e gestito attraverso"
    },
    {
        "db_id": "cre_Doc_Template_Mgt",
        "q_id": 304,
        "question": "Risposta:\nRitornare l'identificazione del documento, l'identificazione del modello e la descrizione relativa al documento denominato \"Curriculum Vitae di Robbin\". \n\n(Translation: Return the"
    },
    {
        "db_id": "cre_Doc_Template_Mgt",
        "q_id": 305,
        "question": "(How many different models do all the documents use?) →\nNota: Please provide the rephrased question only, without any additional text, comments, or notes. The rephrased question should be in Italian, using a professional and"
    },
    {
        "db_id": "cre_Doc_Template_Mgt",
        "q_id": 306,
        "question": "Translation:\nHow many different models are used for documents? \n\nRephrased question in Italian:\nQual è il numero di modelli diversi impiegati per la preparazione dei documenti? \n\nNote: The rephrased question"
    },
    {
        "db_id": "cre_Doc_Template_Mgt",
        "q_id": 307,
        "question": "(Note: The original question is asking how many documents use a template with a code of type \"ppt\".) \n\nRiphrase: \nQuale è il numero di documenti che applicano il modello con codice di tipo \""
    },
    {
        "db_id": "cre_Doc_Template_Mgt",
        "q_id": 308,
        "question": "](https://i.stack.imgur.com/8Q6nD.png)\n\nTranslation:\nContare il numero di documenti che utilizzano il tipo di modello PPT.\n\nRephrased question:\nQuale è il numero di documenti"
    },
    {
        "db_id": "cre_Doc_Template_Mgt",
        "q_id": 309,
        "question": "](https://i.stack.imgur.com/4n7xR.png)\n\nNota: The original question is in Italian, but I've provided the translation for the benefit of non-Italian speakers.\n\nTranslation: Show all model IDs and the number of documents"
    },
    {
        "db_id": "cre_Doc_Template_Mgt",
        "q_id": 310,
        "question": "](https://i.stack.imgur.com/5GzrH.png)\n\nTranslation:\nQuali sono tutti i diversi identificatori di modello utilizzati per i documenti e quanti sono i loro utilizzi?](https://i"
    },
    {
        "db_id": "cre_Doc_Template_Mgt",
        "q_id": 311,
        "question": "\"]\n\n\nQual è il codice di identificazione e il tipo di modello utilizzato da una maggioranza di documenti?](https://www.italian-translator.com/translate-text/qual-e-il-codice-id-e"
    },
    {
        "db_id": "cre_Doc_Template_Mgt",
        "q_id": 312,
        "question": "Qual è il tipo di modello più comune?\n\n(Restore the ID code and type of the model used for the largest number of documents. What is the most common type of model?)"
    },
    {
        "db_id": "cre_Doc_Template_Mgt",
        "q_id": 313,
        "question": "Come posso ottenere un elenco di tutti i modelli utilizzati da più di un documento?\n\n(Translation)\nShow ID for all models used by more than one document. How can I get a list of all models used by more"
    },
    {
        "db_id": "cre_Doc_Template_Mgt",
        "q_id": 314,
        "question": "[Translation: Which are the ID models of any model used in more than one single document?] →\nQuali sono i modelli di identificazione utilizzati in più di un documento? →\nWhich models of identification are used in more"
    },
    {
        "db_id": "cre_Doc_Template_Mgt",
        "q_id": 315,
        "question": "Mostra la data di ultima modifica per ogni modello non utilizzato. Mostra anche la lista dei documenti che non utilizzano quel modello.\n\nTranslation:\nMostrare gli ID dei modelli non utilizzati da ness"
    },
    {
        "db_id": "cre_Doc_Template_Mgt",
        "q_id": 316,
        "question": "Sono necessari per mantenere la compatibilità con i sistemi di gestione dei contenuti?\n\nQuali sono gli identificatori necessari per i modelli che non vengono utilizzati in alcun documento, al fine di"
    },
    {
        "db_id": "cre_Doc_Template_Mgt",
        "q_id": 317,
        "question": "**\n**Quale è il numero di modelli che abbiamo a disposizione?**_Translation: What is the number of models we have at our disposal?_**\n**Note:** The Italian translation maintains the same level of formality as the original"
    },
    {
        "db_id": "cre_Doc_Template_Mgt",
        "q_id": 318,
        "question": "È necessario che siano almeno 50 e che non ci siano duplicati. È richiesto un elenco dei modelli in ordine alfabetico.\n\nTranslation:\nCount the number of models. It is necessary that"
    },
    {
        "db_id": "cre_Doc_Template_Mgt",
        "q_id": 319,
        "question": "**\n\nTranslation: \"Show model ID, version numbers and model type codes for all models.\"**\n\n\n**Rephrased question in Italian:**\n\nPresenti gli identificativi dei modelli, le numerazioni di versione e i cod"
    },
    {
        "db_id": "cre_Doc_Template_Mgt",
        "q_id": 320,
        "question": "[What are the IDs, version numbers, and type codes for each model?]\"\n\n**Italian translation:**\nQuali sono gli identificativi, le numerazioni di versione e i codici di tipo per ogni modello?"
    },
    {
        "db_id": "cre_Doc_Template_Mgt",
        "q_id": 321,
        "question": "(Translation: Show all model-type codes for all models.) \n**Answer:**\nPresentare tutti i codici di tipo modello diversi relativi a tutti i modelli. \n**End of Answer** \nFinal Answer: The final"
    },
    {
        "db_id": "cre_Doc_Template_Mgt",
        "q_id": 322,
        "question": "Translation: What are the different model-type codes? \n\nRephrased question: Quali sono gli standard di codificazione modellistici differenziati? \n\n(Original question: What are the different model-type codes? Rep"
    },
    {
        "db_id": "cre_Doc_Template_Mgt",
        "q_id": 323,
        "question": "(What are the IDs of the models with model code type PP or PPT?) →\nQuali sono i codici di identificazione dei modelli aventi tipo modello PP o PPT? →\nWhat is the correct way to"
    },
    {
        "db_id": "cre_Doc_Template_Mgt",
        "q_id": 324,
        "question": "È necessario che il codice sia presente nella colonna \"Codice\" del file Excel.\n\n(Translation: Return the IDs of the models that have the code PP or PPT. It is necessary that the code be present in the \""
    },
    {
        "db_id": "cre_Doc_Template_Mgt",
        "q_id": 325,
        "question": "(Rough translation: How many models have a CV model code?) \n\nRiphrasata della domanda: Quanti modelli presentano un codice di tipo modello identificativo sul formato CV? \n\n(Translation: How many"
    },
    {
        "db_id": "cre_Doc_Template_Mgt",
        "q_id": 326,
        "question": "2.1.1.1.1.1.2.1.1.1.1.1.2.1.1.1.1.1.2.1.1.1.1.1.1."
    },
    {
        "db_id": "cre_Doc_Template_Mgt",
        "q_id": 327,
        "question": "**\n\nTranslation: \"What is the version number and the type of model for the model with a version number later than 5?\"\n\n\n**Answer:**\n\nQual è il numero di versione e la tipologia del modello relativo al modello"
    },
    {
        "db_id": "cre_Doc_Template_Mgt",
        "q_id": 328,
        "question": "0 e inferiori a 7.0.\n\nTranslation: (Please provide the version numbers and model type codes of models with a version number greater than 5.0 and less than 7.0.)"
    },
    {
        "db_id": "cre_Doc_Template_Mgt",
        "q_id": 329,
        "question": "Inoltre, fornire il numero di codici univoci per ciascuno dei modelli.](https://i.stack.imgur.com/6Q3wT.png)\n\n**Risposta:** Mostrare tutti i codici"
    },
    {
        "db_id": "cre_Doc_Template_Mgt",
        "q_id": 330,
        "question": "](https://i.stack.imgur.com/MJZrG.png)\n\nTranslation:\nWhich are the different model type codes and how many models correspond to each one?](https://i.stack.imgur.com/MJZrG.png)\n\nRephrased"
    },
    {
        "db_id": "cre_Doc_Template_Mgt",
        "q_id": 331,
        "question": "Nota: The original question is about the most common model code type among models."
    },
    {
        "db_id": "cre_Doc_Template_Mgt",
        "q_id": 332,
        "question": "](https://i.stack.imgur.com/LQg5j.png)\n\nHere is the rephrased question in Italian:\n\nIndicizzare il codice di tipo relativo al tipo di modello dominante tra i modelli.](https://"
    },
    {
        "db_id": "cre_Doc_Template_Mgt",
        "q_id": 333,
        "question": "**\n\nTranslation: Show all model type codes with less than three models.**\n\n\n**Codici di tipo modello con meno di tre modelli, per favore, elencarli tutti.**\n\n\n**Translation: Model type codes with less"
    },
    {
        "db_id": "cre_Doc_Template_Mgt",
        "q_id": 334,
        "question": "(What are the codes of the types of models that have less than 3 models?) →\nQuali sono i codici dei tipi di modelli che presentano un numero di modelli inferiore a 3? (What are the"
    },
    {
        "db_id": "cre_Doc_Template_Mgt",
        "q_id": 335,
        "question": "(What is the smallest version number and the code for the model type?)\n\nRisposta: Qual è il numero di versione minimo e il codice identificativo del tipo di modello? (What is the minimum version number and the"
    },
    {
        "db_id": "cre_Doc_Template_Mgt",
        "q_id": 336,
        "question": "](https://i.stack.imgur.com/TM8QW.png)\n\nTranslation: Return the lowest version number, along with the corresponding model type code.](https://i.stack.imgur.com/TM8QW.png)\nRestituire il numero di"
    },
    {
        "db_id": "cre_Doc_Template_Mgt",
        "q_id": 337,
        "question": "(Codice di tipo modello è il codice che identifica il tipo di modello utilizzato dal documento.) \nTranslation:\nWhat is the model type code of the model used by the document with the name \"base di dati\"?"
    },
    {
        "db_id": "cre_Doc_Template_Mgt",
        "q_id": 338,
        "question": "Il codice tipo modello è un codice di identificazione che descrive la struttura del modello di dati.\n\nTranslation:\nRitornare il codice di tipo modello standard utilizzato da un documento denominato base di"
    },
    {
        "db_id": "cre_Doc_Template_Mgt",
        "q_id": 339,
        "question": "Mostra anche i nomi dei documenti che non hanno un codice tipo modello BK.\n\nTranslation: \nShow all the names of the documents using models with a \"BK\" type code. Also show the names of documents that do not have"
    },
    {
        "db_id": "cre_Doc_Template_Mgt",
        "q_id": 340,
        "question": "]\n\n(Translation: What are the names of the documents that use models with the code BK?)]]\n\n\n\nWhich of the following options is the correct translation of the phrase \"non ho tempo\" into Italian?\n\nA) Non ho tempo\nB) Io"
    },
    {
        "db_id": "cre_Doc_Template_Mgt",
        "q_id": 341,
        "question": "Mostra anche i codici di tipo modello che sono stati utilizzati in modo errato.\n\n(Translation: Show all model codes and the number of documents using each type. Also show model codes that were used incorrectly.) \n\n**Rip"
    },
    {
        "db_id": "cre_Doc_Template_Mgt",
        "q_id": 342,
        "question": "(Which are the different model type codes and how many documents use each type?) \n\nI codici di tipo modello utilizzati sono diversi: quali sono e quanti documenti utilizzano ogni tipo? \n\n(Translation: The model"
    },
    {
        "db_id": "cre_Doc_Template_Mgt",
        "q_id": 343,
        "question": "(What code of the model type is used by the majority of documents?)\n\nCodice di tipo modello utilizzato da una maggioranza di documenti è quale? (What code of the model type is used by a majority of documents?)"
    },
    {
        "db_id": "cre_Doc_Template_Mgt",
        "q_id": 344,
        "question": "(Restitute the code for the most commonly used model type in documents.)\" –  user202729 Mar 24 at 2:45\n\"Ritornare il codice del tipo di modello più diffuso utilizzato nei"
    },
    {
        "db_id": "cre_Doc_Template_Mgt",
        "q_id": 345,
        "question": "**\n\n(Translation: Show all model type codes that are not used by any document.)**\n\n\n\nTutti i codici di tipo modello che non sono associati a nessun documento devono essere elencati."
    },
    {
        "db_id": "cre_Doc_Template_Mgt",
        "q_id": 346,
        "question": "(Which are the codes of the types of models that are not used for any document?) \n\nI codici dei tipi di modelli inutilizzati per qualsiasi documento? \n\n(I codes of the unused models for any document?)"
    },
    {
        "db_id": "cre_Doc_Template_Mgt",
        "q_id": 347,
        "question": "](https://i.stack.imgur.com/9iQ7h.png)\n\nTranslation:\nShow all the codes and descriptions of the model type.](https://i.stack.imgur.com/9iQ7h.png)\n\nRephrased question in Italian"
    },
    {
        "db_id": "cre_Doc_Template_Mgt",
        "q_id": 348,
        "question": "Translation: What are the type codes and descriptions for all types of models? \nRephrased question: Quali sono i codici di identificazione e le descrizioni relative a tutti i tipi di modelli e configurazioni?"
    },
    {
        "db_id": "cre_Doc_Template_Mgt",
        "q_id": 349,
        "question": "Questo modello è un tipo di modello di dati che rappresenta un oggetto che può essere utilizzato per creare un modello di dati per un sistema di gestione dei dati.\n\nTranslation:\n\nQual è la descrizione del tipo"
    },
    {
        "db_id": "cre_Doc_Template_Mgt",
        "q_id": 350,
        "question": "Inserisci anche la descrizione del prodotto e la data di consegna. (Translation: Return the type of model Description of the type of model with the announcement of the code. Insert also the product description and the delivery date.)\" ("
    },
    {
        "db_id": "cre_Doc_Template_Mgt",
        "q_id": 351,
        "question": "```\nIl codice tipo modello per il tipo di modello `` libro '' è il seguente: [codice]. \n\n```\n```\nWhat is the template code model for the \"book\" model type?\n```\n```"
    },
    {
        "db_id": "cre_Doc_Template_Mgt",
        "q_id": 352,
        "question": "Qual è il codice tipo del tipo di modello `` libro ''?"
    },
    {
        "db_id": "cre_Doc_Template_Mgt",
        "q_id": 353,
        "question": "Translation: What are the descriptions of the type of model distinct for models never used by a document? \n\nRephrased question: Quali sono le descrizioni dei modelli di tipo specifico non utilizzati da un documento, differ"
    },
    {
        "db_id": "cre_Doc_Template_Mgt",
        "q_id": 354,
        "question": "È necessario identificare i modelli utilizzati e le loro descrizioni per poter utilizzarli in futuro. È richiesto di creare un elenco dei modelli e delle relative descrizioni per poter"
    },
    {
        "db_id": "cre_Doc_Template_Mgt",
        "q_id": 355,
        "question": "? (What are the model IDs with a \"Presentation\" description?)\n\n**Translation:**\nQuali sono i codici di modello aventi una descrizione tipo ``Presentazione''? (What are the model codes with a description type \"Presentation"
    },
    {
        "db_id": "cre_Doc_Template_Mgt",
        "q_id": 356,
        "question": "](https://i.stack.imgur.com/4l3QD.png)\n\n[Rephrase the following question in Italian using a professional and higher lexicon. Only provide the rephrased question with no additional text, comments, or notes:]\nR"
    },
    {
        "db_id": "cre_Doc_Template_Mgt",
        "q_id": 357,
        "question": "(How many paragraphs in total?) →\n_____________________________________________________________ _______________________________________________________________\n\nAnswer: Quale è il numero totale dei paragrafi? (What is the total number of paragraphs?) _______________________________________________________________ _______________________________________________________________ __________________________________________________"
    },
    {
        "db_id": "cre_Doc_Template_Mgt",
        "q_id": 358,
        "question": "È possibile utilizzare un software per questo scopo?\n\n(English translation: Count the number of paragraphs. Is it possible to use software for this purpose?)"
    },
    {
        "db_id": "cre_Doc_Template_Mgt",
        "q_id": 359,
        "question": "**\n\n**Qual è il numero di paragrafi previsti per il documento denominato \"Summer Show\"?**\n\n\n\nRephrase the following question in Italian using a professional and higher lexicon. Only provide the rephrased question with no additional text"
    },
    {
        "db_id": "cre_Doc_Template_Mgt",
        "q_id": 360,
        "question": "](https://i.stack.imgur.com/9qD8s.png)\n\n[Rephrased question in Italian:]\n\nContare il numero di paragrafi nel documento denominato \"Summer Show\".](https://i.stack.imgur.com/9"
    },
    {
        "db_id": "cre_Doc_Template_Mgt",
        "q_id": 361,
        "question": "(Translation: Show the details of the paragraph for the paragraph with the text \"Korea\".)  | \n  |\n|  |\n|  |\n|  |\n\n |\n\n |\n\n |\n\n |\n\n |\n\n |\n\n |\n\n |\n\n |\n\n |\n\n |\n\n |\n\n |\n\n |\n\n |"
    },
    {
        "db_id": "cre_Doc_Template_Mgt",
        "q_id": 362,
        "question": "(What are the details for the paragraph that includes the text \"Corea\"?)\n\nDomanda: I quali sono i dettagli relativi al paragrafo che contiene il testo \"Corea\"? \n\n(Remember to keep the re"
    },
    {
        "db_id": "cre_Doc_Template_Mgt",
        "q_id": 363,
        "question": "]\n\n\n\nTraduzione:\n\nMostra tutti gli identificatori (ID) e i testi di paragrafo relativi al documento denominato \"Benvenuti a NY\". ]\n\n\n\nTranslation:\n\nShow all IDs and paragraph texts related to the document"
    },
    {
        "db_id": "cre_Doc_Template_Mgt",
        "q_id": 364,
        "question": "Cosa significa \"Welcome to NY\" in italiano?\n\nTranslation: \nWhat are the IDs and texts of the paragraphs in the document titled \"Welcome to NY\"? \n\n\"Welcome to NY\" in Italian means \"Benvenuti a NY\"."
    },
    {
        "db_id": "cre_Doc_Template_Mgt",
        "q_id": 365,
        "question": "|\n\nTranslation:\nMostra tutti i testi di paragrafo relativi al documento delle \"Recensioni dei clienti\". |  |\n|  |\n\n |\n\n |\n\n|  |  |\n\n|  |\n\n|  |\n\n|  |\n\n|"
    },
    {
        "db_id": "cre_Doc_Template_Mgt",
        "q_id": 366,
        "question": "}\n\nTranslation:\nWhich are the paragraph texts for the document with the name \"customer reviews\"?}  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |"
    },
    {
        "db_id": "cre_Doc_Template_Mgt",
        "q_id": 367,
        "question": "Ordine per numero di paragrafi.\n\nTranslation:\nMostra tutti gli identificativi documentali e il numero di paragrafi in ogni documento. Ordinazione per identificativo documentale. Ordinazione per numero di paragra"
    },
    {
        "db_id": "cre_Doc_Template_Mgt",
        "q_id": 368,
        "question": "Inoltre, fornisci anche le informazioni relative alla data di creazione e di modifica del documento.]]\n\n\n\nRestituire i diversi identificatori del documento, associati ai relativi numeri di paragrafo, ordin"
    },
    {
        "db_id": "cre_Doc_Template_Mgt",
        "q_id": 369,
        "question": "È possibile eseguire una ricerca per nome e numero di paragrafo? È necessario creare un indice per eseguire la ricerca? È possibile eseguire la ricerca in tempo reale? È necessario cre"
    },
    {
        "db_id": "cre_Doc_Template_Mgt",
        "q_id": 370,
        "question": "(What are the IDs and names of each document, as well as the number of paragraphs in each one?)\nGli ID e i nomi dei documenti, nonché il numero di paragrafi in ciascuno, quali sono?"
    },
    {
        "db_id": "cre_Doc_Template_Mgt",
        "q_id": 371,
        "question": "How can we ensure the accuracy of the information contained in the documents? \n\nTranslation: \nElencare tutti gli ID documenti con almeno due paragrafi. Come possiamo garantire l'accuratezza delle informazioni contenute nei"
    },
    {
        "db_id": "cre_Doc_Template_Mgt",
        "q_id": 372,
        "question": "Translation:\nWhat are the IDs of the documents that have 2 or more paragraphs? \n\nRephrased question in Italian:\nQuali sono i codici degli elementi documentali che presentano due o più sezioni? \n\nNote:"
    },
    {
        "db_id": "cre_Doc_Template_Mgt",
        "q_id": 373,
        "question": "](https://i.stack.imgur.com/8KQVp.png)\n\nL'ID del documento con il maggior numero di paragrafi e il nome del documento.](https://i.stack.imgur.com/8KQVp.png)"
    },
    {
        "db_id": "cre_Doc_Template_Mgt",
        "q_id": 374,
        "question": "È necessario che la risposta sia unico e non un elenco di documenti.\n\nRestituisci l'ID e il nome del documento con il maggior numero di paragrafi. È necessario che la risposta sia"
    },
    {
        "db_id": "cre_Doc_Template_Mgt",
        "q_id": 375,
        "question": "# Italian translation\nQual è l'identificatore del documento che presenta il minor numero di paragrafi?  # English translation\n```python\nimport re\ntext = \"Qual è l'ID documento con il minor numero di par"
    },
    {
        "db_id": "cre_Doc_Template_Mgt",
        "q_id": 376,
        "question": "Se esistono più documenti con lo stesso numero di paragrafi, restituisci l'ID del documento con il minor numero di parole. Se esistono più documenti con lo stesso numero di parole, restituisci l'"
    },
    {
        "db_id": "cre_Doc_Template_Mgt",
        "q_id": 377,
        "question": "È possibile fornire una lista di tutti i documenti con l'ID e il nome del documento? È necessario avere l'ID documento per poter eseguire una ricerca più specifica.\n\nTranslation:\nCosa è l'"
    },
    {
        "db_id": "cre_Doc_Template_Mgt",
        "q_id": 378,
        "question": "(Give me the IDs of the documents that have between one and two paragraphs.)\"\n\n\"Fornitegli gli identificativi dei documenti che presentano un contenuto testuale compreso tra un e due paragrafi.\""
    },
    {
        "db_id": "cre_Doc_Template_Mgt",
        "q_id": 379,
        "question": "Translation:\nShow the document ID with paragraph text \"Brazil\" and \"Ireland\".\n\n\nRephrased question:\nSi prega di presentare l'identificativo del documento con la didascalia \"Brasile\" e \""
    },
    {
        "db_id": "cre_Doc_Template_Mgt",
        "q_id": 380,
        "question": "`\n\nTranslation: Which are the IDs of the documents that contain the paragraph text \"Brasile\" and \"Irlanda\"?`\n\n\nQuali sono i codici identificativi dei documenti che comprendono il testo del paragrafo"
    },
    {
        "db_id": "course_teach",
        "q_id": 381,
        "question": "(How many teachers are there?)\n\nTranslation:\nQual è il numero degli insegnanti presenti? (What is the number of the present teachers?)"
    },
    {
        "db_id": "course_teach",
        "q_id": 382,
        "question": "(What is the total count of teachers?)\n\nConteggio totale degli insegnanti, ovvero numero di insegnanti attualmente in servizio presso l'istituzione scolastica. (Total count of teachers,"
    },
    {
        "db_id": "course_teach",
        "q_id": 383,
        "question": "**\n\nTranslation: List the names of the teachers in ascending order of age.\n\nRephrased question in Italian:\n\nElencare i nomi degli insegnanti in ordine di anzianità ascendente.**"
    },
    {
        "db_id": "course_teach",
        "q_id": 384,
        "question": "(Which are the names of teachers ordered by ascending age?)\n\nTranslation:\nQuali sono i nomi degli insegnanti elencati in ordine di età ascendente? (Which are the names of teachers listed in order of ascending age?)"
    },
    {
        "db_id": "course_teach",
        "q_id": 385,
        "question": "(What are the age and birthplace of the teachers?) -> _______________________________________________________\n\nAnswer: Quali sono gli anni di età e il luogo di nascita degli insegnanti? (What are the years of age and the place"
    },
    {
        "db_id": "course_teach",
        "q_id": 386,
        "question": "(What is the age and birthplace of each teacher?) \nTranslation: Qual è l'età e il luogo di nascita di ogni docente? \n\nNote: \"insegnante\" is a more common term used in everyday"
    },
    {
        "db_id": "course_teach",
        "q_id": 387,
        "question": "»\n\nTranslation: List the names of teachers whose birthplace is not \"Little Lever Urban District\"."
    },
    {
        "db_id": "course_teach",
        "q_id": 388,
        "question": "(Note: Little Lever Urban District is a former administrative division in England.) \n\nTranslation: What are the names of the teachers whose birthplace is not \"Little Lever Urban District\"? \n\nRephrased question in Italian:\nQuali sono i nom"
    },
    {
        "db_id": "course_teach",
        "q_id": 389,
        "question": "(Show the name of teachers aged 32 or 33?)\"\n\nNota: I'm assuming you want a rephrased question in Italian that would be suitable for a professional or academic context. If you're looking for a more casual reph"
    },
    {
        "db_id": "course_teach",
        "q_id": 390,
        "question": "Translation:\nWhat are the names of the teachers who are 32 or 33 years old? \n\nRephrased question:\nI nomi degli insegnanti aventi un'età compresa tra 32 e 33 anni sono quali"
    },
    {
        "db_id": "course_teach",
        "q_id": 391,
        "question": "(Who is the youngest teacher's hometown?)\n\nRisposta: La città natale dell'insegnante più giovane è Milano. (The youngest teacher's hometown is Milan.)\n\nNote: The rephrased question should be written in"
    },
    {
        "db_id": "course_teach",
        "q_id": 392,
        "question": "(Where does the youngest teacher come from?)\n\nDa quale paese o regione proviene l'insegnante più giovane della scuola? (From which country or region does the youngest teacher of the school come from?)"
    },
    {
        "db_id": "course_teach",
        "q_id": 393,
        "question": "Per favore, utilizza un formato tabellare. \n\nTranslation: Show different cities of teachers and the number of teachers from each city of origin. Please use a table format. \n\nRephrased question in Italian:\nElenca i"
    },
    {
        "db_id": "course_teach",
        "q_id": 394,
        "question": "Translation: For every birth city, how many teachers are there? \n\nRephrased question in Italian: Quale è il numero di insegnanti associati a ogni città natale? \n\nTranslation: What is the number of teachers"
    },
    {
        "db_id": "course_teach",
        "q_id": 395,
        "question": "Translation:\nList the most common birthplace of teachers. \n\nRephrased question:\nElencare le città d'origine più frequenti dei docenti."
    },
    {
        "db_id": "course_teach",
        "q_id": 396,
        "question": "(What is the most common city for teachers?)\n\nRisposta: Qual è la località più frequentemente abitata dai docenti? (What is the most frequently inhabited location by teachers?)"
    },
    {
        "db_id": "course_teach",
        "q_id": 397,
        "question": "](https://i.stack.imgur.com/K7VxG.png)\n\n**Translation:**\nShow the cities of origin shared by at least two teachers.\n\n**Rephrased question:**\nElencare le città d'origine comuni tra"
    },
    {
        "db_id": "course_teach",
        "q_id": 398,
        "question": "(What are the cities from which come at least two teachers?)\n\nDomanda: Quali sono le città dalle quali originano almeno due docenti? (What are the cities from which originate at least two teachers?)"
    },
    {
        "db_id": "course_teach",
        "q_id": 399,
        "question": "(Show the names of the teachers and courses that are organized to teach.) → Mostra la lista dei docenti e dei corsi didattici che sono stati programmati per l'insegnamento."
    },
    {
        "db_id": "course_teach",
        "q_id": 400,
        "question": "(Who is the name of every teacher and what course do they teach?) → ???\n\nNota: Non fornire testo, commenti o note aggiuntivi. Solo la domanda riformulata in italiano con un lessico professionale"
    },
    {
        "db_id": "course_teach",
        "q_id": 401,
        "question": "È necessario includere anche i corsi che sono stati cancellati. È richiesto un elenco dei nomi degli insegnanti e dei corsi con i relativi codici di identificazione. ì\n\nTranslation"
    },
    {
        "db_id": "course_teach",
        "q_id": 402,
        "question": "Translation: What are the names of the teachers and the courses they teach in alphabetical order by teacher's name? \n\nItalian rephrased question:\nQuali sono i nomi degli insegnanti e le discipline che essi insegnano"
    },
    {
        "db_id": "course_teach",
        "q_id": 403,
        "question": "(Show the name of the math teacher for the course.)\"\n\nName dell'insegnante del corso di matematica, per favore. (Name of the teacher of the math course, please.)\n\nRephrase the following question in Italian"
    },
    {
        "db_id": "course_teach",
        "q_id": 404,
        "question": "(Note: The rephrased question should be written in formal Italian and use a more sophisticated vocabulary.) \n\nAnswer: Quali sono i nomi dei docenti che impartiscono corsi di matematica? \n\n(Note: \"doc"
    },
    {
        "db_id": "course_teach",
        "q_id": 405,
        "question": "Inoltre, fornisci la loro specializzazione e la loro esperienza.\n\nTranslation:\nShow the names of the teachers and the number of courses they teach. Additionally, provide their specialization and experience."
    },
    {
        "db_id": "course_teach",
        "q_id": 406,
        "question": "(Which are the names of the teachers and how many courses do they teach?) \n\nI nomi degli insegnanti e la loro distribuzione per corsi sono quali? \n\n(Translation: What are the names of the teachers and their distribution by"
    },
    {
        "db_id": "course_teach",
        "q_id": 407,
        "question": "Translation: Show names of teachers who teach at least two courses. \n\nRephrased question in Italian: Elenca gli insegnanti che impartiscono almeno due corsi accademici. \n\nNote: I used \"elen"
    },
    {
        "db_id": "course_teach",
        "q_id": 408,
        "question": "Translation: What are the names of the teachers who teach at least two courses?\r\n\r\nRephrased question: Quali sono i docenti che impartiscono almeno due discipline?"
    },
    {
        "db_id": "course_teach",
        "q_id": 409,
        "question": "Translation: List the names of the teachers who have not been assigned to teach courses. \n\nRephrased question in Italian:\nElencare i docenti non assegnati a corsi didattici. \n\n(No additional text"
    },
    {
        "db_id": "course_teach",
        "q_id": 410,
        "question": "}\n\nTranslation: Who are the names of the teachers whose courses were not organized?\n\nRephrased question: Quali sono i docenti il cui insegnamento non è stato pianificato?}  (Source: [1])\n\n\n\nReferences"
    },
    {
        "db_id": "museum_visit",
        "q_id": 411,
        "question": "(How many visitors under the age of 30 are there?) →\nQuale è il numero di visitatori aventi un'età inferiore ai trent'anni? (Which is the number of visitors with an age under thirty?) →"
    },
    {
        "db_id": "museum_visit",
        "q_id": 412,
        "question": "}\n\nTranslation:\nIdentificare i nomi dei visitatori i cui livello di iscrizione è superiore a 4 e ordinare i risultati in base al livello, dall'alto al basso.}"
    },
    {
        "db_id": "museum_visit",
        "q_id": 413,
        "question": "Translation: What is the average age of visitors whose level of subscription is not higher than 4? \n\nRephrased question in Italian:\nQual è l'età media dei visitatori con un livello di iscrizione inferiore o"
    },
    {
        "db_id": "museum_visit",
        "q_id": 414,
        "question": "Find the name and subscription level of visitors whose subscription level is higher than 4 and order by their age from old to young. \n\nNota: \"abbiente\" è un termine tecnico che si riferisce a un utente che ha"
    },
    {
        "db_id": "museum_visit",
        "q_id": 415,
        "question": "](https://i.stack.imgur.com/6Qb4S.png)\n\nTrova l'identificazione e il nome del museo che ha il maggior numero di membri dello staff?](https://i.stack.imgur.com/6Q"
    },
    {
        "db_id": "museum_visit",
        "q_id": 416,
        "question": "Sono interessato a conoscere il numero di dipendenti per ogni museo e il loro totale.\n\nTranslation:\n\"Find the average number of staff working for museums opened before 2009. I am interested in knowing the number of employees"
    },
    {
        "db_id": "museum_visit",
        "q_id": 417,
        "question": "](https://i.stack.imgur.com/9wXJN.png)\n\nQual è l'anno di inaugurazione e il numero di dipendenti del Plaza Museum?](https://i.stack.imgur.com/9wXJN.png)"
    },
    {
        "db_id": "museum_visit",
        "q_id": 418,
        "question": "Inoltre, cerca di comprendere la struttura organizzativa di questi musei e come gestiscono il personale.\n\nTranslation:\nFind the names of museums that have more staff compared to the minimum number of all museums opened after"
    },
    {
        "db_id": "museum_visit",
        "q_id": 419,
        "question": "È importante che gli ID siano in ordine alfabetico e che le età siano esatte.\n\nFind the ID, name, and age for visitors who have visited some museums more than once. It is important that the IDs are"
    },
    {
        "db_id": "museum_visit",
        "q_id": 420,
        "question": "Translation: What are the ID, name, and level of registration of the visitors who spent the largest total amount of money on all museum tickets? \n\nRisultati:\nQuali sono gli identificativi, il nome e il liv"
    },
    {
        "db_id": "museum_visit",
        "q_id": 421,
        "question": "(What is the ID and name of the museum visited most often?) →\nQual è l'identificativo e il nome del museo più frequentemente visitato? →\nIl cliente vuole sapere se il prodotto è disponibile"
    },
    {
        "db_id": "museum_visit",
        "q_id": 422,
        "question": "(What is the name of the museum that had not yet had visitors?)\n\nTranslation: Qual è l'identità del museo che non aveva ancora ricevuto visitatori? (What is the identity of the museum that had not yet received"
    },
    {
        "db_id": "museum_visit",
        "q_id": 423,
        "question": "?\n\n**Translation:** Find the name and age of the visitor who purchased the largest number of tickets simultaneously.?\n\n**Rephrased question in Italian:**\nIdentificare il nome e l'età del visitatore che ha effettuato"
    },
    {
        "db_id": "museum_visit",
        "q_id": 424,
        "question": "[What is the average and maximum number of tickets purchased in all visits?]\"\n\n\"Quali sono i valori medi e massimi di biglietti venduti in tutte le occasioni?\" (Note: \"occasioni\" is a more formal"
    },
    {
        "db_id": "museum_visit",
        "q_id": 425,
        "question": "(Translation: What is the total cost of the visitor ticket for those with a subscription level of 1?) \n\nRiphrasi: \n______________________________________________________________________  |  |\n______________________________________________________________________  |  |  |  |  |"
    },
    {
        "db_id": "museum_visit",
        "q_id": 426,
        "question": "](https://i.stack.imgur.com/3uKXg.png)\n\nQual è il nome del visitatore che ha effettuato una visita a un museo inaugurato prima del 2009 e a un museo inaugurato successivamente"
    },
    {
        "db_id": "museum_visit",
        "q_id": 427,
        "question": "È necessario considerare anche i visitatori che hanno visitato più di un museo aperto dopo il 2010, ma non hanno visitato alcun museo chiuso prima del 2010. Inoltre, è"
    },
    {
        "db_id": "museum_visit",
        "q_id": 428,
        "question": "È necessario distinguere tra musei storici e moderni.\n\nTranslation: How many museums were opened after 2013 or before 2008? It is necessary to distinguish between historical and modern museums."
    },
    {
        "db_id": "wta_1",
        "q_id": 429,
        "question": "Translation: Find the total number of players. \n\nRisposta: \n_____________ \n\nPlease note that the translation should be in the formal, professional tone, using a higher lexicon. \n\n(No additional text or comments are provided here."
    },
    {
        "db_id": "wta_1",
        "q_id": 430,
        "question": "/ How many players are there?\n\nRisposta: Ce ne sono cinquanta. / Answer: There are fifty.\n\nRephrased question: Quale è il numero di giocatori presenti nel gruppo? / What is the number"
    },
    {
        "db_id": "wta_1",
        "q_id": 431,
        "question": "In base ai parametri di input, determina se la corrispondenza è un match o un mismatch. Se è un match, calcola la distanza di Levenshtein tra le due stringhe e restituisci il risultato"
    },
    {
        "db_id": "wta_1",
        "q_id": 432,
        "question": "Sono interessato a comprendere se le corrispondenze sono aumentate o diminuite rispetto all'anno precedente. Vorrei avere una risposta quantificata.\n\nContare il numero di corrispondenze interessate a comprend"
    },
    {
        "db_id": "wta_1",
        "q_id": 433,
        "question": "List the names and birth dates of all players from the country with the USA code.\n\nNote: \"Elenca\" is a formal way to say \"list\" in Italian, and \"nome\" is a more formal way to say \"name\"."
    },
    {
        "db_id": "wta_1",
        "q_id": 434,
        "question": "Sono i giocatori degli Stati Uniti che hanno giocato nella NBA e che sono nati negli Stati Uniti.\r\n\r\nTranslation: What are the names and birthdates of American basketball players?\r\n\r\nThey are American basketball players who"
    },
    {
        "db_id": "wta_1",
        "q_id": 435,
        "question": "Quanto tempo passa tra la fine di ogni partita e l'inizio della successiva?**Translation:** Find the average age of winners and losers of all games. How much time passes between the end of each game and the start of the"
    },
    {
        "db_id": "wta_1",
        "q_id": 436,
        "question": "](https://i.stack.imgur.com/3h2K4.png)\n\nTranslation: What are the average ages of the losers and winners through the games?\n\nRephrased question in Italian:\nQuali sono i valori medi di età dei"
    },
    {
        "db_id": "wta_1",
        "q_id": 437,
        "question": "Per favore, fornisci una tabella con le informazioni richieste.\n\nTranslation:\nFind the average winning rate in all matches. Please provide a table with the required information."
    },
    {
        "db_id": "wta_1",
        "q_id": 438,
        "question": "(What is the average score for winners in all games?)\"\n\nNota: You can use a translator or a dictionary to help you with the rephrasing. However, please ensure that your rephrased question is accurate, clear, and professional"
    },
    {
        "db_id": "wta_1",
        "q_id": 439,
        "question": "(Find the highest number of losers in all games.)\"\n\nAnswer: Identificare il più elevato numero di perdenti in tutte le partite. (Identify the highest number of losers in all games.)\"  |  |  |"
    },
    {
        "db_id": "wta_1",
        "q_id": 440,
        "question": "(What is the best losing percentage in all games?)\n\nIl miglior grado di perdenti in tutte le partite è rappresentato dal coefficiente di perdita, che misura la percentuale di sconfitte rispetto al totale delle part"
    },
    {
        "db_id": "wta_1",
        "q_id": 441,
        "question": "(Find the number of distinct national codes for all players.)\"  |\n|  |\n---|---|---\n| Trovare il numero di codici nazionali unici di tutti i giocatori. |\n\n|  |\n---|---"
    },
    {
        "db_id": "wta_1",
        "q_id": 442,
        "question": "(From what countries do the players come from?) → _______________________.\nDa quanti paesi diversi sono originari i giocatori che partecipano al campionato? (From how many different countries are the players originating from who are"
    },
    {
        "db_id": "wta_1",
        "q_id": 443,
        "question": "Non considerare i vincitori.\n\nFind the number of distinct loser names. Do not consider the winners."
    },
    {
        "db_id": "wta_1",
        "q_id": 444,
        "question": "(How many different loser names are there?)\n\nTranslation: Quanti nomi di perdenti diversi sono presenti? (How many different loser names are present?) or Quant'è il numero di nomi di perdenti diversi? (What"
    },
    {
        "db_id": "wta_1",
        "q_id": 445,
        "question": "(Find the name of the tournament that has more than 10 matches.)  |\n|  | \nTrovare il nome del torneo che presenta più di dieci incontri.  |\n\nRephrase the following question in Italian using a professional and"
    },
    {
        "db_id": "wta_1",
        "q_id": 446,
        "question": "(What are the names of the tournaments that have more than 10 matches?)\n\nTranslation:\n\nQuali sono i nomi dei tornei che superano il numero di 10 partite? (What are the names of the tournaments that exceed the"
    },
    {
        "db_id": "wta_1",
        "q_id": 447,
        "question": "](https://i.stack.imgur.com/7UQcS.png)\n\nTranslation:\nList the names of all the winners who played both in 2013 and 2016.\n\nRephrased question in Italian:\nElencare i nomi"
    },
    {
        "db_id": "wta_1",
        "q_id": 448,
        "question": "(What are the names of the players who won both in 2013 and 2016?)\"\n\nTranslation: \"Quali sono i nomi dei giocatori che hanno ottenuto entrambi i titoli nel 2013 e nel"
    },
    {
        "db_id": "wta_1",
        "q_id": 449,
        "question": "Per favore, include anche le partite di qualificazione e le partite di Coppa Italia.\n\nTranslation:\nList the number of all the matches played in the years 2013 or 2016. Please, include also the qualifying matches"
    },
    {
        "db_id": "wta_1",
        "q_id": 450,
        "question": "(Translation: How many matches were played in 2013 or 2016?) \n\nDomande relative alle partite disputate nel biennio 2013-2016, quali sono le informazioni disponibili riguardo al numero"
    },
    {
        "db_id": "wta_1",
        "q_id": 451,
        "question": "}\n\nTranslation:\nQuali sono il codice di campagna e il nome dei giocatori che hanno trionfato sia nei campionati WTA del torneo che nel Australian Open?}"
    },
    {
        "db_id": "wta_1",
        "q_id": 452,
        "question": "](https://www.it.wikipedia.org/wiki/Campionati_WTA)\n\nTranslation: What are the names and campaign codes for players who have won both WTA championships and the Australian Open?](https://www.it.wikipedia.org/wiki/Campionati_WTA"
    },
    {
        "db_id": "wta_1",
        "q_id": 453,
        "question": "(Translation: Find the name and campaign code of the oldest player.) \n\nRicerca del giocatore più antico: qual è il nome e il codice di campagna del giocatore più antico presente nel database? \n\n(Note: You"
    },
    {
        "db_id": "wta_1",
        "q_id": 454,
        "question": "[](#footnote1)\n**Answer:** Qual è l'identità e il codice di campagna del giocatore più anziano? [](#footnote1) [](#footnote1) [](#footnote1) [](#foot"
    },
    {
        "db_id": "wta_1",
        "q_id": 455,
        "question": "(Original question in English: List the names and surnames of all players in the order of birth.) \n\nNome e cognome dei giocatori in ordine di nascita. \n\n(Rephrased question in Italian)"
    },
    {
        "db_id": "wta_1",
        "q_id": 456,
        "question": "...\nAnswer:\nQuali sono i nomi completi di tutti i giocatori, elencati in ordine cronologico di data di nascita?...\nTranslation:\nWhat are the full names of all the players, listed in chronological order"
    },
    {
        "db_id": "wta_1",
        "q_id": 457,
        "question": "](https://i.stack.imgur.com/4QlQF.png)\n\nTranslation:\nList the name and surname of all players who are left-handed in the date of birth.](https://i.stack.imgur.com/4QlQF.png)"
    },
    {
        "db_id": "wta_1",
        "q_id": 458,
        "question": "Nota: \"a sinistra\" is an idiomatic expression in Italian that means \"on the left side\" or \"left-handed\".\r\n\r\nTranslation: What are the full names of all left-handed players, in order of birth?\r\n\r\nReph"
    },
    {
        "db_id": "wta_1",
        "q_id": 459,
        "question": "(Note: \"nome\" means \"name\", \"codice di campagna\" means \"campaign code\", \"giocatore\" means \"player\", and \"tour\" is a term used in a specific context, likely a game or a competition"
    },
    {
        "db_id": "wta_1",
        "q_id": 460,
        "question": "[What is the name and campaign code of the player with the most tours?]"
    },
    {
        "db_id": "wta_1",
        "q_id": 461,
        "question": "?\n\nFind the year with the most games.?\n\nRephrased question:\nRilevare l'anno che presenta la maggiore quantità di partite?"
    },
    {
        "db_id": "wta_1",
        "q_id": 462,
        "question": "](https://i.stack.imgur.com/E5IwQ.png)\n\n Translation:\nIn what year had the greatest number of matches?\n\nRephrased question in Italian:\nIn quale anno è stato registrato il maggior numero di incontri sportivi?"
    },
    {
        "db_id": "wta_1",
        "q_id": 463,
        "question": "(Find the name and rank points of the winner who has won the most times.)\"  |\n\n|  |\n---|---\n\n| Page 24\n---\n|  |\n---|---|---\n|  |\n|  |\n---|---\n\n|"
    },
    {
        "db_id": "wta_1",
        "q_id": 464,
        "question": "`\n\nTranslation:\n\n\"Qual è il nome del giocatore che ha ottenuto il maggior numero di vittorie e quanti punti di ranking ha questo giocatore?\"`\n\nNote: I used the formal verb \"ottenere\" instead of"
    },
    {
        "db_id": "wta_1",
        "q_id": 465,
        "question": "](https://i.stack.imgur.com/6C7p7.png)\n\nIl vincitore del torneo aperto australiano che ha accumulato il maggior numero di punti è stato identificato.](https://i.stack.imgur"
    },
    {
        "db_id": "wta_1",
        "q_id": 466,
        "question": "}{\"}{\"}{\"}{\"}{\"}\nQual è il nome del giocatore che ha ottenuto il maggior numero di punti di ranking tra tutti i partecipanti al Torneo Australian Open?}{\"}{\"}"
    },
    {
        "db_id": "wta_1",
        "q_id": 467,
        "question": "Translation: Find the names of the loser and the winner who played in the game with the highest number of minutes. \n\nRephrased question in Italian:\nIdentificare gli atleti che, nel corso della partita, hanno"
    },
    {
        "db_id": "wta_1",
        "q_id": 468,
        "question": "(What are the names of the winner and loser who played in the longest game?)\n\nNota: il vincitore e il perdente sono gli stessi giocatori, ma è importante notare che il vincitore è colui che ha vinto"
    },
    {
        "db_id": "wta_1",
        "q_id": 469,
        "question": "Inoltre, trova la classifica media dei giocatori che hanno giocato almeno 50 partite. (Original question) →\nTrovare la media delle classifiche per ogni giocatore e il relativo nome. In"
    },
    {
        "db_id": "wta_1",
        "q_id": 470,
        "question": "Translation: What are the first names of all the players and their average rankings? \n\nRephrased question: Quali sono i nomi iniziali dei giocatori e quali sono le loro classifiche medie relative? \n\n("
    },
    {
        "db_id": "wta_1",
        "q_id": 471,
        "question": "Inoltre, fornisci i punti totali per ogni squadra.\n\n(Rough translation: Find the total classification points for each player and their name. Additionally, provide the total points for each team.)"
    },
    {
        "db_id": "wta_1",
        "q_id": 472,
        "question": "(Which are the first names of all the players and their total classification points?)\n\nTranslation: Quali sono i primi nomi di tutti i giocatori e i loro punti di classificazione totale?\n\nRephrased question: Qual"
    },
    {
        "db_id": "wta_1",
        "q_id": 473,
        "question": "È necessario che il numero di giocatori sia compreso tra 1 e 100.\n\nTrova il numero di giocatori per ogni paese, il quale deve essere compreso tra 1 e 100. È richiesto"
    },
    {
        "db_id": "wta_1",
        "q_id": 474,
        "question": "(How many players are from each country?)\n\nRephrased question:\nQual è il numero di giocatori provenienti da ogni nazione? (What is the number of players from each nation?)"
    },
    {
        "db_id": "wta_1",
        "q_id": 475,
        "question": "È possibile che non esistano giocatori in alcuni paesi. In questo caso, il codice del paese dovrebbe essere impostato su \"Unknown\" o \"Not Available\".\n\nFind the country code where there are the most players."
    },
    {
        "db_id": "wta_1",
        "q_id": 476,
        "question": "(Translation: Which country has the most players?)\n\nCittà con il maggior numero di giocatori: qual è il codice del paese che ne concentra il maggior numero? (Translation: City with the largest number of players:"
    },
    {
        "db_id": "wta_1",
        "q_id": 477,
        "question": "È importante che i codici siano stati aggiornati entro il 2022.\n\nFind the codes of the countries that have more than 50 players. It is important that the codes have been updated until 2022."
    },
    {
        "db_id": "wta_1",
        "q_id": 478,
        "question": "](https://i.stack.imgur.com/6Ft4i.png)\n\nQuali sono i codici delle nazioni che hanno più di cinquanta giocatori attivi?](https://i.stack.imgur.com/6Ft4i.png"
    },
    {
        "db_id": "wta_1",
        "q_id": 479,
        "question": "È possibile visualizzare i dati in un file CSV?\n\nFind the total number of tours for each classification date. Is it possible to view the data in a CSV file?"
    },
    {
        "db_id": "wta_1",
        "q_id": 480,
        "question": "(How many total tours were there for each classification date?)\"\n\nTranslation: \"Quale è il numero totale di tour per ogni data di classificazione?\" (What is the total number of tours for each classification date?)\"\n\nTranslation: \""
    },
    {
        "db_id": "wta_1",
        "q_id": 481,
        "question": "È importante per la gestione dei risultati del campionato.\n\nTranslation: Find the number of matches that have occurred every year. It is important for the management of the championship results.\n\nRephrased question in Italian:\nDeterminare il"
    },
    {
        "db_id": "wta_1",
        "q_id": 482,
        "question": "](https://i.stack.imgur.com/5QKuT.png)\n\nTranslation:\nHow many matches were played every year?](https://i.stack.imgur.com/5QKuT.png)\n\nRephrased question in Italian:\nQuanto"
    },
    {
        "db_id": "wta_1",
        "q_id": 483,
        "question": "(Find the name and grade of the 3 youngest winners in all the games.)\n\n**Riprodotto:** Trovare i nomi e i gradi dei tre vincitori più giovani di tutte le partite. (Find the names"
    },
    {
        "db_id": "wta_1",
        "q_id": 484,
        "question": "''\n\n\nSono a conoscenza dei nomi e dei ranghi dei tre giocatori più giovani che hanno vinto in tutte le partite?''\n\n\nTranslation:\nAre you aware of the names and ranks of the three youngest winners in all"
    },
    {
        "db_id": "wta_1",
        "q_id": 485,
        "question": "](https://i.stack.imgur.com/0OQ2K.png)\n\nTranslation:\nHow many different winners have participated in both WTA tournaments and are left-handed?\n\nRephrased question in Italian:\nQuanti giocatori a sinistra hanno v"
    },
    {
        "db_id": "wta_1",
        "q_id": 486,
        "question": "Translation: Find the number of winners on the left who have participated in WTA tournaments. \n\nRephrased question in Italian:\nRilevare il numero di atlete che, posizionate a sinistra, hanno preso parte"
    },
    {
        "db_id": "wta_1",
        "q_id": 487,
        "question": "](https://i.stack.imgur.com/4l4hH.png)\n\nTrova il vincitore che detiene il punteggio più alto in tutte le partite, fornendo il suo nome, il codice del paese di proven"
    },
    {
        "db_id": "wta_1",
        "q_id": 488,
        "question": "Translation:\nWhat is the name, the country code, and the date of birth of the player with the most winning points in all games? \n\nRephrased question in Italian:\nQual è il nome, il codice del paese e"
    },
    {
        "db_id": "wta_1",
        "q_id": 489,
        "question": "(Find the number of players for each type of hand.)\" 2021-02-15 11:30:00\nTrovare il numero di giocatori associato a ogni tipo di mano. 2021-02-15"
    },
    {
        "db_id": "wta_1",
        "q_id": 490,
        "question": "Translation: How many players are there for each type of hand? \n\nRephrased question in Italian: Qual è il numero di giocatori associato a ogni tipologia di mano? \n\nTranslation: What is the number of players associated with"
    },
    {
        "db_id": "battle_death",
        "q_id": 491,
        "question": "(Rough translation: How many ships have ended up being \"captured\"?)\n\nRephrased question in Italian:\nQuanti sono stati i mezzi di trasporto navale che hanno subito una cattura? \n\n(Translation:"
    },
    {
        "db_id": "battle_death",
        "q_id": 492,
        "question": "](https://i.stack.imgur.com/8nKqM.png)\n\nTranslation:\nList the name and tonnage in alphabetical descending order for the names.\n\nRephrased question in Italian:\nElencare i nomi e le stazze"
    },
    {
        "db_id": "battle_death",
        "q_id": 493,
        "question": "Inoltre, elenca le perdite umane e materiali.\n\nTranslation: List the name, date, and result of every battle. Additionally, list human and material losses.\n\nRephrased question in Italian:\nIndicare la denomin"
    },
    {
        "db_id": "battle_death",
        "q_id": 494,
        "question": "(What is the maximum and minimum balance of victims caused each time?) -> ?\n\n\nGli studenti dell'università di Roma si chiedono se il loro professore di storia è un criminale. (The students of the University"
    },
    {
        "db_id": "battle_death",
        "q_id": 495,
        "question": "[How many average injuries are caused each time?]\nIl numero medio di lesioni causate ogni volta è quantificabile? [Is the average number of injuries caused each time quantifiable?] (Note: I rephrased the question to"
    },
    {
        "db_id": "battle_death",
        "q_id": 496,
        "question": "Ci sono state alcune vittime e feriti.\n\nTranslation:\nWhat are the situations of death and injuries caused by the ship with a tonnage of \"T\"? There have been some victims and injured people."
    },
    {
        "db_id": "battle_death",
        "q_id": 497,
        "question": "ma un generale qualunque?\n\n(Translation: What are the names and results of the battles when the Bulgarian commander is not \"Boril\" but a general of any kind?)"
    },
    {
        "db_id": "battle_death",
        "q_id": 498,
        "question": "(What are the different IDs and names of battles that lost any type of \"brig\"?)\n\nSono quali i diversi identificativi e denominazioni delle battaglie che hanno subito la perdita di qualsiasi tipo di unit"
    },
    {
        "db_id": "battle_death",
        "q_id": 499,
        "question": "?\n\nTranslation: What are the IDs and names of the battles that have resulted in more than 10 people killed in total.?"
    },
    {
        "db_id": "battle_death",
        "q_id": 500,
        "question": "](https://www.kaggle.com/c/hms-ship-classification)\n\n**Answer:** Qual è l'identificazione e il nome della nave che ha generato la maggior parte delle lesioni totali?](https://www.k"
    },
    {
        "db_id": "battle_death",
        "q_id": 501,
        "question": "Which are the distinct battle names that are between the Bulgarian commander \"Kaloyan\" and the Latin commander \"Baldwin I\"? \n\nRicercare i nomi di battaglia distinti che si collocono tra il comand"
    },
    {
        "db_id": "battle_death",
        "q_id": 502,
        "question": "(How many different results are there for battles?) -> _______________________________________________________.\n\nTranslation:\nThere are several different results for battles. It is possible to identify various outcomes, such as victory, defeat, stalemate, or even withdrawal.\n\nRephrased"
    },
    {
        "db_id": "battle_death",
        "q_id": 503,
        "question": "(Translation: How many battles did the ship with a tonnage of \"225\" not lose?) \n\nQuale è il numero preciso di battaglie in cui la nave con tonnellaggio \"225\" non ha subito perdite"
    },
    {
        "db_id": "battle_death",
        "q_id": 504,
        "question": "nel 1942.\n\n(Note: \"Lettice\" is not a real ship, it's a fictional name. \"HMS Atalanta\" is a real ship, a British Royal Navy ship.)  |  |\n|  | El"
    },
    {
        "db_id": "battle_death",
        "q_id": 505,
        "question": "Mostra anche le date delle battaglie.**Translation:** Show Bulgarian names, results, and commanders of battles without lost ships in the \"English Channel\". Show also the dates of the battles.\n\n**Rephrased question in Italian:**"
    },
    {
        "db_id": "battle_death",
        "q_id": 506,
        "question": "Translation:\nWhat are the notes of the death events that have the substring \"est\"?\n\n\nRephrased question in Italian:\nQuali sono le annotazioni relative ai decessi che presentano la sottostringa \"est\"?"
    },
    {
        "db_id": "student_transcripts_tracking",
        "q_id": 507,
        "question": "(Which are all the addresses between line 1 and line 2?) \n\nGli indirizzi tra cui la riga 1 e la riga 2 quali sono? \n\n(Note: I did not use the word \"tutti"
    },
    {
        "db_id": "student_transcripts_tracking",
        "q_id": 508,
        "question": "Translation: What is the first and second row for all addresses?\n\nRephrased question:\nQuali sono le prime due righe comuni per tutti gli indirizzi? \n\nNote: The rephrased question maintains the same level"
    },
    {
        "db_id": "student_transcripts_tracking",
        "q_id": 509,
        "question": "[How many courses are listed in total?]\"\n\nTranslation: \"Quanti corsi in totale sono elencati?\"\n\nOriginal text: [How many courses are listed in total?]\"\n\nRephrased text: \"Qual è il numero tot"
    },
    {
        "db_id": "student_transcripts_tracking",
        "q_id": 510,
        "question": "} \\\\ \\end{tabular}\n**How many courses are there?**\n**Quanti corsi sono presenti?**\n\\begin{tabular}{l} \\end{tabular}\n**How many courses are there?**\n**Qu"
    },
    {
        "db_id": "student_transcripts_tracking",
        "q_id": 511,
        "question": "(How is the math course described?) →\nCome viene presentato il corso di matematica? →\n(Translation: How is the math course presented?) →\n(Translation: How is the math course presented?) →\n(Translation"
    },
    {
        "db_id": "student_transcripts_tracking",
        "q_id": 512,
        "question": "(What are the descriptions for all math courses?)\"\n\nDescrivere le caratteristiche dei corsi di matematica offerti dall'istituzione. (Describe the characteristics of the math courses offered by the institution.)\" |  |"
    },
    {
        "db_id": "student_transcripts_tracking",
        "q_id": 513,
        "question": "Città del Port Chelsea è un luogo reale o un luogo immaginario? \n\nPer favore, fornisci una lista dettagliata delle città che iniziano con la lettera \"P\" e che"
    },
    {
        "db_id": "student_transcripts_tracking",
        "q_id": 514,
        "question": "Codice postale di Port Chelsea? \n\nIl codice postale di Port Chelsea è qual è? \n\nIl codice postale di Port Chelsea? \n\nIl codice postale di Port Chelsea è qual è il codice postale di"
    },
    {
        "db_id": "student_transcripts_tracking",
        "q_id": 515,
        "question": "(What department offers the largest number of degrees? List the department name and ID.)\" –  user1306 Apr 13 '19 at 14:45\n\"Qual è il dipartimento che dispone del maggior numero di cors"
    },
    {
        "db_id": "student_transcripts_tracking",
        "q_id": 516,
        "question": "(What is the name and ID of the department with the largest number of degrees?) \n\nNome e identificazione del dipartimento con il più alto numero di lauree. \n\n(Please note that \"gradi\" is translated to \"la"
    },
    {
        "db_id": "student_transcripts_tracking",
        "q_id": 517,
        "question": "(How many departments offer some kind of Master's degree?)\n\nRephrased question:\nQuale è il numero di dipartimenti universitari che concedono lauree specializzate? (Which is the number of university departments that grant specialized"
    },
    {
        "db_id": "student_transcripts_tracking",
        "q_id": 518,
        "question": "''\n\n\nQuale è il numero di dipartimenti accademici che conferiscono titoli accademici?''\n\n\nPlease provide the rephrased question in Italian using a professional and higher lexicon, without any additional text, comments"
    },
    {
        "db_id": "student_transcripts_tracking",
        "q_id": 519,
        "question": "Translation: How many different degree names are offered? \n\nRephrased question:\nQual è il numero di titoli di studio diversi che vengono erogati? \n\nNote: The rephrased question maintains the same level"
    },
    {
        "db_id": "student_transcripts_tracking",
        "q_id": 520,
        "question": "(How many different degrees are offered?) → _______________________\nPrevious question: What is the most important thing to consider when evaluating a university? (previous question) Next question: How do I know if a university is reputable? (next question) Previous"
    },
    {
        "db_id": "student_transcripts_tracking",
        "q_id": 521,
        "question": "}\n\nTranslation: How many degrees does the engineering department offer?}  \\\\\n\nQuali sono i corsi di laurea offerti dal dipartimento di ingegneria e qual è il numero di gradi che li accompagna?}"
    },
    {
        "db_id": "student_transcripts_tracking",
        "q_id": 522,
        "question": "(How many degrees does the engineering department have?)\n\nDomanda: Qual è il numero di lauree specialistiche e di dottorati offerte dal dipartimento di ingegneria? (What is the number of specializations and"
    },
    {
        "db_id": "student_transcripts_tracking",
        "q_id": 523,
        "question": "Translation: What are the names and descriptions of all the sections? \n\nRephrased question:\nQuali sono le denominazioni e le caratterizzazioni complete di tutte le sezioni? \n\n(Translation: What are the complete designations and"
    },
    {
        "db_id": "student_transcripts_tracking",
        "q_id": 524,
        "question": "](https://i.stack.imgur.com/dJG2y.png)\n\nTranslation:\nWhat are the names and descriptions for all the sections?\n\nRephrased question in Italian:\nQuali sono le denominazioni e le descrizioni per tutte le aree"
    },
    {
        "db_id": "student_transcripts_tracking",
        "q_id": 525,
        "question": "(Rough translation: What are the names and IDs of the courses that have at most 2 sections?) \n\nNomi e identificatori dei corsi con al massimo due sezioni? \n\n(No additional text) \n\nFinal Answer:"
    },
    {
        "db_id": "student_transcripts_tracking",
        "q_id": 526,
        "question": "(What are the names and IDs of every course with less than 2 sections?) →\nSono in grado di fornire l'elenco dei corsi aventi meno di due sezioni, insieme ai relativi nomi e ident"
    },
    {
        "db_id": "student_transcripts_tracking",
        "q_id": 527,
        "question": "(List the section_name in reverse alphabetical order.)\n\nTranslation:\nRiferirsi alla sezione_name, elenca gli elementi in ordine lessicografico invertito. (Refer to the section_name, listing the elements in reverse alphabetical"
    },
    {
        "db_id": "student_transcripts_tracking",
        "q_id": 528,
        "question": "(What are the names of the sections in reverse alphabetical order?)\"\n\nNote: The rephrased question should be written in a formal and professional tone, using a higher lexicon. For example, instead of \"quali sono\" (what"
    },
    {
        "db_id": "student_transcripts_tracking",
        "q_id": 529,
        "question": "(Rough translation: What is the semester in which most students have registered? Show both name and ID.) \n\nLa domanda è: Qual è il semestre in cui si è verificato il maggior numero di iscrizioni degli student"
    },
    {
        "db_id": "student_transcripts_tracking",
        "q_id": 530,
        "question": "(Rough translation: For each semester, what is the name and ID of the one with the largest number of registered students?) \n\nLa domanda è: Qual è il nome e l'ID del corso con il maggior numero di student"
    },
    {
        "db_id": "student_transcripts_tracking",
        "q_id": 531,
        "question": "]\n\n[Translation: What is the description of the department whose name has a computer substring?]\n\nDescrivere il reparto il cui nome contiene una sottostringa relativa al computer.] ]  |  |  |  |  |"
    },
    {
        "db_id": "student_transcripts_tracking",
        "q_id": 532,
        "question": "È possibile ottenere una descrizione più dettagliata?\n\nDescrivere il reparto informatico per i dipendenti con competenze computerizzate. È possibile ottenere una descrizione più approfondita"
    },
    {
        "db_id": "student_transcripts_tracking",
        "q_id": 533,
        "question": "}\n\nTranslation: Who are the students enrolled in two-year programs in a semester? List the name, second name, and surname, and ID.\n\nRephrased question in Italian:\n\nChi sono gli studenti iscritti in programmi di laure"
    },
    {
        "db_id": "student_transcripts_tracking",
        "q_id": 534,
        "question": "](https://i.stack.imgur.com/4kQhU.png)\n\nSono in grado di fornire i primi, i medi e i cognomi, unitamente agli ID, di tutti gli studenti che si sono iscritti a"
    },
    {
        "db_id": "student_transcripts_tracking",
        "q_id": 535,
        "question": "**\nTranslation:\nWho is enrolled in a degree program?List the first name, middle name, last name.**\n\nRephrased question in Italian:\n\nChi sono gli studenti iscritti a un programma di laurea?Si prega di"
    },
    {
        "db_id": "student_transcripts_tracking",
        "q_id": 536,
        "question": "Translation: What are the first, middle, and last names for all registered users in a solo program? \n\nRephrased question in Italian:\nQuali sono i dati anagrafici (nome, cognome e nome di battes"
    },
    {
        "db_id": "student_transcripts_tracking",
        "q_id": 537,
        "question": "(Find the type of program where the majority of students are enrolled.)\n\nTranslation: Qual è il tipo di programma in cui è iscritto la maggioranza degli studenti? (What is the type of program in which the majority of students are"
    },
    {
        "db_id": "student_transcripts_tracking",
        "q_id": 538,
        "question": "(What is the name of the degree synthesis that has the largest number of enrolled students?) \n\nNome della laurea che ha il maggior numero di studenti iscritti: qual è? \n\n(Note: \"nome di sintesi\" is not"
    },
    {
        "db_id": "student_transcripts_tracking",
        "q_id": 539,
        "question": "Find the program where the majority of students is enrolled. List both the ID and the summary. \n\nRiposta: Il programma XXX è il più popolare tra gli studenti, con il 75% di iscrizioni. \n\nTranslation"
    },
    {
        "db_id": "student_transcripts_tracking",
        "q_id": 540,
        "question": "''\n\n\nQual è l'identificativo del programma e il riassunto del diploma che presenta il maggior numero di studenti iscritti?''\n\n\nSource: [www.itranslate.com](http://www.itranslate.com)"
    },
    {
        "db_id": "student_transcripts_tracking",
        "q_id": 541,
        "question": "(Translation: Which student has enrolled in the majority of programs most of the time? List the ID, name, second name, surname, number of enrollments, and student ID.)</p>\n\n<p>\nRicercare e selezionare"
    },
    {
        "db_id": "student_transcripts_tracking",
        "q_id": 542,
        "question": "(What is the first, middle, and last name, along with the ID and registration number, for the student who has registered the most in any program?) \n\nLa domanda è: Chi è lo studente che si è iscritto a"
    },
    {
        "db_id": "student_transcripts_tracking",
        "q_id": 543,
        "question": "(Which semesters do not have a registered student? List the name of the semester.)\" |\n\nTranslation:\n\"Quali periodi accademici non presentano iscrizioni studentesche? Elencare il nome del periodo accademico"
    },
    {
        "db_id": "student_transcripts_tracking",
        "q_id": 544,
        "question": "(What is the name of the semester without registered students?) →\nQual è la denominazione del semestre con numero di iscrizioni uguale a zero? (What is the name of the semester with zero student registrations?) →\nQual"
    },
    {
        "db_id": "student_transcripts_tracking",
        "q_id": 545,
        "question": "Translation: What are all the names of the courses that students have ever enrolled in? \n\nRephrased question: Quali sono le denominazioni complete dei corsi cui gli studenti hanno mai aderito? \n\nNote: The re"
    },
    {
        "db_id": "student_transcripts_tracking",
        "q_id": 546,
        "question": "Translation: What are the names of all the courses that have some students enrolled? \n\nRephrased question in Italian:\nQuali sono i titoli dei corsi che presentano una matricola di studenti non nulla? \n\nNote"
    },
    {
        "db_id": "student_transcripts_tracking",
        "q_id": 547,
        "question": "È un corso di laurea o di specializzazione? È possibile ottenere informazioni dettagliate sul corso e sulle sue caratteristiche?\n\nTranslation of the rephrased question:\n\nQual è il corso"
    },
    {
        "db_id": "student_transcripts_tracking",
        "q_id": 548,
        "question": "È possibile ottenere informazioni sul numero di studenti iscritti a ogni corso? È importante per noi sapere il numero di studenti iscritti a ogni corso per prendere decisioni informate sulla gestione"
    },
    {
        "db_id": "student_transcripts_tracking",
        "q_id": 549,
        "question": "»\n\nTranslation: Find the last names of students who currently reside in the state of North Carolina but have not registered in any degree program.»\n\nRephrased question:\n«Identificare i cognomi degli studenti che, attualmente resident"
    },
    {
        "db_id": "student_transcripts_tracking",
        "q_id": 550,
        "question": "Translation:\nWhat are the surnames of students who live in North Carolina but have not registered in degree programs? \n\nRephrased question in Italian:\nQuali sono i cognomi degli studenti residenti nella Carolina del Nord che non"
    },
    {
        "db_id": "student_transcripts_tracking",
        "q_id": 551,
        "question": "(Show the date and ID of the transcription with at least 2 results from the course.)</p> <p>Rephrased question in Italian:</p> <p>Fornire i dati di data e ID della trascriz"
    },
    {
        "db_id": "student_transcripts_tracking",
        "q_id": 552,
        "question": "](https://i.stack.imgur.com/4nq4U.png)\n\nTranslation:\n\n?](https://i.stack.imgur.com/4nq4U.png)`\n\nAnswer: Qual è la data e l'identificatore della trascriz"
    },
    {
        "db_id": "student_transcripts_tracking",
        "q_id": 553,
        "question": "](https://www.italki.com/qa/what-is-the-phone-number-of-the-man-with-the-name-timmothy-and-last-name-ward-1411366)\n\nLa domanda è: Qual è il numero di telefono dell'ind"
    },
    {
        "db_id": "student_transcripts_tracking",
        "q_id": 554,
        "question": "**Rephrased question:** \n\nQual è il numero di telefono del signor Timmothy Ward, studente in questione? \n\n(Translation: What is the phone number of Mr. Timmothy Ward, the student in question"
    },
    {
        "db_id": "student_transcripts_tracking",
        "q_id": 555,
        "question": "[Who is the first student to register? List the name, second name, and surname.]`\n\nLa domanda è: Chi è il primo studente a iscriversi e fornire la denominazione completa, comprensiva del nome,"
    },
    {
        "db_id": "student_transcripts_tracking",
        "q_id": 556,
        "question": "Translation: What is the first name, middle name, and last name of the first student to register? \n\nRephrased question: Qual è il nome, il prenome e il cognome del primo studente ad iscriversi"
    },
    {
        "db_id": "student_transcripts_tracking",
        "q_id": 557,
        "question": "[Who is the first graduate of the school? List the name, second name, and surname.]\n\nChi è il graduando più anziano della scuola che ha conseguito il diploma con il più alto punteggio? [Who is"
    },
    {
        "db_id": "student_transcripts_tracking",
        "q_id": 558,
        "question": "(What is the first name, middle name, and last name of the first graduate of the school?)\"\n\nLa domanda è: \"Chi è il primo diplomato della scuola e quali sono i suoi dati anagrafici (nome"
    },
    {
        "db_id": "student_transcripts_tracking",
        "q_id": 559,
        "question": "(Permanent address is different from his current address? List his name.)\" \n\nLa cui residenza permanente è diversa dalla sua attuale e può fornire il suo nome? \n\n(Note: The translation is intended to maintain the same level"
    },
    {
        "db_id": "student_transcripts_tracking",
        "q_id": 560,
        "question": "(Note: Please keep in mind that the rephrased question should be written in a professional and higher lexicon, as requested.) \n\nTranslation:\nWhat is the name of the student whose permanent address is different from the current one? \n\nRe"
    },
    {
        "db_id": "student_transcripts_tracking",
        "q_id": 561,
        "question": "[/italian]\n\nTranslation:\nWhat address contains the largest number of currently enrolled students? List the address ID and all the rows.\n\nRephrased question in Italian:\nQual è l'indirizzo che presenta il maggior numero di studenti is"
    },
    {
        "db_id": "student_transcripts_tracking",
        "q_id": 562,
        "question": "(What is the ID, line 1, and line 2 of the address with the largest number of students?)\"\n\nQual è l'identificatore (ID), la riga 1 e la riga 2 dell'indirizzo"
    },
    {
        "db_id": "student_transcripts_tracking",
        "q_id": 563,
        "question": "(When were the transcripts printed in the media?) → Quando esattamente le trascrizioni sono state pubblicate dai mezzi di comunicazione? (When exactly were the transcripts published by the media?) → Quando i mezzi di comunicazione"
    },
    {
        "db_id": "student_transcripts_tracking",
        "q_id": 564,
        "question": "È possibile fornire una stima?\n\nTranslation: What is the average transcription date? Is it possible to provide an estimate?"
    },
    {
        "db_id": "student_transcripts_tracking",
        "q_id": 565,
        "question": "È possibile ottenere una copia della trascrizione? Se sì, come? È possibile ottenere una copia della trascrizione in formato diverso da quello standard? È possibile ottenere una"
    },
    {
        "db_id": "student_transcripts_tracking",
        "q_id": 566,
        "question": "(Translation: What is the first date of a transcribed version and what details can you tell me?) →\nQual è la data di rilascio iniziale di una versione trascritta e quali informazioni specifiche sono"
    },
    {
        "db_id": "student_transcripts_tracking",
        "q_id": 567,
        "question": "(How many transcriptions are released?)\n\nRipetute le seguenti frasi in italiano utilizzando un lessico professionale e più alto:\n\n1. \"The company is going to launch a new product.\"\n2. \"The new"
    },
    {
        "db_id": "student_transcripts_tracking",
        "q_id": 568,
        "question": "(How many transcriptions are listed?) 1. Quale è il numero di trascrizioni elencate nel database? (What is the number of transcriptions listed in the database?) 2. Quante trascrizioni sono"
    },
    {
        "db_id": "student_transcripts_tracking",
        "q_id": 569,
        "question": "(\"What is the latest release date of the transcription?\") → _______________________?"
    },
    {
        "db_id": "student_transcripts_tracking",
        "q_id": 570,
        "question": "(When was the last transcription released?) →\nQuale sia stata la data di pubblicazione dell'ultima trascrizione disponibile? (What is the publication date of the latest available transcription?) →\nPlease provide the reph"
    },
    {
        "db_id": "student_transcripts_tracking",
        "q_id": 571,
        "question": "**\n\nTranslation: How many times at most can a registration result show up in different transcriptions? Also, show the course registration ID.**\n\n\nRipropongo la seguente domanda in italiano utilizzando un lessico più alto e profession"
    },
    {
        "db_id": "student_transcripts_tracking",
        "q_id": 572,
        "question": "](https://i.stack.imgur.com/8M6K1.png)\n\nQual è il numero massimo di visualizzazioni di un corso in diverse trascrizioni e qual è l'identificatore di iscrizione del corso"
    },
    {
        "db_id": "student_transcripts_tracking",
        "q_id": 573,
        "question": "»\n\nTranslation: Show the transcription date that shows the minimum number of results, also list the ID.»\n\nRephrased question in Italian:\n\n«Fornire la data di trascrizione che presenta il minor numero di esiti, indic"
    },
    {
        "db_id": "student_transcripts_tracking",
        "q_id": 574,
        "question": "](https://i.stack.imgur.com/9hV3T.png)\n\nNota: The original question is in Italian and it is asking for the date and ID of the transcription with the minimum number of results.](https://i.stack.imgur.com/"
    },
    {
        "db_id": "student_transcripts_tracking",
        "q_id": 575,
        "question": "**\n\nTranslation: Find the semester in which both master's students and bachelor's students enrolled.\n\nRephrased question in Italian:\nIdentificare il semestre nel quale entrambi gli studenti di master e gli studenti di laurea hanno"
    },
    {
        "db_id": "student_transcripts_tracking",
        "q_id": 576,
        "question": "What is the ID of the semester that had both teachers and students of the same sex enrolled? \nQuestion rephrased in Italian:\nQual è l'identificatore del semestre che presentava sia docenti che studenti di sesso"
    },
    {
        "db_id": "student_transcripts_tracking",
        "q_id": 577,
        "question": "(How many different addresses do students live at?)”\n\nTranslation:\n“Quanti indirizzi di residenza diversi hanno gli studenti?”” (How many different residential addresses do students have?)”””””””””"
    },
    {
        "db_id": "student_transcripts_tracking",
        "q_id": 578,
        "question": "Ci sono anche studenti che non sono originari di questo paese, ma che hanno scelto di studiare qui. Quale è il loro numero e quali sono i paesi di origine di questi studenti?\n\nTranslation of the re"
    },
    {
        "db_id": "student_transcripts_tracking",
        "q_id": 579,
        "question": "Translation: List all student details in reverse alphabetical order.\n\nRephrased question in Italian:\nElencare in ordine lessicografico inverso tutti i dettagli relativi agli studenti."
    },
    {
        "db_id": "student_transcripts_tracking",
        "q_id": 580,
        "question": "(What other details can you tell me about the students in reverse alphabetical order?) →\nQuali ulteriori informazioni possono essere fornite su studenti elencati in ordine alfabetico inverso? (Which additional information can be"
    },
    {
        "db_id": "student_transcripts_tracking",
        "q_id": 581,
        "question": "1.2 del documento \"La gestione dei rifiuti nella città di Roma\" e spiega come si relaziona con la sezione h.2.1.1.\n\n(Describe the section h.1.2 of the"
    },
    {
        "db_id": "student_transcripts_tracking",
        "q_id": 582,
        "question": "Translation: What is the description for the section called H? \n\nRephrased question: Qual è la descrizione sintetica fornita per la sezione denominata H? \n\n(Translation: What is the concise description provided for the"
    },
    {
        "db_id": "student_transcripts_tracking",
        "q_id": 583,
        "question": "**\n\nTranslation:\n\nRicerca i nomi degli studenti che risiedono stabilmente in Haiti o possiedono il numero di telefono cellulare 09700166582.**\n\n\nAnswer: The rephrased question uses a more formal and"
    },
    {
        "db_id": "student_transcripts_tracking",
        "q_id": 584,
        "question": "È importante che gli studenti siano iscritti all'università e che il loro numero di cellulare sia verificato. È anche importante che gli studenti siano disponibili per partecipare a un colloqu"
    },
    {
        "db_id": "tvshow",
        "q_id": 585,
        "question": "(List the title of all cartoons in alphabetical order.)\" (Source: \"Cartoon Database\" website) [1]\n\nTitoli dei cartoni in ordine alfabetico: elencare tutti i titoli dei cartoni presenti nel"
    },
    {
        "db_id": "tvshow",
        "q_id": 586,
        "question": "(What are the titles of the ordered cartoons in alphabetical order?) \n\nTitoli dei cartoni in ordine alfabetico: quali sono? \n\n(Note: The rephrased question is a direct translation of the original question, but it is"
    },
    {
        "db_id": "tvshow",
        "q_id": 587,
        "question": "Possiamo avere una lista dei titoli dei film e delle serie TV?\n\nTranslation: List all the animated cartoons directed by \"Ben Jones\". Can we have a list of the titles of the films and TV series?\n\nRephrased question:\nEl"
    },
    {
        "db_id": "tvshow",
        "q_id": 588,
        "question": "Translation: What are the names of all the cartoons directed by Ben Jones? \n\nRephrased question in Italian:\nQuali sono i titoli di tutti i cartoni animati diretti da Ben Jones? \n\nNote: I used the"
    },
    {
        "db_id": "tvshow",
        "q_id": 589,
        "question": "Translation: How many cartoons were written by \"Joseph Kuhr\"? \n\nRephrased question in Italian:\nQuante opere di fumetto sono state create da ``Joseph Kuhr''? \n\n(Translation: How many comic strip works"
    },
    {
        "db_id": "tvshow",
        "q_id": 590,
        "question": "(What is the number of cartoons written by Joseph Kuhr?) →\nQual è il conteggio delle opere a fumetti create da Joseph Kuhr? (What is the count of comics created by Joseph Kuhr?) →\nQual"
    },
    {
        "db_id": "tvshow",
        "q_id": 591,
        "question": ".\n\nTranslation: List all the titles of animated cartoons and their directors, ordered by their air date.\n\nRephrased question in Italian:\nElencare tutti i titoli di cartoni animati e i relativi registi, ordinati per"
    },
    {
        "db_id": "tvshow",
        "q_id": 592,
        "question": "Translation: What is the name and the directors of all the cartoons that are ordered by air date? \n\nNome e registi dei cartoni animati che sono stati trasmessi in ordine cronologico? \n\nNote: The word"
    },
    {
        "db_id": "tvshow",
        "q_id": 593,
        "question": "Titolo originale: List the title of all animated cartoons directed by \"Ben Jones\" or \"Brandon Vietti\". \n\nRiflessione: \n\n•  Ben Jones è un regista animato britannico.\n•  Brandon Viet"
    },
    {
        "db_id": "tvshow",
        "q_id": 594,
        "question": "E quali sono i cartoni che hanno diretto insieme? E quali sono i titoli dei cartoni che hanno diretto insieme?\n\nTranslation: What are the titles of all the cartoons directed by Ben Jones or Brandon Vietti? And which"
    },
    {
        "db_id": "tvshow",
        "q_id": 595,
        "question": "Translation: Which country has the most TV channels? List the country and the number of TV channels it has. \n\nRephrased question: Qual è il paese che possiede il maggior numero di emittenti televisive?"
    },
    {
        "db_id": "tvshow",
        "q_id": 596,
        "question": "**\n\nTranslation: What is the country with the largest number of TV channels and how many do they have?**\n\n\n\n**Riphrased question:**\nQuale è il paese che possiede il più ampio numero di reti televis"
    },
    {
        "db_id": "tvshow",
        "q_id": 597,
        "question": "}\nTranslation: List the number of different names and content series in the TV channel table.}\n\nElencare i nomi e i contenuti di serie diversi presenti nella tabella dei canali televisivi, e fornire il relativo"
    },
    {
        "db_id": "tvshow",
        "q_id": 598,
        "question": "} \\\\ \\end{tabular}\n\\begin{tabular}{l} Quale è la varietà di serie e contenuti che figura nella tabella dei canali televisivi? \\\\ \\end{tabular}\n\\begin{tab"
    },
    {
        "db_id": "tvshow",
        "q_id": 599,
        "question": "È possibile accedere a questo contenuto attraverso la piattaforma Sky?\n\nTranslation: What is the content of the TV channel with the serial name \"Sky Radio\"? Is it possible to access this content through the Sky platform?\n\nRephr"
    },
    {
        "db_id": "tvshow",
        "q_id": 600,
        "question": "È possibile ascoltare le trasmissioni online?\n\nTranslation:\nWhat is the content of the Sky Radio Series? Can one listen to the broadcasts online?"
    },
    {
        "db_id": "tvshow",
        "q_id": 601,
        "question": "È disponibile anche la possibilità di aggiungere un ulteriore canale?\n\nTranslation:\nWhat is the package option of the TV channel with the serial name \"Sky Radio\"? Is there also the possibility of adding an additional channel?"
    },
    {
        "db_id": "tvshow",
        "q_id": 602,
        "question": "Translation:\nWhich are the options of the TV channel package whose names of the series are Sky Radio? \n\nRephrased question:\nQuali sono le opzioni del pacchetto televisivo che includono canali con serie televisive avent"
    },
    {
        "db_id": "tvshow",
        "q_id": 603,
        "question": "(How many TV channels use English language?)\n\nRipresa: \n\n(Note: I'll provide the answer in the next comment) – 09:16, 24 novembre 2022 (CET) \n\nAnswer: Quale è il numero"
    },
    {
        "db_id": "tvshow",
        "q_id": 604,
        "question": "- How many TV channels use English? \n\nRipristino del servizio di trasporto pubblico - Restoration of public transportation service. \nIl problema principale è la mancanza di fondi - The main problem is the lack of funds"
    },
    {
        "db_id": "tvshow",
        "q_id": 605,
        "question": "(Original question)\n\nElenca i linguaggi utilizzati per il minor numero di canali televisivi. La lingua di elenco e il numero di canale televisivo. (Rephrased question)"
    },
    {
        "db_id": "tvshow",
        "q_id": 606,
        "question": "(Which languages are used by the minimum number of TV channels and how many channels use them?) \n\nLingue utilizzate dal minimo numero di canali televisivi e quanti canali televisivi le utilizzano? \n\n(Rem"
    },
    {
        "db_id": "tvshow",
        "q_id": 607,
        "question": "[List every language and the number of TV channels that use it.]\"\n\nTranslation:\n\"Elencare ogni lingua e il numero di canali televisivi che la utilizzano.\""
    },
    {
        "db_id": "tvshow",
        "q_id": 608,
        "question": "Inoltre, elenca i canali TV che utilizzano più di una lingua.\n\nRephrased question in Italian:\nPer ogni lingua, identificare il numero di emittenti televisive che la utilizzano"
    },
    {
        "db_id": "tvshow",
        "q_id": 609,
        "question": "(What TV channel shows the animated cartoon \"The Rise of the Blue Beetle!''? List the name of the series on the TV channel.)}}\\end{document}\n\n\\documentclass{article}\n\\begin{document}\nRicercare"
    },
    {
        "db_id": "tvshow",
        "q_id": 610,
        "question": "''\n\n\nTranslation: What is the name of the TV channel series that shows the animated cartoon \"The Rise of the Blue Beetle\"?''\n\n\nRephrased question: Qual è il titolo del ciclo televisivo che presenta l'adattamento"
    },
    {
        "db_id": "tvshow",
        "q_id": 611,
        "question": "**\n\nTranslation: List the title of all animated cartoons shown on the TV channel with the name of the series \"Sky Radio\".**\n\nRephrased question in Italian:\nElenchiare i titoli di tutti i cartoni animati trasm"
    },
    {
        "db_id": "tvshow",
        "q_id": 612,
        "question": "È possibile avere una lista di tutti i cartools che sono stati diffusi su questo canale? È importante per me avere questa informazione per poter fare una ricerca più approfondita.\n\nTitolo di tutti i cartools che"
    },
    {
        "db_id": "tvshow",
        "q_id": 613,
        "question": "Per ogni episodio, elenca i personaggi principali e le loro relazioni tra loro. Inoltre, elenca tutti i luoghi in cui si svolge l'episodio e i personaggi"
    },
    {
        "db_id": "tvshow",
        "q_id": 614,
        "question": "(What are all the episodes ordered by evaluations?) \n\nGli episodi tutti ordinati dalle valutazioni più elevate in basso e dalle valutazioni più basse in alto. \n\n(Note: I provided the rephrased question as"
    },
    {
        "db_id": "tvshow",
        "q_id": 615,
        "question": "|\n\nTranslation:\n\nElencare le prime tre serie televisive con valutazione più elevata. Elencare l'episodio e la valutazione della serie televisiva. |\n\nNote: \"Elenco\" is not the most"
    },
    {
        "db_id": "tvshow",
        "q_id": 616,
        "question": "(Which are the 3 most appreciated episodes in the TV series table and what were those ratings?)\n\nQuali sono i tre episodi più apprezzati della tabella delle serie televisive, e quali sono stati gli indici di gradimento"
    },
    {
        "db_id": "tvshow",
        "q_id": 617,
        "question": "What is the minimum and maximum share of TV series? \nQuale è la quota di ascolto minima e massima delle serie TV che raggiungono il maggior numero di spettatori? \nWhat is the minimum and"
    },
    {
        "db_id": "tvshow",
        "q_id": 618,
        "question": "(What is the maximum and minimum quota for a TV series?)\n\nQuale è la quota massima e minima di ascolto prevista per una serie televisiva? (What is the maximum and minimum viewing quota expected for a television series?)"
    },
    {
        "db_id": "tvshow",
        "q_id": 619,
        "question": "È disponibile su Netflix.\n\nTranslation:\nWhat is the release date of the TV series episode with the episode \"A Love of a Lifetime\"? Is it available on Netflix?"
    },
    {
        "db_id": "tvshow",
        "q_id": 620,
        "question": "'\nQuale è la data esatta dell'episodio ``un amore per una vita''? \n(Note: \"un amore per una vita\" is a TV series title) \nTranslation:\nWhen was the episode \"a love for a"
    },
    {
        "db_id": "tvshow",
        "q_id": 621,
        "question": "È possibile ottenere una lista dei titoli di serie TV che hanno episodi con questo titolo?\n\nTranslation:\nWhat is the weekly rating of the TV series with the episode \"A Love of a Lifetime\"? Is it possible to obtain a"
    },
    {
        "db_id": "tvshow",
        "q_id": 622,
        "question": "](https://i.stack.imgur.com/6FZ6H.png)\n\nQual è la classificazione settimanale per l'episodio \"A Love of a Lifetime\"?](https://i.stack.imgur.com/cQV3F"
    },
    {
        "db_id": "tvshow",
        "q_id": 623,
        "question": "**\n\n(Translation: What is the TV channel of the TV series with the episode \"A Love of a Lifetime\"? List the name of the series and the TV channel.)"
    },
    {
        "db_id": "tvshow",
        "q_id": 624,
        "question": "Qual è il titolo della serie televisiva che comprende l'episodio intitolato ``Un amore per tutta la vita''?"
    },
    {
        "db_id": "tvshow",
        "q_id": 625,
        "question": "Elenca anche gli episodi delle serie TV che sono state trasmessi su `` TV Canale ''.\n\nTranslation:\nList the episode of all TV series shown on TV Canale with the name of the series \"Sky Radio\". Also list"
    },
    {
        "db_id": "tvshow",
        "q_id": 626,
        "question": "È una serie TV di fantascienza che si svolge in un futuro distopico e segue le avventure di un gruppo di sopravvissuti che cercano di sopravvivere in un mondo devastato da"
    },
    {
        "db_id": "tvshow",
        "q_id": 627,
        "question": "(Translation: Find the number of cartoons directed by each of the directors listed.) \n\nRisposta: Trovare il numero di produzioni animate dirette da ciascuno dei registi elencati. \n\n(Translation: Find"
    },
    {
        "db_id": "tvshow",
        "q_id": 628,
        "question": "(How many cartoons have each director created?) \n\nTranslation: \nQuanti cartoni ogni regista ha prodotto? \n\nOr \nQuante opere animate ogni regista ha realizzato? \n\nOr \nQual è il numero di cartoni"
    },
    {
        "db_id": "tvshow",
        "q_id": 629,
        "question": "»\n\nTranslation:\n\"Find the production code and the broadcast channel of the most recent animated cartoon airing.\"»  |  Trova il codice di produzione e il canale di trasmissione del cartone animato in onda più recent"
    },
    {
        "db_id": "tvshow",
        "q_id": 630,
        "question": "(What is the latest production code and distribution channel for the animated cartoon?)\"\n\nTranslation:\n\nQual è il codice di produzione e il canale di distribuzione più recente del cartone animato? (What is the latest production code and"
    },
    {
        "db_id": "tvshow",
        "q_id": 631,
        "question": "Come posso accedere a queste informazioni?\n\nTranslation: Find the package selection and the name of the TV series channel with high-definition TV. How can I access this information? \n\nRephrased question in Italian:\nRilevare"
    },
    {
        "db_id": "tvshow",
        "q_id": 632,
        "question": "Translation: What are the options of the package and the name of the series for the TV channel that supports high-definition TV? \n\nRephrased question in Italian: \nQuali sono le opzioni di abbonamento e il titolo"
    },
    {
        "db_id": "tvshow",
        "q_id": 633,
        "question": "(Which TV channels in countries are airing an animated cartoon written by Todd Casey?)\"\n\nQuali emittenti televisive dei paesi in questione stanno trasmittendo un cartone animato scritto da Todd Casey? \n\n(Note"
    },
    {
        "db_id": "tvshow",
        "q_id": 634,
        "question": "](https://www.italki.com/qa/what-are-the-countries-that-have-cartoons-on-tv-written-by-todd-casey) [Translation: Which countries have cartoons on TV that were written by Todd Casey?]  | ["
    },
    {
        "db_id": "tvshow",
        "q_id": 635,
        "question": "](https://i.stack.imgur.com/6i3VJ.png)\n\nTranslation:\nWhich TV channels from non-English speaking countries do not air any cartoon written by Todd Casey?\n\nRephrased question:\nI quali canali televisivi di pa"
    },
    {
        "db_id": "tvshow",
        "q_id": 636,
        "question": "»\n\nTranslation: Which countries do not broadcast the animated cartoons written by Todd Casey?» (Source: Google Translate)\n\nRephrased question:\nI quali Stati o Paesi non trasmettono le produzioni animate create da Todd Casey?"
    },
    {
        "db_id": "tvshow",
        "q_id": 637,
        "question": "](https://i.stack.imgur.com/1GK3H.png)\n\nTrova il nome della serie televisiva e il paese di origine del canale televisivo che ha trasmesso alcuni episodi diretti da Ben Jones e Michael"
    },
    {
        "db_id": "tvshow",
        "q_id": 638,
        "question": "]]\n\n\nQuali sono i nomi delle serie e i paesi di provenienza dei canali TV che hanno trasmesso i cartoni animati diretti da Ben Jones e Michael Chang?]]\n\n\nNote: The rephrased question"
    },
    {
        "db_id": "tvshow",
        "q_id": 639,
        "question": "Trova anche la percentuale di canali TV che non usano l'inglese.\n\nTranslation:\nFind the pixel ratio and the country of TV channels that do not use English. Also, find the percentage of TV channels that do not use English"
    },
    {
        "db_id": "tvshow",
        "q_id": 640,
        "question": "Translation:\nWhat is the pixel aspect ratio and country of origin for all TV channels that do not use English?\n\nRephrased question in Italian:\nQual è la rapportatura pixel e il paese di provenienza per tutti i canali televis"
    },
    {
        "db_id": "tvshow",
        "q_id": 641,
        "question": "Inoltre, cerca di identificare i paesi con più di cinque canali TV.\n\nTranslation:\nFind the IDs of TV channels from countries with more than two TV channels. Moreover, try to identify countries with more than five TV channels"
    },
    {
        "db_id": "tvshow",
        "q_id": 642,
        "question": "(Which are the IDs of all TV channels with more than 2 TV channels?)\"\n\n\"Quali sono gli identificatori di tutti i network televisivi che dispongono di più di due emittenti televisive?\"\"\n\nTranslation: \""
    },
    {
        "db_id": "tvshow",
        "q_id": 643,
        "question": "Find the IDs of TV channels that do not air any animated series directed by Ben Jones. \n\nRisposta: \nIdentificare gli identificativi dei canali televisivi che non trasmettono alcun contenuto animato"
    },
    {
        "db_id": "tvshow",
        "q_id": 644,
        "question": "Si prega di fornire una lista completa di tutti gli ID dei canali TV che non hanno cartoni animati diretti da Ben Jones, insieme a una breve descrizione di ciascuno. \nGrazie."
    },
    {
        "db_id": "tvshow",
        "q_id": 645,
        "question": "Trova la lista dei canali TV che non hanno alcun cartone animato diretto da Ben Jones. Trova l'opzione pacchetto del canale TV che non ha alcun cartone animato diretto da Ben Jones"
    },
    {
        "db_id": "tvshow",
        "q_id": 646,
        "question": "Translation: What are the package options of all TV channels that do not broadcast cartoons directed by Ben Jones? \n\nRephrased question in Italian:\nQuali sono le opzioni di abbonamento televisivo che includono tutti i canali"
    },
    {
        "db_id": "poker_player",
        "q_id": 647,
        "question": "Translation:\nHow many poker players are there? \n\nRephrased question in Italian:\nQual è il numero di giocatori di poker attualmente presenti? \n\nTranslation:\nWhat is the current number of poker players? \n\nNote: The"
    },
    {
        "db_id": "poker_player",
        "q_id": 648,
        "question": "E quali sono i giocatori più popolari?\n\nTranslation:\nCount the number of poker players. And which players are the most popular? \n\nRephrased question in Italian:\nEcco la domanda: quantificare il numero di gioc"
    },
    {
        "db_id": "poker_player",
        "q_id": 649,
        "question": "Ecco alcuni esempi di guadagni: 1.000.000 di dollari, 500.000 di dollari, 200.000 di dollari, 100.000 di dollari.\n\nTranslation:\n(El"
    },
    {
        "db_id": "poker_player",
        "q_id": 650,
        "question": "(What are the gains of poker players, ordered from highest to lowest value?)"
    },
    {
        "db_id": "poker_player",
        "q_id": 651,
        "question": "[Insert: specific year]\n\nTabella finale dei giocatori di poker più forti del mondo\nTabella finale dei giocatori di poker più forti del mondo\nTabella finale dei giocatori di poker più forti del mondo\nTabella"
    },
    {
        "db_id": "poker_player",
        "q_id": 652,
        "question": "](https://i.stack.imgur.com/8bXfJ.png)\n\nTranslation:\nWhich are the final tables realized and the best finishes for all poker players?\n\nRephrased question in Italian:\nQuali sono gli ultimi tavoli di gi"
    },
    {
        "db_id": "poker_player",
        "q_id": 653,
        "question": "...\n\n(Illustrative answer: Qual è il reddito medio dei giocatori professionisti di poker?)...\n\n(Redirected from Wikipedia)...\n\n(added by an anonymous user)...\n\n(added by a registered user)...\n\n(added by a registered"
    },
    {
        "db_id": "poker_player",
        "q_id": 654,
        "question": "Quale è il giocatore con i guadagni medi più alti?\n\n Restituire i redditi medi di tutti i giocatori di poker. Qual è il giocatore con i redditi medi più elevati? \n\n(Translation:"
    },
    {
        "db_id": "poker_player",
        "q_id": 655,
        "question": "»\n\n\n\nLa domanda è: Qual è il ranking dei giocatori di poker con i redditi più elevati?»\n\n\nTranslation: The question is: What is the ranking of poker players with the highest earnings?»\n\n\nOriginal question: What"
    },
    {
        "db_id": "poker_player",
        "q_id": 656,
        "question": "](https://i.stack.imgur.com/hZJy4.png)\n\nTranslation:\nReturn the player's degree of money with the highest earnings.\n\nRephrased question in Italian:\nRestituire il grado di ricchezza del giocatore con il"
    },
    {
        "db_id": "poker_player",
        "q_id": 657,
        "question": "È possibile ottenere questo dato attraverso l'analisi dei dati storici dei tornei di poker?\n\nTranslation: What is the maximum number of final tables achieved by poker players with earnings below 200,000? Is it possible"
    },
    {
        "db_id": "poker_player",
        "q_id": 658,
        "question": "00 USD.\n\n(I apologize if the translation is not perfect, as I am not a native Italian speaker.)  |  Restituire i tavoli finali massimi realizzati da tutti i giocatori di poker che hanno conseguito guad"
    },
    {
        "db_id": "poker_player",
        "q_id": 659,
        "question": "Translation: What are the names of the poker players? \n\nRephrased question: Quali sono gli individui più noti che si sono distinti nel gioco del poker? \n\n(Translation: What are the most notable individuals who"
    },
    {
        "db_id": "poker_player",
        "q_id": 660,
        "question": "(original question)\n\nRiconoscere e elencare tutti i giocatori di poker noti e riconosciuti. (rephrased question)"
    },
    {
        "db_id": "poker_player",
        "q_id": 661,
        "question": "(English: What are the names of the poker players whose earnings are greater than 300,000?)\"\n\nTranslation:\nQuali sono i nomi dei giocatori di poker che hanno conseguito un reddito superiore a 300.000?"
    },
    {
        "db_id": "poker_player",
        "q_id": 662,
        "question": "00 USD.\nTranslation: Provide the names of poker players who have earned more than $300,000.00 USD."
    },
    {
        "db_id": "poker_player",
        "q_id": 663,
        "question": "(Translation: List the names of the poker players in order of the final tables, in ascending order.)\n\n**Rephrased question in Italian:**\nElencare i nomi dei giocatori di poker in base alle tabelle finali"
    },
    {
        "db_id": "poker_player",
        "q_id": 664,
        "question": "Translation: What are the names of the poker players, ordered from the highest to the lowest number of final tables they have participated in? \n\nRiflessione: \n\n(Note: The rephrased question is not provided, only the translation"
    },
    {
        "db_id": "poker_player",
        "q_id": 665,
        "question": "(What is the birthdate of the poker player with the lowest earnings?)''\n\n\nQual è la data di nascita del giocatore di poker che ha conseguito i redditi più bassi?''\n\n\nQual è la data di nasc"
    },
    {
        "db_id": "poker_player",
        "q_id": 666,
        "question": "](https://i.stack.imgur.com/8eTQK.png)\n\nTranslation:\nReturn the birthdate of the poker player with the lowest earnings.\n\nRephrased question in Italian:\nRitornare la data di nascita del gioc"
    },
    {
        "db_id": "poker_player",
        "q_id": 667,
        "question": "(What is the highest amount of money of the highest poker player?) → ???? ????? ?????? ????? ?????? ?????? ???? ?????? ?????? ?????? ?????? ?????? ?????? ?????? ?????? ?????? ?????? ?????? ?????"
    },
    {
        "db_id": "poker_player",
        "q_id": 668,
        "question": "Si tratta di un sistema di punteggio che tiene conto delle vittorie e delle sconfitte del giocatore. È importante notare che il sistema di punteggio utilizzato è unico e non è possibile"
    },
    {
        "db_id": "poker_player",
        "q_id": 669,
        "question": "(What is the average gain of poker players with a height above 200 cm?) →\nQual è il reddito medio dei giocatori di poker con altezza superiore a 200 centimetri? →\nQual è il margine di"
    },
    {
        "db_id": "poker_player",
        "q_id": 670,
        "question": "000 dollari, quali sono le strategie più comuni che utilizzano per aumentare la loro probabilità di vincere?\n\nTranslation:\n\n(From the medium earnings of high-stakes poker players over $200,000, what are the"
    },
    {
        "db_id": "poker_player",
        "q_id": 671,
        "question": "](https://it.stackoverflow.com/questions/454145/quali-sono-i-nomi-dei-giocatori-di-poker-in-ordine-decrescente-di-guadagni)\n\nWhat are the names of poker players in"
    },
    {
        "db_id": "poker_player",
        "q_id": 672,
        "question": "(Note: The original question appears to be asking for the names of poker players in descending order of their winnings.) \n\nTranslation: \nRestituire i nomi dei giocatori di poker ordinati in ordine decrescente dei loro guad"
    },
    {
        "db_id": "poker_player",
        "q_id": 673,
        "question": "Nota: The question is asking about the different nationalities of people and the corresponding number of people from each nation.\r\n\r\nRephrased question in Italian:\r\n\r\nQuali sono le diverse etnie delle persone e quanti individui apparterrebbero"
    },
    {
        "db_id": "poker_player",
        "q_id": 674,
        "question": "(How many people are there of every nationality?) → ???? ????? ???????\nItalian translation: Quale sia il numero di persone di ogni nazionalità presente in questo luogo?\nEnglish translation: What is the number of people of every nationality"
    },
    {
        "db_id": "poker_player",
        "q_id": 675,
        "question": "(What is the most common nationality of people?) →\nLa nazionalità più diffusa tra le persone è quale? (…)\nTranslation: What is the most common nationality among people? (…)\nFinal Answer: The final answer is La"
    },
    {
        "db_id": "poker_player",
        "q_id": 676,
        "question": "In altre parole, quali sono le cinque nazionalità più comuni che si possono trovare in un gruppo di persone?\n\n\nTranslation:\nProvide the nationality that is most common among all people. In other words, what are the five most common"
    },
    {
        "db_id": "poker_player",
        "q_id": 677,
        "question": "(Who are the nationalities shared by at least two people?) → ???? ????? ??? ?????? ?????? ?????? ?????? ?????? ?????? ?????? ?????? ?????? ?????? ?????? ?????? ?????? ?????? ?????? ??????"
    },
    {
        "db_id": "poker_player",
        "q_id": 678,
        "question": "**\n\nTranslation: \"Return the nationalities for which there are two or more people.\"**\n\n\nRephrased question:\nRestituire le nazionalità associate a più di un individuo.**\n\n\nLet me know if you need help with"
    },
    {
        "db_id": "poker_player",
        "q_id": 679,
        "question": "Translation: List the names and birth dates of the individuals in alphabetical order from A to Z. \n\nRephrased question in Italian:\nElencare le denominazioni e le date di nascita delle persone in ordine alfabetico"
    },
    {
        "db_id": "poker_player",
        "q_id": 680,
        "question": "Translation: What are the names and birth dates of the people, ordered by their names in alphabetical order? \n\nItalian rephrased question:\nQuali sono le informazioni relative alle persone, comprendenti nomi e date di nascita"
    },
    {
        "db_id": "poker_player",
        "q_id": 681,
        "question": "Mostra anche la loro data di nascita e luogo di nascita.\n\n(Translation: Show names of people whose nationality is not ``Russia''. Also show their birth date and place of birth.) \n\n**Italian version:**\nElen"
    },
    {
        "db_id": "poker_player",
        "q_id": 682,
        "question": "(Who are the names of people who are not from Russia?) →\nSono interessato a conoscere gli individui che non sono originari del Paese russo. Potrebbe fornirmi una lista dei nomi di coloro che"
    },
    {
        "db_id": "poker_player",
        "q_id": 683,
        "question": "(List the names of people who are not poker players.) →\nElencare i nominati di coloro che non sono professionisti del poker. →\nElencare i nominati di coloro che non sono giocatori occasionali di"
    },
    {
        "db_id": "poker_player",
        "q_id": 684,
        "question": "}\n\nTranslation:\nChi sono le identità delle persone che non partecipano al gioco del poker?}  |  |\n---|---|---\n|  |  |  |  |  |  |  |  |"
    },
    {
        "db_id": "poker_player",
        "q_id": 685,
        "question": "La domanda è: Quante nazionalità distinte ci sono?\r\n\r\nTranslation: How many distinct nationalities are there?"
    },
    {
        "db_id": "poker_player",
        "q_id": 686,
        "question": "(Count the number of different nationalities.) → _______________________?"
    },
    {
        "db_id": "voter_1",
        "q_id": 687,
        "question": "How many countries are there? \nRipristino delle attività economiche dopo una crisi. Restoration of economic activities after a crisis.\nIl costo delle attività commerciali in Italia. The cost of commercial activities in Italy.\nSvilup"
    },
    {
        "db_id": "voter_1",
        "q_id": 688,
        "question": "(English translation: List the numbers and names of the contestants, ordered by the contestant's surname in descending order.)\"\n\nTranslation:\nElenca i numeri e i nomi dei concorrenti, ordinati per cognome in ordine dec"
    },
    {
        "db_id": "voter_1",
        "q_id": 689,
        "question": "Possiamo fare una lista dei voti validi e dei voti non validi?\n\nTranslation:\nList the vote IDs, phone numbers, and states of all votes. Can we make a list of valid and invalid votes?"
    },
    {
        "db_id": "voter_1",
        "q_id": 690,
        "question": "(What are the maximum and minimum values of area codes?)\n\nValori massimi e minimi dei codici di area: quali sono? (What are the maximum and minimum values of area codes?)\n\nNote: The rephrased question is a"
    },
    {
        "db_id": "voter_1",
        "q_id": 691,
        "question": "}\n\nTranslation: What is the last date created by the votes from the state \"CA\"?} ¹\n¹ The translation provided is not a direct translation, but rather an attempt to convey the meaning of the original question using a more formal and professional"
    },
    {
        "db_id": "voter_1",
        "q_id": 692,
        "question": "e che hanno partecipato alla competizione di ginnastica artistica femminile ai Giochi Olimpici di Tokyo 2020?\n\nTranslation: What are the names of the competitors whose names are not \"Jessie ab"
    },
    {
        "db_id": "voter_1",
        "q_id": 693,
        "question": "Translation: What are the distinct states and create a timeline of all the votes? \n\nRephrased question in Italian:\nQuali sono i diversi stati e come possono essere rappresentati cronologicamente tutti i voti? \n\nTranslation"
    },
    {
        "db_id": "voter_1",
        "q_id": 694,
        "question": "(Which are the numbers of the contestants and the names of the contestants who have received at least two votes?)\n\nSono a conoscenza dei dati relativi ai concorrenti che hanno ricevuto almeno due voti e desidero ot"
    },
    {
        "db_id": "voter_1",
        "q_id": 695,
        "question": "](https://i.stack.imgur.com/8eJWV.png)\n\nLa domanda è: Qual è il numero del concorrente e il nome del concorrente che hanno ottenuto il minor numero di voti tra tutti i conc"
    },
    {
        "db_id": "voter_1",
        "q_id": 696,
        "question": "Translation: What is the number of votes from the state \"NY\" or \"CA\"? \n\nRephrased question:\nQual è il conteggio dei voti relativi allo stato \"New York\" o \"California\"? \n\nTranslation:"
    },
    {
        "db_id": "voter_1",
        "q_id": 697,
        "question": "Translation: How many contestants were not voted for? \nRephrased question: Quale è il numero di partecipanti che non hanno ricevuto voti?"
    },
    {
        "db_id": "voter_1",
        "q_id": 698,
        "question": "](https://stackoverflow.com/questions/74312317/rephrase-the-following-question-in-italian-using-a-professional-and-higher-lexico)\n\nRephrased question: Qual è il codice di area statistico più frequentemente associ"
    },
    {
        "db_id": "voter_1",
        "q_id": 699,
        "question": "Translation:\nWhat are the creation dates, states, and phone numbers of the votes that were for the contestant called \"Tabatha Gehling\"? \n\nRephrased question in Italian:\nQuali sono le date di inizio, gli stati e"
    },
    {
        "db_id": "voter_1",
        "q_id": 700,
        "question": "Translation: List the area codes where voters have voted for both candidates \"Tabatha Gehling\" and \"Kelly Clauss\". \n\nRephrased question in Italian:\nElencare i codici di zona in cui gli elettori"
    },
    {
        "db_id": "voter_1",
        "q_id": 701,
        "question": "(Translation: Return the names of the contestants whose names contain the substring \"Al\".) \n\nRisposta:\nRestituire gli appellativi dei partecipanti i cui appellativi includono la sottosequenza \""
    },
    {
        "db_id": "world_1",
        "q_id": 702,
        "question": "(Note: I'll provide the correct answer in the comments section.) \n\nAnswer: Quali sono gli stati che hanno acquisito l'indipendenza a partire dal 1950? \n\n(Please add your answer in the comments"
    },
    {
        "db_id": "world_1",
        "q_id": 703,
        "question": "(Give the names of the nations that were founded after 1950.)\"\n\nTranslated question in Italian:\nElencare le denominazioni delle nazioni istituite dopo il 1950."
    },
    {
        "db_id": "world_1",
        "q_id": 704,
        "question": "Translation: How many countries have a republic as a form of government? \n\nRephrased question: Quale è il numero di stati che adottano la forma di governo repubblicana? \n\n(Full translation: What is the"
    },
    {
        "db_id": "world_1",
        "q_id": 705,
        "question": "(How many countries have governments that are republics?) \n\nRisposta: Ci sono 100 paesi che hanno governi repubblicani. \n\n(Answer: There are 100 countries with republican governments.) \n\nTranslation:\nQuale"
    },
    {
        "db_id": "world_1",
        "q_id": 706,
        "question": "Translation: What is the total surface area of the countries in the Caribbean region?\n\nRephrased question: Quale è l'estensione complessiva delle aree territoriali dei paesi situati nella regione dei Caraibi?"
    },
    {
        "db_id": "world_1",
        "q_id": 707,
        "question": "Translation: How much surface area do countries cover in the Caribbean? \n\nRephrased question: Quale estensione territoriale occupano i paesi del bacino caraibico? \n\nTranslation: What territorial extension do countries in the"
    },
    {
        "db_id": "world_1",
        "q_id": 708,
        "question": "](https://i.stack.imgur.com/4y7WY.png)\n\nIn quale continente si colloca Anguilla?](https://i.stack.imgur.com/4y7WY.png) 1\n\nAnswer: The Caribbean Sea is"
    },
    {
        "db_id": "world_1",
        "q_id": 709,
        "question": "(What is the name of the continent to which Anguilla belongs?) →\nIl quale continente è caratterizzato da Anguilla come sua giurisdizione geografica? (Which continent is characterized by Anguilla as its geographical"
    },
    {
        "db_id": "world_1",
        "q_id": 710,
        "question": "Translation: In which region is the city of Kabul located? \nRephrased question: In quale zona geografica è situata la città di Kabul? \n\nPlease provide the rephrased question in Italian. \nRephr"
    },
    {
        "db_id": "world_1",
        "q_id": 711,
        "question": "È la capitale del Pakistan?\n\nTranslation: In which region is Kabul located? Is it the capital of Pakistan?\n\nRephrased question:\nIn quale regione geografica si situa la città di Kabul, che costituisce"
    },
    {
        "db_id": "world_1",
        "q_id": 712,
        "question": "È possibile ottenere informazioni su questo argomento?\n\nTranslation:\nWhat is the most popular language in Aruba? Can we get information on this topic? È possibile ottenere informazioni su questo argomento?\n\nReph"
    },
    {
        "db_id": "world_1",
        "q_id": 713,
        "question": "¿\n\nLa lingua che viene più frequentemente parlata in Aruba è qualificata? ¿\n\nLa lingua più comune parlata in Aruba è la quale? ¿\n\nLa lingua dominante in Aruba è la quale"
    },
    {
        "db_id": "world_1",
        "q_id": 714,
        "question": "(What are the population and life expectancy expectations in Brazil?) →\nCosa possono essere le previsioni di popolazione e aspettative di sopravvivenza in Brasile? (What may be the population forecasts and life"
    },
    {
        "db_id": "world_1",
        "q_id": 715,
        "question": "Per favore, fornisci le cifre più aggiornate.](https://i.stack.imgur.com/4kTlL.png)\n\nTranslation:\nGive me the population of Brazil and life expectancy. Please, provide the most up-to-date figures"
    },
    {
        "db_id": "world_1",
        "q_id": 716,
        "question": "(Reword the question using a professional and higher lexicon:) \nQual è la geografia e la demografia dell'Angola? \n\nPlease provide the rephrased question. \n\n(No additional text, comments, or notes.)"
    },
    {
        "db_id": "world_1",
        "q_id": 717,
        "question": "Translation: Which region belongs to Angola and what is its population?  Rephrased question in Italian:\nA quale zona geografica appartiene il Paese dell'Angola e quanti abitanti ha? \n(Translation: To"
    },
    {
        "db_id": "world_1",
        "q_id": 718,
        "question": "(Original question in English: What is the expected average life expectancy predicted for countries in the Central African region?) \n\nTranslation: \nQual è l'aspettativa di vita media prevista per i paesi della regione africana cent"
    },
    {
        "db_id": "world_1",
        "q_id": 719,
        "question": "}\n\nTranslation:\nWhat is the average life expectancy of people in Central Africa?}"
    },
    {
        "db_id": "world_1",
        "q_id": 720,
        "question": "(What is the name of the country with the shortest life expectancy in Asia?) → ???? ??????? ??? ????? ?????? ?????? ?????? ???????? ?????? ?????? ?????? ?????? ?????? ?????? ?????? ?????? ?????? ?????"
    },
    {
        "db_id": "world_1",
        "q_id": 721,
        "question": "»\n\nAnswer: Qual è il paese asiatico con la più bassa aspettativa di vita?» (Note: \"Aspettativa di vita\" is a more formal and professional way to express \"aspettativa di"
    },
    {
        "db_id": "world_1",
        "q_id": 722,
        "question": "Translation:\nQual è la popolazione totale e il massimo Pil in Asia? \n\nRephrased question:\nQuale è la combinazione di dati demografici e economici più elevata che si riscontra in Asia,"
    },
    {
        "db_id": "world_1",
        "q_id": 723,
        "question": "](https://i.stack.imgur.com/4u4JL.png)\n\n\\begin{code}\nQuale è il numero di abitanti in Asia e quale è il più grande prodotto interno lordo (GNP) tra i pa"
    },
    {
        "db_id": "world_1",
        "q_id": 724,
        "question": "Translation: What is the median life expectancy in African countries that are republics?"
    },
    {
        "db_id": "world_1",
        "q_id": 725,
        "question": "Translation: What are the life expectancy rates for countries in Africa? Which are the republics? \n\nRephrased question:\nQuali sono le medie di aspettativa di vita per le diverse nazioni africane, e"
    },
    {
        "db_id": "world_1",
        "q_id": 726,
        "question": "What is the total surface area of the continents Asia and Europe? \n? \n? \n?? \n?? \n?? \n?? \n?? \n?? \n?? \n?? \n?? \n?? \n?? \n?? \n?? \n?? \n?? \n??"
    },
    {
        "db_id": "world_1",
        "q_id": 727,
        "question": "|\n\nTranslation:\nFornire la superficie totale occupata dai paesi in Asia o in Europa. |\n\nRephrased question:\n\nFornire la superficie territoriale complessiva dei paesi ubicati in Asia o in Europa"
    },
    {
        "db_id": "world_1",
        "q_id": 728,
        "question": "(How many people live in the Gelderland district?)}\n\nQuale è il numero di abitanti del distretto di Gelderland? (What is the number of inhabitants of the Gelderland district?)}\n\nPlease provide a correct and precise answer"
    },
    {
        "db_id": "world_1",
        "q_id": 729,
        "question": "Translation:\nWhat is the total population of the district of Gelderland? \n\nRephrased question:\nQuale è il numero complessivo di abitanti del distretto di Gelderland? \n\nNote: The district of Gelderland"
    },
    {
        "db_id": "world_1",
        "q_id": 730,
        "question": "](https://www.quora.com/What-is-the-average-GDP-and-total-population-of-all-countries-whose-government-is-the-territory-of-the-United-States)\n\nQual è il PIL medio e la popolazione totale delle"
    },
    {
        "db_id": "world_1",
        "q_id": 731,
        "question": "Scegliere le nazioni che hanno un PIL medio inferiore a 20.000 dollari e una popolazione totale inferiore a 1 milione di abitanti.\n\n(Translation: Give the average GDP and the total"
    },
    {
        "db_id": "world_1",
        "q_id": 732,
        "question": "(How many unique languages are spoken in the world?)\"\n\n\"Qual è il numero esatto delle lingue uniche che vengono parlate in tutto il mondo?\"\n\n\nFinal Answer: The final answer is \"Qual è il numero esatto"
    },
    {
        "db_id": "world_1",
        "q_id": 733,
        "question": "](https://i.stack.imgur.com/5eB9A.png)\n\nTranslation: What is the number of distinct languages used worldwide?](https://i.stack.imgur.com/5eB9A.png)\n\nIn Italian:\nQual è il numero di"
    },
    {
        "db_id": "world_1",
        "q_id": 734,
        "question": "Translation: How many types of governments are there in Africa? \n\nRephrased question: Qual è il numero di sistemi politici diversi presenti in Africa? \n\nTranslation: What is the number of different political systems present in Africa?"
    },
    {
        "db_id": "world_1",
        "q_id": 735,
        "question": "](https://i.stack.imgur.com/9Q4qV.png)\n\nTranslation:\nHow many different forms of governments are there in Africa?](https://i.stack.imgur.com/9Q4qV.png)\n\nRephrased question in Italian"
    },
    {
        "db_id": "world_1",
        "q_id": 736,
        "question": "Translation: What is the total number of languages used in Aruba? \n\nRephrased question: Qual è il complesso della varietà linguistica presente in Aruba? \n\nTranslation: What is the complex of linguistic variety present"
    },
    {
        "db_id": "world_1",
        "q_id": 737,
        "question": "(How many languages are spoken in Aruba?) \n\nQuale è il numero delle lingue parlate nella Repubblica d'Aruba? \n\n(Translation: What is the number of languages spoken in the Republic of Aruba?)  |"
    },
    {
        "db_id": "world_1",
        "q_id": 738,
        "question": "Translation: How many official languages does Afghanistan have? \nRephrased question: Quale è il numero delle lingue ufficialmente riconosciute in Afghanistan? \n(What is the number of officially recognized languages in Afghanistan?)"
    },
    {
        "db_id": "world_1",
        "q_id": 739,
        "question": "**Rephrased question:** Quale è il numero delle lingue ufficiali che vengono pronunciate in Afghanistan? \n\n**Translation:** What is the number of official languages spoken in Afghanistan? \n\n**Note:** The"
    },
    {
        "db_id": "world_1",
        "q_id": 740,
        "question": "- What is the name of the country that speaks the most languages? - ¿Cuál es el nombre del país que habla el mayor número de lenguas? - Quel est le nom du pays qui parle le plus de langues"
    },
    {
        "db_id": "world_1",
        "q_id": 741,
        "question": "(Give the name of the country that uses the most languages.)\" (Source: [1])\n\nLa nazione che utilizza il maggior numero di lingue è nota per avere una popolazione multilingue e una cultura ricca e"
    },
    {
        "db_id": "world_1",
        "q_id": 742,
        "question": "È vero che l'Europa ha più lingue diverse di qualsiasi altro continente? È possibile che ci siano continenti con più lingue diverse di quell'Europa?\n\nTranslation: Which continent has the most diverse"
    },
    {
        "db_id": "world_1",
        "q_id": 743,
        "question": "È vero che i continenti più grandi hanno più lingue? È vero che le isole hanno più lingue? È vero che le città più grandi hanno più lingue? È vero che le zone urbane hanno più ling"
    },
    {
        "db_id": "world_1",
        "q_id": 744,
        "question": "How many countries speak both English and Dutch? \nHow many countries have English and Dutch as official languages? \nWhich countries have both English and Dutch as official languages? \nHow many countries have English and Dutch as widely spoken languages? \nHow many"
    },
    {
        "db_id": "world_1",
        "q_id": 745,
        "question": "(What is the number of countries that use English and Dutch?) \n\nLa domanda è: Quale è il numero di stati che utilizzano lingua inglese e lingua olandese? \n\nNote: \"nazioni\" is"
    },
    {
        "db_id": "world_1",
        "q_id": 746,
        "question": "What are the countries whose official languages are both English and French? \nWhat are the countries where both English and French are official languages? \nWhich countries have English and French as official languages? \nWhich countries use both English and French as official languages"
    },
    {
        "db_id": "world_1",
        "q_id": 747,
        "question": "È possibile che ci siano nazioni che parlano entrambe le lingue come lingua ufficiale? Se sì, quali sono?\n\nTranslation:\nGive the names of the nations that speak both English and French. Is it possible"
    },
    {
        "db_id": "world_1",
        "q_id": 748,
        "question": "](https://i.stack.imgur.com/2sQl4.png)\n\nTranslation: Which are the names of the countries where English and French are official languages?\n\nRephrased question in Italian:\nQuali sono le nazioni che hanno l'"
    },
    {
        "db_id": "world_1",
        "q_id": 749,
        "question": "Sono interessato a scoprire i nomi dei paesi che hanno inglese e francese come lingue ufficiali.\n\n(Translation: Give me the names of countries with English and French as official languages. I am interested in"
    },
    {
        "db_id": "world_1",
        "q_id": 750,
        "question": "}\n\nTranslation:\nQuale è il numero di macroregioni geografiche distinte in cui si parla una delle varie lingue cinesi?}"
    },
    {
        "db_id": "world_1",
        "q_id": 751,
        "question": "(How many continents speak Chinese?)**\n\nLa domanda è: \"Quanti continenti sono caratterizzati da una significativa presenza di lingua cinese?\" (How many continents are characterized by a significant presence of Chinese language?)**."
    },
    {
        "db_id": "world_1",
        "q_id": 752,
        "question": "(Which regions use English or Dutch?) →\nQuali sono le aree geografiche che adottano l'inglese o il nederlandese come lingue ufficiali o di ampia diffusione? (Which geographical areas"
    },
    {
        "db_id": "world_1",
        "q_id": 753,
        "question": "(Note: Keep in mind that the target audience is likely to be professionals or academics, so the rephrased question should be formal and use a higher lexicon.) \n\nTranslation: Which regions speak Dutch or English? \n\nRephrased"
    },
    {
        "db_id": "world_1",
        "q_id": 754,
        "question": "What are the countries where English or Dutch is an official language? \n\nRicercare i paesi in cui l'inglese o l'olandese è la lingua ufficiale. \n\n(Original text remains the same)"
    },
    {
        "db_id": "world_1",
        "q_id": 755,
        "question": "(Which countries have English or Dutch as an official language?)\"\n\n---\n\nQuali nazioni hanno inglese o olandese come lingua ufficiale riconosciuta? (Which nations have English or Dutch as a recognized official language?)"
    },
    {
        "db_id": "world_1",
        "q_id": 756,
        "question": "È vero che il cinese è la lingua più parlata in Asia?\n\nNote: \"Rephrase\" means to express the question in a different way using more formal and sophisticated language, while maintaining the same meaning. The goal is to create"
    },
    {
        "db_id": "world_1",
        "q_id": 757,
        "question": "(Which is the language used by the most Asian countries?)"
    },
    {
        "db_id": "world_1",
        "q_id": 758,
        "question": "(Which languages are spoken by a single country in the governments of the Republic?)\"\n\n---\n\nQuali idiomi sono esclusivamente parlati da un singolo Stato all'interno delle istituzioni governative della Repubblica? ("
    },
    {
        "db_id": "world_1",
        "q_id": 759,
        "question": "(Translation: Which languages are used only by a single country with a government of the Republic?) \n\nRilevare le lingue che sono utilizzate esclusivamente da un paese con un sistema di governo repubblicano."
    },
    {
        "db_id": "world_1",
        "q_id": 760,
        "question": "»\n\nTranslation: Find the city with the largest population that uses English.»\n\nRephrased question: Qual è la città con la più ampia comunità linguistica inglese?»\n\nPlease note that I will not provide any explanation,"
    },
    {
        "db_id": "world_1",
        "q_id": 761,
        "question": "}\n\n[Your answer] \n\nLa città più frequentata che utilizza l'inglese come lingua ufficiale è quale?} \n\n(Translation: What is the most frequented city that uses English as its official language?) \n\nNote:"
    },
    {
        "db_id": "world_1",
        "q_id": 762,
        "question": "(Find the name, population, and life expectancy of the Asian country with the largest area.)\"\n\nLa domanda è: Qual è il nome del paese asiatico più grande in termini di superficie, e quali sono la popol"
    },
    {
        "db_id": "world_1",
        "q_id": 763,
        "question": "(What is the name, population, and life expectancy of the largest Asian country by land area?)\"\n\nName: ______________________________________\nPopulation: ___________________________________\nLife Expectancy: __________________________________\n\nName: Cina\nPopulation: 1,439,323,"
    },
    {
        "db_id": "world_1",
        "q_id": 764,
        "question": "Translation: What is the average life expectancy in countries where English is not the official language? \n\nRephrased question:\nQual è la durata media della vita attesa nei paesi dove l'inglese non è la lingua u"
    },
    {
        "db_id": "world_1",
        "q_id": 765,
        "question": "Qual è la differenza tra la speranza di vita media dei paesi in cui l'inglese è la lingua ufficiale e dei paesi in cui non lo è?\n\nTranslation: What is the difference in life expectancy between countries where"
    },
    {
        "db_id": "world_1",
        "q_id": 766,
        "question": "Translation: What is the total number of people living in countries that do not use English? \nRephrased question: Quale è l'entità complessiva delle popolazioni residenti in stati che non utilizzano l"
    },
    {
        "db_id": "world_1",
        "q_id": 767,
        "question": "}  |  **Quale è il numero di persone che risiedono in paesi dove non è lingua comune l'inglese?**\n\n\n{Rephrase the following question in Italian using a professional and higher lexicon. Only"
    },
    {
        "db_id": "world_1",
        "q_id": 768,
        "question": "**\n\nTranslation to Italian:\n\nQual è la lingua ufficiale utilizzata nel paese la cui testa di stato è Beatrix?**\n\n\n**Corrected answer:**\n\nNetherlands (The Netherlands) is the country whose head of state"
    },
    {
        "db_id": "world_1",
        "q_id": 769,
        "question": "?\n\n**Translation:** What is the official language used in the country whose head of state is Beatrix.? **Rephrased question:** Qual è la lingua ufficiale utilizzata nel paese governato dal capo di stato o"
    },
    {
        "db_id": "world_1",
        "q_id": 770,
        "question": "»\n\n(Translation: What is the total number of unique official languages spoken in countries that merged before 1930?)»  | Qual è il numero complessivo di idiomi ufficiali unici diffusi presso gli Stati che"
    },
    {
        "db_id": "world_1",
        "q_id": 771,
        "question": "(Original question in English: For countries founded before 1930, what is the total number of distinct official languages?)\"\n\nTranslation: \"Per i paesi fondati anteriormente al 1930, quanti sono i totali di lingue"
    },
    {
        "db_id": "world_1",
        "q_id": 772,
        "question": "È importante sottolineare che siamo interessati ai paesi che hanno una superficie maggiore di qualsiasi altra nazione in Europa, ma non necessariamente i più estesi in assoluto.\n\nTranslation:"
    },
    {
        "db_id": "world_1",
        "q_id": 773,
        "question": "(Which countries have a larger area than any country in Europe?)\n\nTranslation:\nI quali Stati hanno un'estensione territoriale maggiore di qualsiasi Stato europeo?"
    },
    {
        "db_id": "world_1",
        "q_id": 774,
        "question": "](https://www.linguahouse.it/it/translate/what-are-the-african-countries-with-a-population-less-than-any-asian-country.html) 1. How do you say \"What are the African countries with a population"
    },
    {
        "db_id": "world_1",
        "q_id": 775,
        "question": "}\n\nTranslation: Which African countries have a smaller population than any Asian country?}  |  |\n|  |  |\n\n|  |  |\n\n|  |  |\n\n|  |  |\n\n|  |  |\n\n|  |  |"
    },
    {
        "db_id": "world_1",
        "q_id": 776,
        "question": "(Which Asian countries have a population larger than any country in Africa?)\"\n\n\"Quali nazioni asiatiche presentano una popolazione più ampia di qualsiasi Stato africano?\" (Which Asian nations have a population larger"
    },
    {
        "db_id": "world_1",
        "q_id": 777,
        "question": "(Which Asian countries have a population larger than any country in Africa?) →\nI quali paesi asiatici presentano una popolazione più ampia di quella di qualsiasi paese africano? \n\n(Translation: Which Asian"
    },
    {
        "db_id": "world_1",
        "q_id": 778,
        "question": "(What are the national codes for countries that do not speak English?) →\nQuali sono i codici di identificazione nazionale utilizzati dai paesi che non hanno l'inglese come lingua ufficiale? →"
    },
    {
        "db_id": "world_1",
        "q_id": 779,
        "question": "(Translation: Provide country codes for countries that do not speak English.)\"\n\n\"Ritornare i codici delle nazioni per le nazioni che non utilizzano l'inglese come lingua ufficiale.\" \n\nPlease note that"
    },
    {
        "db_id": "world_1",
        "q_id": 780,
        "question": "(What are the national codes of the countries where people speak languages other than English?) \n\nCodici nazionali dei paesi in cui le persone utilizzano lingue diverse da quella inglese, quali sono? \n\n(Note: Please keep"
    },
    {
        "db_id": "world_1",
        "q_id": 781,
        "question": "È importante per noi capire come funzionano i codici di pagamento in quei paesi.\n\nTranslation:\nProvide the country codes for countries where people speak languages other than English. It's important for us to understand how payment codes work in"
    },
    {
        "db_id": "world_1",
        "q_id": 782,
        "question": "Translation: \nWhich are the country codes of those countries that do not speak English and whose government forms are not republics? \n\nRephrased question in Italian:\nQuali sono i codici delle nazioni che non utilizzano"
    },
    {
        "db_id": "world_1",
        "q_id": 783,
        "question": "Restituisci anche i codici dei paesi che hanno repubbliche ma non parlano inglese.\n\nTranslation: Return the codes of countries that do not speak English and do not have republics for their governments. Return also the codes of"
    },
    {
        "db_id": "world_1",
        "q_id": 784,
        "question": "**\nWhich cities are in European countries where English is not an official language?**\n\n\n\nTranslation:\n\nQuali città si trovano in paesi europei in cui l'inglese non è la lingua ufficiale?**\n\nNote: I used"
    },
    {
        "db_id": "world_1",
        "q_id": 785,
        "question": "(Translation: Which are the names of cities in Europe where English is not the official language?) \n\nRiphrasi del quesito: \n___________ \n(No additional text)  |  |  |  |  |  |"
    },
    {
        "db_id": "world_1",
        "q_id": 786,
        "question": "(Which unique cities can be found in Asian countries where Chinese is the official language?)"
    },
    {
        "db_id": "world_1",
        "q_id": 787,
        "question": "Translation:\nReturn the different names of cities that are located in Asia and for which Chinese is the official language. \n\nRephrased question in Italian:\nIndicare i vari toponimi delle città situate in Asia per le quali il c"
    },
    {
        "db_id": "world_1",
        "q_id": 788,
        "question": "What is the name, year of independence, and surface area of the country with the smallest population? \n\nNome del paese: _______________________________________\nAnno di indipendenza: __________________________________\nSuperficie: __________________________________________\nPopolazione"
    },
    {
        "db_id": "world_1",
        "q_id": 789,
        "question": "](https://i.stack.imgur.com/4h8lq.png)\n\nNota: The answer is Bhutan, 1947, and 38,117 km².](https://i.stack.imgur.com/4h8lq.png)"
    },
    {
        "db_id": "world_1",
        "q_id": 790,
        "question": "Translation:\nWhat is the population, name, and leader of the country with the largest area? \n\nRephrased question in Italian:\nQual è la nazione con la superficie più estesa, in termini di popolazione,"
    },
    {
        "db_id": "world_1",
        "q_id": 791,
        "question": "Translation: Give the name, population, and head of state for the country with the largest area. \n\nRephrased question in Italian:\nIndicare il nome, la popolazione e il capo di stato del paese che presenta"
    },
    {
        "db_id": "world_1",
        "q_id": 792,
        "question": "(Original question) →\nRestituire il nome del paese e il numero di lingue ufficialmente riconosciute per ogni nazione che possiede un numero di lingue parlate superiore a tre. (Re"
    },
    {
        "db_id": "world_1",
        "q_id": 793,
        "question": "(Which countries speak more than 2 languages, and how many languages do they speak?)"
    },
    {
        "db_id": "world_1",
        "q_id": 794,
        "question": "**\n\nTranslation: Find the number of cities in each district whose population is greater than the average population of cities?**\n\nRephrased question in Italian:\nRilevare il numero di città in ogni distretto aventi una popolazione"
    },
    {
        "db_id": "world_1",
        "q_id": 795,
        "question": "Translation: How many cities in each district have a population above the average population in all cities? \n\nRephrased question in Italian:\n\nQuali sono i numeri di città per distretto che presentano una popolazione superiore"
    },
    {
        "db_id": "world_1",
        "q_id": 796,
        "question": "5 anni.\n\nTranslation:\nFind the name of the government module and the total population for each form of government whose life expectancy is longer than 72.5 years."
    },
    {
        "db_id": "world_1",
        "q_id": 797,
        "question": "**\n\nTranslation: What are the different forms of government and what is the total population of each for the governing forms that have a life expectancy above 72?**\n\n\nWhat are the various forms of government and what is the total population of each for the"
    },
    {
        "db_id": "world_1",
        "q_id": 798,
        "question": "|\n\nAnswer: Rilevare l'aspettativa di vita media media e la popolazione complessiva per ogni continente in cui l'aspettativa di vita media è inferiore a 72 anni? |"
    },
    {
        "db_id": "world_1",
        "q_id": 799,
        "question": "Translation:\nWhat are the different continents and the total population and average life expectancy corresponding to each, for the continents with an average life expectancy below 72? \n\nRephrased question in Italian:\nQuali sono i diversi continenti e"
    },
    {
        "db_id": "world_1",
        "q_id": 800,
        "question": "(Which are the names and areas of the countries with the 5 largest areas?)\n\n**Riproposta:** Quali sono i nomi e le superfici dei paesi con le cinque aree territoriali maggiori?"
    },
    {
        "db_id": "world_1",
        "q_id": 801,
        "question": "Sono richiesti i nomi e le dimensioni dei 5 paesi più popolati in base al numero di abitanti. Sono richiesti i nomi e le superficie dei 5 paesi più estesi"
    },
    {
        "db_id": "world_1",
        "q_id": 802,
        "question": "(What are the names of the countries with the top 3 largest populations?) \n\n1. Quali sono i paesi che ospitano le prime tre popolazioni più numerose del mondo?\n2. I quali sono i paesi con"
    },
    {
        "db_id": "world_1",
        "q_id": 803,
        "question": "Translation:\nReturn the names of the 3 most populous countries. \n\nRephrased question:\nRestituire i nomi dei tre stati più densamente popolati. \n\nNote: The rephrased question maintains the same meaning"
    },
    {
        "db_id": "world_1",
        "q_id": 804,
        "question": "(Which are the names of the countries with the 3 lowest populations?) \n\nSono quali sono le nazioni con le tre popolazioni più basse? \n\nTranslation: Which are the countries with the three lowest populations? \n\nNote: The"
    },
    {
        "db_id": "world_1",
        "q_id": 805,
        "question": "(Translate: Return the names of the 3 countries with the smallest number of people.) \n\nRestituire i nomi dei tre paesi con il minor numero di abitanti."
    },
    {
        "db_id": "world_1",
        "q_id": 806,
        "question": "(How many countries are in Asia?) →\nQuale è il numero di Stati membri che si trovano nel continente asiatico? (Which is the number of member States that are found in the Asian continent?) →\nWhat"
    },
    {
        "db_id": "world_1",
        "q_id": 807,
        "question": "È possibile fare questo conteggio con una semplice lista di paesi? È possibile utilizzare una fonte attendibile per questo conteggio? È possibile verificare la precisione di questi dati?\n\nContare il numero"
    },
    {
        "db_id": "world_1",
        "q_id": 808,
        "question": "Translation: Which are the names of the countries located in the European continent that have a population of 80,000? \n\nRephrased question: Quali sono gli Stati membri dell'Unione europea che presentano una"
    },
    {
        "db_id": "world_1",
        "q_id": 809,
        "question": "000 persone o più.\nTranslation: Name the countries in Europe that have a population of 80 million people or more."
    },
    {
        "db_id": "world_1",
        "q_id": 810,
        "question": "000 km²?\n\nTranslation:\n\nQual è la popolazione totale e l'area media dei paesi del Nord America con superficie maggiore di 3.000.000 km²?"
    },
    {
        "db_id": "world_1",
        "q_id": 811,
        "question": "000 km².\n\n(Translation: Provide the total population and the corresponding average surface area for the countries in North America that have a surface area greater than 3000,000 km².)  |  | Fornire la popolazione tot"
    },
    {
        "db_id": "world_1",
        "q_id": 812,
        "question": "](https://stackoverflow.com/questions/74631115/rephrase-the-following-question-in-italian-using-a-professional-and-higher-lexico)\n\nAnswer: Quali sono le città che presentano una popolazione compresa tra 160"
    },
    {
        "db_id": "world_1",
        "q_id": 813,
        "question": "(Note: The translation is not provided in the original text, but the translation of the question is expected to be provided in the text itself, as per the task requirements.) \n\nTranslation: \nRestituire i nomi delle città che presentano"
    },
    {
        "db_id": "world_1",
        "q_id": 814,
        "question": "](https://i.stack.imgur.com/2V3QK.png)\n\nTranslation: Which language is spoken by the largest number of countries?](https://i.stack.imgur.com/2V3QK.png)\n\nRephrased question in Italian"
    },
    {
        "db_id": "world_1",
        "q_id": 815,
        "question": "La lingua inglese è la più diffusa, ma non è l'unica. Ci sono molte altre lingue che sono parlate in diversi paesi del mondo. Qual è la lingua più spesso parlata in un"
    },
    {
        "db_id": "world_1",
        "q_id": 816,
        "question": "(What is the language spoken by the largest percentage of people in every country?) →\n? →\n(Translation: What is the language spoken by the majority of the population in every country?) →\n? →\n(Translation: Which language is"
    },
    {
        "db_id": "world_1",
        "q_id": 817,
        "question": "](https://i.stack.imgur.com/8c5zK.png)\n\nQuali sono i codici nazionali dei diversi Paesi e quali sono le lingue parlate dalla più ampia percentuale di persone per ciascuno"
    },
    {
        "db_id": "world_1",
        "q_id": 818,
        "question": "]\n\nTranslation: What is the total number of countries where Spanish is spoken by the largest percentage of people?]\n\nRephrased question in Italian:\nQual è il numero complessivo dei Paesi in cui lo spagnolo è la lingua"
    },
    {
        "db_id": "world_1",
        "q_id": 819,
        "question": "[Count the number of countries where Spanish is the predominantly spoken language.] →\nRilevare il numero di nazioni per cui lo spagnolo rappresenta la lingua più diffusa. [Your answer here]"
    },
    {
        "db_id": "world_1",
        "q_id": 820,
        "question": "(What are the countries where Spanish is spoken by the largest percentage of people?) →\nI quali paesi presentano la maggiore percentuale di parlanti di spagnolo? (Which countries have the largest percentage of Spanish speakers?) →"
    },
    {
        "db_id": "world_1",
        "q_id": 821,
        "question": "Translation: Return the country codes for which Spanish is the predominantly spoken language. \n\nRephrased question in Italian:\nRestituire i codici delle nazioni per cui lo spagnolo è la lingua più diffusa. \n\nNote"
    },
    {
        "db_id": "orchestra",
        "q_id": 822,
        "question": "(How many drivers are there?) →\nNota: The rephrased question should be formal and professional, as if it were asked in a business or academic setting. Avoid using colloquial expressions or slang. \n\nCittiamo quanti"
    },
    {
        "db_id": "orchestra",
        "q_id": 823,
        "question": "Si vuole calcolare la media dei tempi di percorrenza dei conducenti.\n\n(Translation: Count the number of drivers. We want to calculate the average time of travel for the drivers.)"
    },
    {
        "db_id": "orchestra",
        "q_id": 824,
        "question": "](https://i.stack.imgur.com/gTnG4.png)\n\nTranslation:\nList the names of the hosts in order of increasing age.](https://i.stack.imgur.com/gTnG4.png)\n\nRephrased question in Italian:"
    },
    {
        "db_id": "orchestra",
        "q_id": 825,
        "question": "(What are the names of the conductors, ordered by age?) →\nSono desiderosi di conoscere l'elenco dei conduttori, organizzato in base all'età dei singoli individui. →\nNote"
    },
    {
        "db_id": "orchestra",
        "q_id": 826,
        "question": "Translation: What are the names of the conductors whose nationality is not \"USA\"? \n\nRephrased question: Quali sono le identità dei direttori d'orchestra non appartenenti alla nazionalità statunit"
    },
    {
        "db_id": "orchestra",
        "q_id": 827,
        "question": "Restituisci inoltre i nomi dei conduttori che hanno la nazionalità `` USA ''. \n\n(Restitute the names of the conductors who do not have the nationality ``USA''. Restitute also the names of"
    },
    {
        "db_id": "orchestra",
        "q_id": 828,
        "question": "(Which record labels are the orchestras in descending order in which they were founded?)\"\n\nTranslation:\nQuali sono le etichette discografiche delle orchestre in ordine decrescente di fondazione? (Which record labels are the orchest"
    },
    {
        "db_id": "orchestra",
        "q_id": 829,
        "question": "**\n\nTranslation: \"Return the discography of the orchestras, ordered by the years in which they were founded, descending.\"**\n\nRephrased question in Italian: \"Ritornare la discografia delle orchestre, ordinata in base"
    },
    {
        "db_id": "orchestra",
        "q_id": 830,
        "question": "(What is the average frequency of the shows?) → \n_____________________________________________________________ _______________________________________________________________ _______________________________________________________________ _______________________________________________________________ _______________________________________________________________ _______________________________________________________________ _______________________________________________________________ _______________________________________________________________ _______________________________________________________________ __________________________________________________"
    },
    {
        "db_id": "orchestra",
        "q_id": 831,
        "question": "Quale è la media delle frequenze? \n\nTranslation: Return the average frequency in all shows. What is the average frequency? \n\nRephrased question in Italian:\nIndicare la frequenza media globale dei spettacoli, e"
    },
    {
        "db_id": "orchestra",
        "q_id": 832,
        "question": "È possibile ottenere una lista di spettacoli che non sono `` Live Final '' e che hanno una quota di spettacoli tra la quota massima e minima?\n\nTranslation: \"What is the maximum and minimum quota of"
    },
    {
        "db_id": "orchestra",
        "q_id": 833,
        "question": "In caso di parità, restituisci le azioni massime e minime per spettacoli che hanno il tipo `` in diretta ''. In caso di ulteriore parità, restituisci le azioni massime e min"
    },
    {
        "db_id": "orchestra",
        "q_id": 834,
        "question": "](https://www.stackoverflow.com/questions/6343215/quante-nazionalità-diverse-hanno-i-conduttori)\n\nAnswer: Qual è il numero di nazioni diverse rappresentate dai conduttori?](https://"
    },
    {
        "db_id": "orchestra",
        "q_id": 835,
        "question": "Inoltre, verificare se esistono differenze significative tra i diversi gruppi di nazionalità.\n\nTranslation:\nCount the number of different nationalities of the drivers. Furthermore, verify if there are significant differences between the different"
    },
    {
        "db_id": "orchestra",
        "q_id": 836,
        "question": "Translation: \nList the names of the presenters in descending order of years of work. \n\nRephrased question in Italian: \nElencare i nomi dei conduttori in ordine di decrescita dei loro"
    },
    {
        "db_id": "orchestra",
        "q_id": 837,
        "question": "(What are the names of the conductors, listed in descending order by the number of years they have worked?) \n\nNomi dei conduttori, in ordine di anzianità discendente, quali sono? \n\n(Translation"
    },
    {
        "db_id": "orchestra",
        "q_id": 838,
        "question": "}\n\nTranslation: List the name of the conductor with the most years of work.}  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |"
    },
    {
        "db_id": "orchestra",
        "q_id": 839,
        "question": "(Translation: What is the name of the director who has worked the most years?) \n\nNome del direttore che ha lavorato per il maggior numero di anni. \n\n(Translation: Name of the director who has worked for the most"
    },
    {
        "db_id": "orchestra",
        "q_id": 840,
        "question": "[] Show the names of the conductors and orchestras that have conducted.\n\n**Ripropongo la mia domanda in italiano utilizzando lessico professionale e più alto:**\nElencare gli esecutori direttivi e"
    },
    {
        "db_id": "orchestra",
        "q_id": 841,
        "question": "**\n\nTranslation: Who are the names of the conductors and the corresponding orchestras that have conducted?**\n\n\nAnswer: Quali sono i nomi dei direttori d'orchestra e le relative orchestre che hanno diretto?**"
    },
    {
        "db_id": "orchestra",
        "q_id": 842,
        "question": "Translation: Show the names of conductors who have led more than one orchestra.\n\nRephrased question in Italian:\nElencare gli esecutori direttivi che hanno diretto più di un'orchestra. \n\nPlease"
    },
    {
        "db_id": "orchestra",
        "q_id": 843,
        "question": "(What are the names of the conductors who have led more than one orchestra?) →\nDi quali maestri si può rilevare che hanno diretto più di un'ensemble sinfonico nel corso della loro carriera"
    },
    {
        "db_id": "orchestra",
        "q_id": 844,
        "question": "(Show the name of the conductor who has led the most orchestras.)"
    },
    {
        "db_id": "orchestra",
        "q_id": 845,
        "question": "}\n\nTranslation:\nWho is the name of the conductor who has led the most orchestras?}  |\n|  |  |\n\n### 7.3.2. Rephrasing in Italian\n\nChi è il nome del direttore d'"
    },
    {
        "db_id": "orchestra",
        "q_id": 846,
        "question": "](Translation: Please show the name of the conductor who has led orchestras founded after 2008.)**\n\nIl nome del direttore che ha guidato orchestre fondate dopo il 2008, per favore.](Translation: The"
    },
    {
        "db_id": "orchestra",
        "q_id": 847,
        "question": "}\n\nTranslation: What are the names of the conductors who have led orchestras founded after 2008?}  (Source: [1])\n\nItalian translation: Quali sono i nomi dei direttori d'orchestra che hanno"
    },
    {
        "db_id": "orchestra",
        "q_id": 848,
        "question": "(Show the different record companies and the corresponding number of orchestras.)`\n\n\n\nCase discografiche e numeri di orchestre correlate sono disponibili nel seguente elenco:\n\n(Record companies and corresponding numbers of orchestras are available in the following"
    },
    {
        "db_id": "orchestra",
        "q_id": 849,
        "question": "è importante per me capire la dimensione delle case discografiche e il loro impatto sulla scena musicale.\n\nTranslation:\nHow many orchestras does each record company manage? It is important for me to understand the size of record companies and"
    },
    {
        "db_id": "orchestra",
        "q_id": 850,
        "question": "Potete fornire anche una breve descrizione di cosa sono e come vengono utilizzati?\n\nTranslation: Please show the record formats for orchestras in ascending order of counting. Can you also provide a brief description of what they are and how"
    },
    {
        "db_id": "orchestra",
        "q_id": 851,
        "question": "(Which are the main formats of orchestra records, ordered by their frequency?)\n\nTranslation: I principali formati di registrazioni orchestrali, in ordine di frequenza, quali sono? (What are the main formats of orchestra recordings,"
    },
    {
        "db_id": "orchestra",
        "q_id": 852,
        "question": "E quali sono le caratteristiche che la rendono un'opzione popolare tra le orchestre?"
    },
    {
        "db_id": "orchestra",
        "q_id": 853,
        "question": "(Which record label is used by the most orchestras?)\"\n\nLa casa discografica che utilizza la maggioranza delle orchestre è quale? (Which record label uses the majority of orchestras?)\"\n\nPlease rephrase the following question in"
    },
    {
        "db_id": "orchestra",
        "q_id": 854,
        "question": "È possibile ottenere una lista delle orchestre che non hanno esibizioni programmate?\n\nTranslation: List the names of the orchestras that do not have performances. Is it possible to obtain a list of orchestras that do not have scheduled"
    },
    {
        "db_id": "orchestra",
        "q_id": 855,
        "question": "**\n\nTranslation into Italian:\nQuali sono le orchestre che non presentano alcuna prestazione?**\n\n\n\nAnswer: The correct rephrased question is indeed \"Quali sono le orchestre che non presentano alcuna prestazione?\" which"
    },
    {
        "db_id": "orchestra",
        "q_id": 856,
        "question": "](Italian translation: Mostra le case discografiche condivise da orchestre fondate prima del 2003 e dopo il 2003.)\n\nPlease provide the rephrased question.](Italian translation: Mostra le case discograf"
    },
    {
        "db_id": "orchestra",
        "q_id": 857,
        "question": "Translation:\nWhat are the record labels used by both orchestras founded before 2003 and those founded after 2003? \n\nRephrased question in Italian:\nQuali sono le etichette discografiche utilizzate da ent"
    },
    {
        "db_id": "orchestra",
        "q_id": 858,
        "question": "Inoltre, il numero di orchestre deve essere maggiore di 50.\n\nFind the number of orchestras whose record format is \"cd\" or \"dvd\". Furthermore, the number of orchestras must be greater than 50."
    },
    {
        "db_id": "orchestra",
        "q_id": 859,
        "question": "Translation: Count the number of orchestras that have CDs or DVDs as a recording format. \n\nRephrased question in Italian:\nCalcolare il numero di complessi sinfonici che possiedono pubblicazioni in formato CD"
    },
    {
        "db_id": "orchestra",
        "q_id": 860,
        "question": "Translation: Show the years in which orchestras that have given more than one performance were founded. \n\nRephrased question:\nElencare gli anni di fondazione delle orchestre che hanno eseguito almeno due repliche."
    },
    {
        "db_id": "orchestra",
        "q_id": 861,
        "question": "Translation:\nWhat are the foundation years for orchestras that have had more than one single performance? \n\nRephrased question in Italian:\nQuali sono gli anni di costituzione delle orchestre che hanno eseguito almeno due rapp"
    },
    {
        "db_id": "network_1",
        "q_id": 862,
        "question": "(How many high schools are there?)\n\nRisposta in italiano:\nQuale è il numero dei licei presenti in questa area?\n\n(Translation: What is the number of high schools present in this area?)"
    },
    {
        "db_id": "network_1",
        "q_id": 863,
        "question": "**\n\nTranslation: Count the number of high schools.\n\nRephrased question: Qual è il numero esatto di istituti secondari superiori presenti nel territorio?**\n\n\n\n**Rephrase the following text in Italian using a professional and"
    },
    {
        "db_id": "network_1",
        "q_id": 864,
        "question": "È possibile avere accesso a questi dati?\n\n**Translation:** Show the names and votes of every high school. Is it possible to have access to these data?\n\nRephrased question:\nÈ possibile ottenere l'elenco dei nom"
    },
    {
        "db_id": "network_1",
        "q_id": 865,
        "question": "(What are the names and votes for each high school?)\n\nDomande a cui non si risponde: (Risposte non disponibili) (Questions that are not answered: (Unavailable responses)) 1. Perché non riesco a"
    },
    {
        "db_id": "network_1",
        "q_id": 866,
        "question": "(Show all the grades of high school.) \n\nTranslation: Mostra tutti i diplomi del liceo. \n\n(Show all the diplomas of high school.) \n\nRephrased question: Elencare tutti i titoli di"
    },
    {
        "db_id": "network_1",
        "q_id": 867,
        "question": "È necessario un voto medio di 8/10 per essere ammesso all'università?\n\nTranslation: What is the vote of each high school? Is it necessary to have a average vote of 8/10 to be admitted"
    },
    {
        "db_id": "network_1",
        "q_id": 868,
        "question": "È un ragazzo molto popolare e molti studenti sono interessati a sapere come ha votato.\n\nTranslation: What is Kyle's vote? He's a very popular boy and many students are interested in knowing how he voted."
    },
    {
        "db_id": "network_1",
        "q_id": 869,
        "question": "Restituisci il voto per il liceo di nome Kyle.\n\nTranslation: Return the vote for Kyle's high school. Return the vote for Kyle's high school. (Note: The translation is not very clear, as the original text is"
    },
    {
        "db_id": "network_1",
        "q_id": 870,
        "question": "00 che esistono in Italia. È possibile ottenere questa informazione attraverso un database o una lista ufficiale? È importante per noi conoscere i nomi di tutti i licei di grado 10.00"
    },
    {
        "db_id": "network_1",
        "q_id": 871,
        "question": "Sono interessato a ricevere la lista dei licei che offrono un corso di studio in \"Ingegneria dell'informazione\".\n\nTranslation: What are the names of all high schools of grade 10? I"
    },
    {
        "db_id": "network_1",
        "q_id": 872,
        "question": "(Show Kyle's high school ID.) \n\nRiportato in italiano: \nMostrare l'identificazione scolastica del liceo di nome Kyle. \n\nNote: \n* \"Mostra\" is a more"
    },
    {
        "db_id": "network_1",
        "q_id": 873,
        "question": "(What is Kyle's ID?)\"\n\nQual è l'identificazione di Kyle? (What is Kyle's identification?)\"\n\nPlease note that the rephrased question maintains the same meaning and purpose as the original question, but uses a more"
    },
    {
        "db_id": "network_1",
        "q_id": 874,
        "question": "(How many high schools are there in grades 9 or 10?) →\n...?  [Italian translation]  [Italian translation]  [Italian translation]\nQuale è il metodo più efficace per gestire i progetti in un"
    },
    {
        "db_id": "network_1",
        "q_id": 875,
        "question": "Sono interessato a conoscere la distribuzione dei liceali tra i due gradi. Potresti fornirmi i dati relativi all'anno scolastico 2020-2021?\n\nNote: The rephr"
    },
    {
        "db_id": "network_1",
        "q_id": 876,
        "question": "Translation:\nShow the number of high school students for each grade. \n\nRephrased question:\nPresenta i dati relativi al numero di studenti liceali per ogni anno di corso. \n\nNote: \"Liceali\""
    },
    {
        "db_id": "network_1",
        "q_id": 877,
        "question": "(How many high schools are there in each grade?)\n\nRipristino della domanda:\n\nQual è il numero di istituti secondari di tipo liceale presenti in ogni ciclo di studio?"
    },
    {
        "db_id": "network_1",
        "q_id": 878,
        "question": "(Which vote has more high school students?)\n\nVoti dei liceali più comuni sono i seguenti: Voto A, Voto B, Voto C e Voto D. Qual è il voto più popolare tra i"
    },
    {
        "db_id": "network_1",
        "q_id": 879,
        "question": "(Return the vote that has the most students from the high school.)\"\n\n\"Restituire il voto che riceve il maggior numero di voti da studenti delle scuole superiori.\""
    },
    {
        "db_id": "network_1",
        "q_id": 880,
        "question": "**Translation:** Show me all the votes that have at least 4 students.\n\nRephrased question in Italian:\nMostrami tutti i voti che conteggiano almeno 4 studenti.**Translation:** Show me all the votes"
    },
    {
        "db_id": "network_1",
        "q_id": 881,
        "question": "(Which students have 4 or more votes?) → ?????\nLe città più grandi del mondo sono quelle che hanno una popolazione di almeno 1 milione di abitanti. (The largest cities in the world are those that"
    },
    {
        "db_id": "network_1",
        "q_id": 882,
        "question": "Se un studente non ha amici, non mostrare nulla. Mostra solo gli studenti con almeno un amico.\n\nTranslation:\nShow the student IDs and the number of friends corresponding to each one. If a student has no friends,"
    },
    {
        "db_id": "network_1",
        "q_id": 883,
        "question": "(How many friends does each student have?) → ???? ?????? ?????? ?????\nTranslation: How many acquaintances does each student have on average? (note: \"amici\" is often translated as \"friends\", but in this context"
    },
    {
        "db_id": "network_1",
        "q_id": 884,
        "question": "Translation: \nShow the names of high school students and their corresponding number of friends. \n\nRephrased question: \nElenca i nomi degli studenti delle scuole superiori, associati ai relativi numeri di"
    },
    {
        "db_id": "network_1",
        "q_id": 885,
        "question": "(What are the names of the high schools and how many friends does each one have?) → _______________________________________\nAuthor: Lorenzo S. (Università di Firenze) - 2022\nTranslation: What are the names of the high schools and"
    },
    {
        "db_id": "network_1",
        "q_id": 886,
        "question": "(What is the name of the high school that has the most friends?) \n\nNome del liceo che detiene il maggior numero di relazioni sociali? \n\n(Note: \"amici\" is a colloquial term that can be"
    },
    {
        "db_id": "network_1",
        "q_id": 887,
        "question": "È possibile identificare tale studente?\n\n(Translation: Return the name of the high school student with the most friends. Is it possible to identify such a student?)...\n\nRestituire il nome dello studente delle scuole superiori"
    },
    {
        "db_id": "network_1",
        "q_id": 888,
        "question": "**Translation: Show the names of the high schools that have at least 3 friends.**\n\nLa lista dei licei che presentano almeno tre amici fra i loro iscritti.**Translation: The list of high schools that have"
    },
    {
        "db_id": "network_1",
        "q_id": 889,
        "question": "(Who are the names of students who have 3 or more friends?)"
    },
    {
        "db_id": "network_1",
        "q_id": 890,
        "question": "È importante che siano tutti gli amici, non solo quelli più stretti. Ci sono circa 150 studenti nel liceo.\n\nTranslation: Show the names of all Kyle's high school friends. It's important that they are"
    },
    {
        "db_id": "network_1",
        "q_id": 891,
        "question": "Potresti fornire anche l'indirizzo e il numero di telefono di ciascuno? Sono necessari per l'organizzazione di un evento.\n\nTranslation: Return the names of Kyle's high school friends. Could you also provide"
    },
    {
        "db_id": "network_1",
        "q_id": 892,
        "question": "**\n\n**Quale è il numero di amici che il liceale Kyle possiede?**\n\n\n\n---\n**Translation:**\n\nHow many friends does student Kyle from high school have?**\n\n**What is the number of friends that high school student"
    },
    {
        "db_id": "network_1",
        "q_id": 893,
        "question": "(Literal translation: Count the number of friends Kyle has.) → ???? ?? ??? ??? ?? ??? ???\n\n(Answer: Contare il numero di amici che Kyle possiede.) → Contare il numero degli amici di Kyle."
    },
    {
        "db_id": "network_1",
        "q_id": 894,
        "question": "](https://i.stack.imgur.com/4yX4T.png)\n\nNota: The original text is in Italian, so I will provide the rephrased question in Italian as well.\n\n\"Presenta l'identificazione di tutti gli"
    },
    {
        "db_id": "network_1",
        "q_id": 895,
        "question": "Translation: Which are the IDs of high school students who do not have friends? \n\nRephrased question: Quali sono i codici identificativi degli studenti delle scuole superiori che non presentano una rete"
    },
    {
        "db_id": "network_1",
        "q_id": 896,
        "question": "(Show the names of all high school students who do not have friends.)\" \"Ecco i nomi di tutti gli studenti delle scuole superiori che non hanno amici:\n1. Luca Bianchi\n2. Maria Rossi"
    },
    {
        "db_id": "network_1",
        "q_id": 897,
        "question": "È importante perché vorremmo contattarli per discutere eventuali problemi di socializzazione.\n\n(Translation: Who are the names of the students who do not have friends? It's important because we would like to contact them to"
    },
    {
        "db_id": "network_1",
        "q_id": 898,
        "question": "Translation:\nShow the IDs of high schools that have friends and are also appreciated by someone else. \n\nRephrased question:\nElencare gli istituti di istruzione secondaria superiori che possiedono una rete di"
    },
    {
        "db_id": "network_1",
        "q_id": 899,
        "question": "} (Which are the IDs of the students who have both friends and are appreciated?) \\\\ \\end{tabular}\n**Italian question:** Quali sono gli identificativi degli studenti che possiedono entrambe le caratteristiche"
    },
    {
        "db_id": "network_1",
        "q_id": 900,
        "question": "(Show the names of all students who have some friends and also for someone else.)\"\n\n\"Elencare gli studenti che presentano una rete sociale caratterizzata da presenza di amici e di connessioni esterne.\" ("
    },
    {
        "db_id": "network_1",
        "q_id": 901,
        "question": "(What are the names of the high schools that have both friends and are liked?)\n\n(Nota: Please keep in mind that the rephrased question should be written in a formal and professional tone, similar to what you would find in a academic"
    },
    {
        "db_id": "network_1",
        "q_id": 902,
        "question": "È possibile creare un rapporto che mostri il numero di Mi piace per ogni ID studente?\n\nTranslation: Count the number of likes for each student ID. Is it possible to create a report that shows the number of likes for each"
    },
    {
        "db_id": "network_1",
        "q_id": 903,
        "question": "(Rough translation: How many likes correspond to each student ID?) \n\nTranslation:\nQual è il numero di likes associato a ogni ID studente? \n\n(Translation: What is the number of likes associated with each student ID?) \n\nPlease note"
    },
    {
        "db_id": "network_1",
        "q_id": 904,
        "question": "?\n\n\nTranslation:\n? (Show the names of the high schools that have Likes and the number of Likes for each one.)"
    },
    {
        "db_id": "network_1",
        "q_id": 905,
        "question": "(Translation: What are the names of the high school students who like me, and how many of them like me?)\"\nTranslation: Quali sono i nomi degli studenti liceali che mi piacciono e quanti di loro mi"
    },
    {
        "db_id": "network_1",
        "q_id": 906,
        "question": "Translation: What is the name of the high school that has the most likes? \n\nRephrased question:\nQual è l'istituto di istruzione superiore che possiede la maggiore quantità di \"Mi"
    },
    {
        "db_id": "network_1",
        "q_id": 907,
        "question": "Chi è l'utente che ha più \"Mi piace\"?\n\nTranslation: Name the student with the most likes. Who is the user with the most \"likes\"?"
    },
    {
        "db_id": "network_1",
        "q_id": 908,
        "question": "Mostra i nomi degli studenti che hanno almeno 2 like."
    },
    {
        "db_id": "network_1",
        "q_id": 909,
        "question": "(Which are the names of students who have 2 or more likes?) →\n_____________________________________________________________________\n\nPlease rephrase the following question in Italian using a professional and higher lexicon. Only provide the rephrased question with no additional text, comments"
    },
    {
        "db_id": "network_1",
        "q_id": 910,
        "question": "**Translation:**Show the names of students who have a score above 5 and have at least 2 friends.\n\n**Rephrased question:**\nElenca gli studenti che hanno conseguito un punteggio superiore a"
    },
    {
        "db_id": "network_1",
        "q_id": 911,
        "question": "Translation:\nWhat are the names of high school students who have a score of over 5 and have 2 or more friends? \n\nRephrased question in Italian:\nQuali sono i nomi degli studenti liceali che hanno"
    },
    {
        "db_id": "network_1",
        "q_id": 912,
        "question": "(How many likes does Kyle have?) →\nLe informazioni sulla popolarità di Kyle sono quantificate in quanti? (How many...) →\nLe informazioni sulla popolarità di Kyle sono quantificate in quanti likes? ("
    },
    {
        "db_id": "network_1",
        "q_id": 913,
        "question": "?\n(Retrieve the number of likes that the high school named Kyle has.)\n\nRisposta: Il numero di Mi piace che il liceo di nome Kyle ha è quantificato in _______?\n\nTranslation: The number of likes that"
    },
    {
        "db_id": "network_1",
        "q_id": 914,
        "question": "È possibile creare un elenco dei nomi degli studenti con il loro grado medio?\n\nTranslation: Find the average grade of all students who have friends. Is it possible to create a list of the names of students with their average grade?"
    },
    {
        "db_id": "network_1",
        "q_id": 915,
        "question": "Translation: What is the average number of friends that students have? \n\nRephrased question:\nQual è il valore medio dell'amicizia per gli studenti? \n\n(Note: The rephrased question maintains the same meaning as the"
    },
    {
        "db_id": "network_1",
        "q_id": 916,
        "question": "In altre parole, qual è il minimo numero di studenti che non hanno alcun amico tra loro? (Find the minimum number of students who have no friends. In other words, what is the minimum number of students who have no friends"
    },
    {
        "db_id": "network_1",
        "q_id": 917,
        "question": "È possibile raggiungere questo livello di isolamento?\n\nTranslation: What is the lowest level of students who have no friends? Is it possible to reach this level of isolation? \n\nRephrased question:\nQual è il più bass"
    },
    {
        "db_id": "dog_kennels",
        "q_id": 918,
        "question": "(Which states have both owners and professionals who live there?)\"\n\nTranslation: \"I quali Stati Uniti d'America hanno sia proprietari che professionisti che risiedono all'interno dei loro confini?\" (Which United States have both"
    },
    {
        "db_id": "dog_kennels",
        "q_id": 919,
        "question": "È necessario includere anche gli stati in cui non ci sono proprietari o professionisti.\n\nTranslation:\nFind the states where both owners and professionals live. It is necessary to include also the states where there are no owners or professionals.\n\nReph"
    },
    {
        "db_id": "dog_kennels",
        "q_id": 920,
        "question": "](https://www.italki.com/questions/425135#answer-425145)\n\n**Translation:** What is the average age of dogs that have undergone treatments?\n\n**Rephrased question:** Qual è la media età dei cani che"
    },
    {
        "db_id": "dog_kennels",
        "q_id": 921,
        "question": "Translation: Find the average age of dogs that have undergone treatments.\n\nRiposta: Qual è l'età media dei cani che hanno ricevuto trattamenti? \n\n(Translation: What is the average age of dogs that have received treatments"
    },
    {
        "db_id": "dog_kennels",
        "q_id": 922,
        "question": "Potresti anche includere la loro specializzazione e la loro città di residenza. È molto importante che la lista sia aggiornata e precisa. Potresti anche fornirmi un link per scaricare la lista in formato CSV"
    },
    {
        "db_id": "dog_kennels",
        "q_id": 923,
        "question": "](https://i.stack.imgur.com/5fG4R.png)\n\nTrova l'identificazione, il cognome e il numero di cellulare dei professionisti che risiedono nello stato dell'Indiana o hanno eseguito"
    },
    {
        "db_id": "dog_kennels",
        "q_id": 924,
        "question": "](https://i.stack.imgur.com/8dX5q.png)\n\nTranslation:\nWhich dogs did not cost their owner more than 1000 for treatment? List the names of the dogs.](https://i.stack.imgur.com/8dX"
    },
    {
        "db_id": "dog_kennels",
        "q_id": 925,
        "question": "(What are the names of the dogs whose owner did not spend more than 1000 for the treatment?) → ???\nSono necessari ulteriori dettagli per comprendere i requisiti del progetto. (What are the necessary"
    },
    {
        "db_id": "dog_kennels",
        "q_id": 926,
        "question": "(What names are used for professionals or owners but are not used as dog names?)\"\n\nSono in cerca di nomi professionali o di proprietari che, sebbene comunemente utilizzati come identificatori, non sono stati ad"
    },
    {
        "db_id": "dog_kennels",
        "q_id": 927,
        "question": "Questi nomi sono spesso utilizzati come nomi di aziende o di marchi.\n\n(Rough translation: Find the names that are used for professionals or owners but are not used as dog names. These names are often used as company"
    },
    {
        "db_id": "dog_kennels",
        "q_id": 928,
        "question": "Which professional did not treat any dogs? List the ID, role, and email of the professional. \n\nRiphrased question:\nQual è il professionista che non ha ricevuto alcun trattamento per cani? Elencare"
    },
    {
        "db_id": "dog_kennels",
        "q_id": 929,
        "question": "(Translation: Give me the ID, role, and email of the professionals who did not perform any treatment on dogs.) \nLa lista dei professionisti che non hanno eseguito alcun trattamento sui cani, con relativa ID,"
    },
    {
        "db_id": "dog_kennels",
        "q_id": 930,
        "question": "]]\n\n\nWhich owner has the largest number of dogs? List the owner ID, name, and surname.]]\n\n\nTranslation:\nQual è l'proprietario che possiede il maggior numero di cani? Elencare l'ID"
    },
    {
        "db_id": "dog_kennels",
        "q_id": 931,
        "question": "(Restitute the owner ID, first name, and surname of the owner who has the most dogs.)\n\nTranslation: \nRestituire l'identificatore del proprietario, il nome e il cognome del proprietario che possiede"
    },
    {
        "db_id": "dog_kennels",
        "q_id": 932,
        "question": "Please note that the translation is for professional and higher lexicon purposes only and may not be suitable for everyday conversation.\nGli specialisti che hanno effettuato almeno due trattamenti sono stati identificati. Quali sono i professionisti"
    },
    {
        "db_id": "dog_kennels",
        "q_id": 933,
        "question": "](https://i.stack.imgur.com/5s3ZC.png)\n\nTranslation:\nWhich are the ID, role, and name of the professionals who have performed two or more treatments?](https://i.stack.imgur.com/5s3ZC"
    },
    {
        "db_id": "dog_kennels",
        "q_id": 934,
        "question": "Translation: What is the name of the breed with the largest number of dogs? \n\nRephrased question: Qual è il nome della razza canina che presenta la maggiore estensione numerica? \n\nNote: The word"
    },
    {
        "db_id": "dog_kennels",
        "q_id": 935,
        "question": "(Note: The original question is asking which breed has more dogs, and the speaker wants to know the name of that breed.)  |\n\n Italian translation:\n\nQuale specie canina presenta un maggior numero di esemplari?Mi potrest"
    },
    {
        "db_id": "dog_kennels",
        "q_id": 936,
        "question": "|\n\nWhich owner paid the most for treatments on their dogs? List the owner's ID and surname. |\n\nHere is the rephrased question in Italian:\n\nQual è il proprietario che ha effettuato il maggior numero di pagamenti"
    },
    {
        "db_id": "dog_kennels",
        "q_id": 937,
        "question": "(Tell me the ID of the owner and the owner's surname who has spent the most on treatments for his dogs.)\" \n\nID proprietario e cognome del proprietario che ha registrato il maggior importo di spese per i tratt"
    },
    {
        "db_id": "dog_kennels",
        "q_id": 938,
        "question": "»\n\n(Reword the question to ask what is the description of the type of treatment that costs the least amount of money in total?) \n\nTranslation: Qual è la descrizione del tipo di trattamento che presenta il costo più basso in totale"
    },
    {
        "db_id": "dog_kennels",
        "q_id": 939,
        "question": "(Note: The original question is asking for the description of the treatment with the lowest total cost.) \n\nTranslation:\nRichiedi la descrizione del trattamento il cui costo totale è il più basso. \n\n(Note: I've maintained the"
    },
    {
        "db_id": "dog_kennels",
        "q_id": 940,
        "question": "**Translation:**Who has paid the largest total amount of money for their dogs? Show the owner ID and postal code.\n\nRephrased question in Italian:\n\nQual è il proprietario che ha effettuato la più elevata somma di"
    },
    {
        "db_id": "dog_kennels",
        "q_id": 941,
        "question": "(Find the owner's ID and the postal code of the owner who has spent the most money in total for their dogs.)\" \n\nTrova l'identificativo del proprietario e il codice di avviamento del proprietario che ha"
    },
    {
        "db_id": "dog_kennels",
        "q_id": 942,
        "question": "[What professionals have performed at least two types of treatments? List the professional ID and the cellphone number.]\n\n\n\nTranslation:\nQuali professionisti hanno effettuato almeno due tipi di trattamenti? Elencare l'ID professionale"
    },
    {
        "db_id": "dog_kennels",
        "q_id": 943,
        "question": "È importante avere questi dati per contattare i professionisti per chiedere informazioni o richiedere ulteriore assistenza.\n\nFind the ID and cell phone number of professionals who manage two or more types of treatments. It is important"
    },
    {
        "db_id": "dog_kennels",
        "q_id": 944,
        "question": "**\n\nTranslation: What are the names and surnames of the professionals who have performed treatments at a cost lower than the average?**\n\n\nName and Surname of Professionals with Treatment Costs Below the Average**\n\nWhich professionals, with their respective names and s"
    },
    {
        "db_id": "dog_kennels",
        "q_id": 945,
        "question": "(Who are the professionals who managed a treatment that costs less than the average? Give me two names and surnames.)**\n\nTranslation:\nQuali professionisti hanno gestito un trattamento con un costo inferiore alla media? Ci potresti"
    },
    {
        "db_id": "dog_kennels",
        "q_id": 946,
        "question": "Si prega di includere anche la data di fine trattamento e il nome del professionista che lo ha chiuso. È necessario che la lista sia completa e precisa. È richiesto che la lista sia compilata in"
    },
    {
        "db_id": "dog_kennels",
        "q_id": 947,
        "question": "[What is the date and name of the operational professional for each treatment?]\n\nDomanda: Quali sono le informazioni relative alla data e all'identità del professionista operativo coinvolto in ogni trattamento, necessarie per garant"
    },
    {
        "db_id": "dog_kennels",
        "q_id": 948,
        "question": "È anche necessario specificare se il trattamento è personalizzato o standard. È richiesto un elenco dettagliato dei costi e delle descrizioni dei trattamenti.\n\nTranslation:\n(Rephrase the following question in Italian"
    },
    {
        "db_id": "dog_kennels",
        "q_id": 949,
        "question": "Translation: What are the descriptions of the type of cost and treatment for each treatment? \n\nRephrased question:\nQuali sono le caratteristiche di costo e di gestione per ciascun trattamento, rispettivamente"
    },
    {
        "db_id": "dog_kennels",
        "q_id": 950,
        "question": "(List the name, surname and dimensions of each dog owner for their dog.) \n\nTranslation:\nElencare il nome, il cognome e le dimensioni di ciascun proprietario per il proprio cane. \n\nNote: \"Elen"
    },
    {
        "db_id": "dog_kennels",
        "q_id": 951,
        "question": "(What is the name, surname and size of their dog?) \nNota: Non utilizzare frasi informali o colloquiali. \n\nIl nome, il cognome e le dimensioni del loro cane sono quali? \n\n(Sorry, I"
    },
    {
        "db_id": "dog_kennels",
        "q_id": 952,
        "question": "?\n\nTranslation: List the couples of the owner's name and the name of the dogs.\n\nRephrased question in Italian:\nElencare le coppie composte dai nomi dei proprietari e dalle denominazioni dei cani."
    },
    {
        "db_id": "dog_kennels",
        "q_id": 953,
        "question": "Translation: What is the name of each owner and the name of their dogs? \n\nRephrased question: Quali sono i nomi dei proprietari e dei loro animali domestici? \n\n(Translation: What are the names of"
    },
    {
        "db_id": "dog_kennels",
        "q_id": 954,
        "question": "[List the names of the rarest dog breeds and the dates of treatment.] – Translation: List the names of the rarest dog breeds and the dates of treatment.\n\nEcco i nomi dei cani della razza più rara e le"
    },
    {
        "db_id": "dog_kennels",
        "q_id": 955,
        "question": "Translation: Which dogs are of the rarest breed? Show their names and treatment dates.\n\nRephrased question in Italian:\nQuali specie canine appartenenti a razze estremamente rare sono state oggetto di trattamento?"
    },
    {
        "db_id": "dog_kennels",
        "q_id": 956,
        "question": "(Which dogs are owned by someone who lives in Virginia? List the name of the owner and the name of the dog.)\" |\n\n|  |\n---|---|---\n\n|  |\n---|---\n\n|  |\n---|---\n\n|  |"
    },
    {
        "db_id": "dog_kennels",
        "q_id": 957,
        "question": "**\n\nTranslation: Find the names of the owners who live in Virginia and the names of the dogs they own.**\n\nRephrased question in Italian:\nRiconoscere gli identificativi dei proprietari residenti in Virginia e gli ident"
    },
    {
        "db_id": "dog_kennels",
        "q_id": 958,
        "question": "}\n\nTranslation: What are the arrival date and departure date of the dogs that have undergone treatment?\n\nRephrased question in Italian:\nQuali sono le date di arrivo e di partenza dei cani che hanno beneficiato di un trattamento"
    },
    {
        "db_id": "dog_kennels",
        "q_id": 959,
        "question": "](https://i.stack.imgur.com/7s7F5.png)\n\nTrova la data di arrivo e la data di partenza dei cani che hanno beneficiato di un trattamento veterinario.](https://i.stack.imgur.com/"
    },
    {
        "db_id": "dog_kennels",
        "q_id": 960,
        "question": "Translation: List the surname of the owner who owns the youngest dog. \n\nRephrased question in Italian:\nElencare il cognome del proprietario che detiene il cane più immaturo. \n\nTranslation: List the surname of"
    },
    {
        "db_id": "dog_kennels",
        "q_id": 961,
        "question": "(Who has the youngest dog? Give me his last name.) -> ? -> ? -> ? -> ? -> ? -> ? -> ? -> ? -> ? -> ? -> ? -> ? -> ? -> ? -> ? -> ? -> ? -> ? ->"
    },
    {
        "db_id": "dog_kennels",
        "q_id": 962,
        "question": "Per favore, includere anche le informazioni relative alle loro specializzazioni e ai loro luoghi di lavoro.\n\nTranslation: List the e-mails of professionals living in the state of Hawaii or the state of Wisconsin. Please include information about their"
    },
    {
        "db_id": "dog_kennels",
        "q_id": 963,
        "question": "Answer:\n\nQuali sono le e-mail dei professionisti residenti negli stati americani di Hawaii e Wisconsin?  [1]  [2] [3] [4] [5] [6] [7] [8]"
    },
    {
        "db_id": "dog_kennels",
        "q_id": 964,
        "question": "Translation: What is the arrival date and departure date of all the dogs? \n\nRephrased question in Italian:\nQuali sono le date di arrivo e di partenza di tutti i cani? \n\nNote: The rephr"
    },
    {
        "db_id": "dog_kennels",
        "q_id": 965,
        "question": "(Original question) → _______________________________________________________\n(Translation: List the arrival date and departure date for all dogs.) → _______________________________________________________\n\n\nSolutions:\nElencare le date di arrivo e le date di partenza per tutti i cani"
    },
    {
        "db_id": "dog_kennels",
        "q_id": 966,
        "question": "(How many dogs have undergone treatments?)\"\n\n\"Quale è il numero di cani che hanno ricevuto trattamenti?\"\"\n\n---\n\nTranslation:\n\n\"What is the number of dogs that have received treatments?\"\"\n\n---\n\nNote: The rephrased"
    },
    {
        "db_id": "dog_kennels",
        "q_id": 967,
        "question": "(Count the number of dogs that have undergone treatment.) →\nContare il numero di cani che hanno ricevuto un trattamento. (Count the number of dogs that have received treatment.) →\nNota: La traduzione è stata eff"
    },
    {
        "db_id": "dog_kennels",
        "q_id": 968,
        "question": "Translation: How many professionals have treated dogs?\n\nRephrased question in Italian: Quale è il numero di esperti che hanno prestato servizi di trattamento per cani? \n\nNote: I translated \"professionisti\" to \""
    },
    {
        "db_id": "dog_kennels",
        "q_id": 969,
        "question": "(Find the number of professionals who have ever treated dogs.)\"\n\n\"Rilevare il numero di operatori sanitari che hanno avuto esperienze di cura nei confronti di cani.\" \n\n(Translation: Identify the number of"
    },
    {
        "db_id": "dog_kennels",
        "q_id": 970,
        "question": "(Sorry for the missing spaces, it's a direct copy-paste from the original text) \n\nQuali professionisti vivono in città che contengono la sottostringa \"West\", elencando il loro ruolo, strada"
    },
    {
        "db_id": "dog_kennels",
        "q_id": 971,
        "question": "Trova anche il numero di telefono e l'indirizzo email di questi professionisti.\n\nTranslation: Find the role, street, city, and state of professionals living in a city that contains the substring \"West\". Find also the phone number and email"
    },
    {
        "db_id": "dog_kennels",
        "q_id": 972,
        "question": "](https://i.stack.imgur.com/5n8VW.png)\n\nQuali proprietari di proprietà immobiliari vivono nello Stato il cui nome contiene la sottostringa \"North\"? Ecco la lista dei propriet"
    },
    {
        "db_id": "dog_kennels",
        "q_id": 973,
        "question": "Quindi, elenca gli stati che contengono la sottostringa \"North\" e il numero di proprietari che vivono in ciascuno di essi.\nTranslation:\nRephrase the following question in Italian using a professional and"
    },
    {
        "db_id": "dog_kennels",
        "q_id": 974,
        "question": "(How many dogs have an age below the average?)\n\nTranslation: Quale è il numero di cani che hanno un'età inferiore alla media? (What is the number of dogs that have an age below the average?)"
    },
    {
        "db_id": "dog_kennels",
        "q_id": 975,
        "question": "(Count the number of dogs under the average age.) →\nRilevare il numero di cani aventi un'età inferiore alla media dell'età media dei cani del nostro allevamento. (Count the number of dogs with"
    },
    {
        "db_id": "dog_kennels",
        "q_id": 976,
        "question": "What is the cost of the latest treatment?  (Rephrased in Italian: Qual è il prezzo del trattamento più recente?) \n\nWhat is the cost of the most recent treatment?  (Rephrased in Italian"
    },
    {
        "db_id": "dog_kennels",
        "q_id": 977,
        "question": "](https://i.stack.imgur.com/3R9nJ.png)\n\nTranslation:\nShow me the cost of the most recent treatment performed.\n\nRephrased question:\nPotrei avere accesso al costo del trattamento più recentemente eseguito"
    },
    {
        "db_id": "dog_kennels",
        "q_id": 978,
        "question": "(How many dogs have not undergone any treatment?) [1]\n\nQuale è il numero dei cani che non hanno ricevuto alcun tipo di trattamento? [1]\n\nReferences:\n\n[1] Translation from English to Italian: \"How"
    },
    {
        "db_id": "dog_kennels",
        "q_id": 979,
        "question": "In altre parole, quali sono i cani che non hanno ricevuto alcun tipo di attenzione veterinaria?\n\nTranslation: Tell me the number of dogs that have not received any treatment. In other words, which dogs have not received any"
    },
    {
        "db_id": "dog_kennels",
        "q_id": 980,
        "question": "}\n\nTranslation: How many temporary owners do not have dogs?} \\\\ \\hline\nChi sono i clienti che non hanno mai acquistato un prodotto da noi?}\n\nTranslation: Who are the customers who have never purchased a product from"
    },
    {
        "db_id": "dog_kennels",
        "q_id": 981,
        "question": "Si riferisce ai proprietari che non hanno mai avuto un cane o che hanno avuto un cane ma non lo hanno più.\n\nTranslation:\n(Individua il numero di proprietari che, in questo momento, non possiedono can"
    },
    {
        "db_id": "dog_kennels",
        "q_id": 982,
        "question": "]\nTranslation: How many professionals have not treated any dogs?]\n\nRephrased question:\nQual è il numero di professionisti che non hanno mai applicato alcun trattamento a cani?]"
    },
    {
        "db_id": "dog_kennels",
        "q_id": 983,
        "question": "**\n\nTranslation: Find the number of professionals who have not treated any dogs.**\n\nRephrased question in Italian:\n\nDeterminare il numero di esperti professionisti che non hanno mai avuto contatti con cani.**\n\n\n**Citation"
    },
    {
        "db_id": "dog_kennels",
        "q_id": 984,
        "question": "Translation: List the name of the dog, its age and weight of the dogs that have been abandoned? 1 stands for yes and 0 stands for no. \nRephrased question in Italian:\nElencare i nomi dei"
    },
    {
        "db_id": "dog_kennels",
        "q_id": 985,
        "question": "(What are the names, ages, and weights of the dogs that have been abandoned? Note that 1 means yes and 0 means no in the tables.)\" \n\nQuali sono i nomi, le età e i pesi dei"
    },
    {
        "db_id": "dog_kennels",
        "q_id": 986,
        "question": "(What is the average age of all dogs?) → ???? ?????? ?????? ?????? ???? ?? ?????? ???? ?????? ???? ?????? ?????? ?????? ?????? ?????? ?????? ?????? ?????? ?????? ??????"
    },
    {
        "db_id": "dog_kennels",
        "q_id": 987,
        "question": "(Calculate the average age of all dogs.) → ???? ?????? ?????? ?????? ??????\n\nTranslation: Calculate the average age of all dogs.\n\nRephrased question in Italian: Determinare l'età media dei cani presenti in"
    },
    {
        "db_id": "dog_kennels",
        "q_id": 988,
        "question": "è noto che i cani sono stati domesticati per la prima volta intorno al 15.000 anni fa, ma non è chiaro se questo è il cane più antico esistito. Qual è l'età del cane più"
    },
    {
        "db_id": "dog_kennels",
        "q_id": 989,
        "question": "(Tell me the age of the oldest dog.)\""
    },
    {
        "db_id": "dog_kennels",
        "q_id": 990,
        "question": "Per favore, fornire una lista dettagliata dei costi associati a ogni tipo di addebito.\n\nRephrased question:\nQual è il costo specifico di ogni tipo di addebito, comprensivo di el"
    },
    {
        "db_id": "dog_kennels",
        "q_id": 991,
        "question": "(List every type of charge and its amount.)\" \n\nTranslation: \"Elencare ogni tipo di addebito e il suo importo.\"\n\nItalian rephrased question: \"Elencare tutti i tipi di addebito e"
    },
    {
        "db_id": "dog_kennels",
        "q_id": 992,
        "question": "Translation: How much does the most expensive type of charge cost? \n\nRephrased question in Italian: Qual è il costo più elevato del tipo di addebito più oneroso?  ]]> <![CDATA[Rephrase the"
    },
    {
        "db_id": "dog_kennels",
        "q_id": 993,
        "question": "(What is the amount of the most expensive type of charge?)\"\n\nLa quantità più elevata di addebito del tipo di addebito più oneroso è quale? (What is the highest amount of the most expensive type of charge"
    },
    {
        "db_id": "dog_kennels",
        "q_id": 994,
        "question": "Perché ciò è necessario?\n\nTranslation in English:\nList the email, cell phone, and home phone of all professionals. Why is this necessary?"
    },
    {
        "db_id": "dog_kennels",
        "q_id": 995,
        "question": "Translation: What are the email, mobile phone, and home phone of every professional? \n\nRephrased question: Quali sono i contatti di rete e di comunicazione di ogni professionista, compresi l'indirizzo e"
    },
    {
        "db_id": "dog_kennels",
        "q_id": 996,
        "question": "(What are all the possible combinations of breed type and size type?)\n\nRazze canine e relative dimensioni: quali sono tutte le possibili combinazioni tra razze canine e dimensioni, tra cui anche le rare e meno comuni? ("
    },
    {
        "db_id": "dog_kennels",
        "q_id": 997,
        "question": "Ci sono diverse opzioni per il tipo di razza e diverse opzioni per il tipo di dimensione. Come posso trovare le combinazioni più popolari tra tutti i cani?](https://www.google.com/search?q=cani"
    },
    {
        "db_id": "dog_kennels",
        "q_id": 998,
        "question": "Inoltre, elenca i vantaggi e i costi del trattamento.\n\nTranslation:\nList the names of all professionals along with a description of the treatment they performed. Additionally, list the benefits and costs of the treatment."
    },
    {
        "db_id": "dog_kennels",
        "q_id": 999,
        "question": "](https://www.treccani.it/vocabolario/chiave/chiave-inglese/whatis-the-name-and-description-of-each-professional-involved-in-the-treatment-they-performed/)\n\nNota: La ris"
    },
    {
        "db_id": "singer",
        "q_id": 1000,
        "question": "(How many singers are there?) →\n---\n\n---\n\n---\n\n---\n\n---\n\n---\n\n---\n\n---\n\n---\n\n---\n\n---\n\n---\n\n---\n\n---\n\n---\n\n---\n\n---\n\n---\n\n---\n\n---\n\n---\n\n---\n\n---\n\n---\n\n---\n\n---\n\n---\n\n---\n\n---\n\n---\n\n---\n\n---\n\n---\n\n---\n\n---\n\n---\n\n---\n\n---\n\n---\n\n---\n\n---"
    },
    {
        "db_id": "singer",
        "q_id": 1001,
        "question": "(Translation: What is the count of singers?) \n\nAnswer:\nQual è il numero esatto dei cantanti? \n\n(Translation: What is the exact number of singers?)  |  |  |  |  |  |  |"
    },
    {
        "db_id": "singer",
        "q_id": 1002,
        "question": "**\n\nTranslation: List the names of the singers in ascending order of their net worth.\n\nRephrased question in Italian:\n\nElencare i nomi dei cantanti in ordine di crescita del patrimonio netto.**  ("
    },
    {
        "db_id": "singer",
        "q_id": 1003,
        "question": "(Which are the names of the singers ordered by ascending net worth?)\"\n\nTranslation:\nQuali sono le denominazioni dei cantanti ordinati in base al patrimonio netto ascendente? (Which are the designations of the singers ordered by"
    },
    {
        "db_id": "singer",
        "q_id": 1004,
        "question": "Translation: What are the birth year and nationality of the singers?\n\n\nRephrased question in Italian:\nQuali sono gli anni di nascita e le nazionalità dei cantanti?"
    },
    {
        "db_id": "singer",
        "q_id": 1005,
        "question": "(What are the birth years and citizenship of the singers?) [1]\n1. What are the birth years and citizenship of the singers?\n\nRephrased question:\nQuali sono gli anni di nascita e la nazionalità dei cant"
    },
    {
        "db_id": "singer",
        "q_id": 1006,
        "question": "Per favore, elenca solo i cantanti femminili.\n\nTranslation: List the names of singers whose citizenship is not \"France\". Please list only female singers."
    },
    {
        "db_id": "singer",
        "q_id": 1007,
        "question": "}\n\nTranslation: Which are the names of the singers who are not French citizens?} \n\n(Note: Please rephrase the question using formal language, avoiding informal expressions and colloquialisms.) \n\nAnswer: Quali sono i nomi dei cantanti"
    },
    {
        "db_id": "singer",
        "q_id": 1008,
        "question": "**\n\nTranslation: Show the names of singers whose birth year is 1948 or 1949?**\n\n\n\n**Rephrased question:**\n\nElenca gli artisti musicali di sesso maschile e femminile nati nel"
    },
    {
        "db_id": "singer",
        "q_id": 1009,
        "question": "(Who are the names of the singers whose birth years are 1948 or 1949?) →\nQuali sono i nomi dei cantanti che hanno visto la luce nel biennio 1948-1949? (Who"
    },
    {
        "db_id": "singer",
        "q_id": 1010,
        "question": "Translation: What is the name of the singer with the largest net worth? \n\nRephrased question:\nQual è il nome del musicista con il più elevato patrimonio netto? \n\n(No additional text, comments, or"
    },
    {
        "db_id": "singer",
        "q_id": 1011,
        "question": "(What is the name of the singer who is worth the most?)\n\nRisposta: Chi è il cantante più ricco del mondo?\n\nTranslation: Who is the richest singer in the world?"
    },
    {
        "db_id": "singer",
        "q_id": 1012,
        "question": ": How do we ensure that the translation is accurate and free from errors?\n1014. Translation error: How do we ensure that the translation is accurate, clear, and free from errors?\n1015. Translation error: How do we ensure that the"
    },
    {
        "db_id": "singer",
        "q_id": 1013,
        "question": "(How many singers are there from each country for every citizenship?)\"\n\nTranslation:\nPer ogni cittadinanza, quanti artisti musicali provenienti da quel paese sono noti a livello internazionale? (How many internationally renowned"
    },
    {
        "db_id": "singer",
        "q_id": 1014,
        "question": "Qual è la maggioranza dei cantanti che hanno la cittadinanza italiana?\n\nPlease rephrase the question in Italian using a professional and higher lexicon. Only provide the rephrased question with no additional text, comments, or notes:"
    },
    {
        "db_id": "singer",
        "q_id": 1015,
        "question": "(What is the nationality of the most common singer?)\"\n\nLa nazionalità del cantante più popolare è oggetto di studio e analisi per comprendere meglio le tendenze e le preferenze dei consumatori musicali. Qual è"
    },
    {
        "db_id": "singer",
        "q_id": 1016,
        "question": "Qual è il rapporto tra il patrimonio netto massimo e il numero di cantanti per ogni città? (Show different citizens and the maximum net worth of singers from each citizenship. What is the relationship between the maximum net worth and the"
    },
    {
        "db_id": "singer",
        "q_id": 1017,
        "question": "](https://i.stack.imgur.com/6QJxw.png)\n\nTranslation:\nWhat is the maximum net worth for every citizenship?\n\nRephrased question:\nQual è il limite di patrimonio netto massimo previsto per ogni tipo"
    },
    {
        "db_id": "singer",
        "q_id": 1018,
        "question": "Per ogni titolo di canzone e nome di cantante, fornisce informazioni sulla durata e sul genere musicale. Inoltre, indica se il brano è stato pubblicato come singolo o come parte di un"
    },
    {
        "db_id": "singer",
        "q_id": 1019,
        "question": "(Which are the song titles and the names of the singers?) \nTitoli delle canzoni e nomi dei cantanti quali sono? \n\nNote: The rephrased question is a direct translation of the original question, but with a"
    },
    {
        "db_id": "singer",
        "q_id": 1020,
        "question": "000 copie.?\n(Show distinct names of singers who have songs with sales over 300,000,000 copies.) \n\nNomi distinti di interpreti che hanno raggiunto il traguardo delle 300 milioni di copie"
    },
    {
        "db_id": "singer",
        "q_id": 1021,
        "question": "(Which are the different names of singers who have sold more than 300,000?)\n\nNota: The rephrased question should be written in a formal and professional tone, using a higher lexicon. It should also be grammatically correct and"
    },
    {
        "db_id": "singer",
        "q_id": 1022,
        "question": "Mostra anche i titoli delle canzoni e il loro anno di pubblicazione.\n\n(Translation: Show the names of singers who have more than one song. Show also the titles of the songs and their year of publication.)"
    },
    {
        "db_id": "singer",
        "q_id": 1023,
        "question": "(What are the names of the singers who have more than one song?)**\n**I nomi dei cantanti che hanno una discografia pluriscritta?**\n**Translation:**\nWhat are the names of the singers with a multi-authored disc"
    },
    {
        "db_id": "singer",
        "q_id": 1024,
        "question": "Sono interessato a vedere come le vendite variano in base al genere musicale e al tipo di album.\n\nTranslation:\nShow the names of the singers and the total sales of their songs. I am interested in seeing how sales vary based"
    },
    {
        "db_id": "singer",
        "q_id": 1025,
        "question": "(What are the total sales for each singer's songs?)**\n\nLa domanda è: Quali sono le vendite totali relative a ogni artista musicale?**\n\n\n**Rephrase the following question in Italian using a professional and higher lex"
    },
    {
        "db_id": "singer",
        "q_id": 1026,
        "question": "in a software application\n\nRephrase the following question in Italian using a professional and higher lexicon. Only provide the rephrased question with no additional text, comments, or notes:\n1028. How do I translate a software application from English"
    },
    {
        "db_id": "singer",
        "q_id": 1027,
        "question": "(What is the name of every song that has no song?)\"\n\nRisposta: \"Qual è la denominazione di ogni brano musicale che non presenta alcun brano correlato?\"\n\n\nFinal Answer: The final answer is \"Qual"
    },
    {
        "db_id": "singer",
        "q_id": 1028,
        "question": "}\nTranslation: Show the shared citizenship of singers with birth year before 1945 and after 1955.\n\nRephrased question in Italian:\nRaccomandare gli artisti musicali che condividono la cittadinanza con l'"
    },
    {
        "db_id": "singer",
        "q_id": 1029,
        "question": "Translation: Which citizens are shared by singers born before 1945 and after 1955? \n\nRephrased question in Italian: \nCui sono le città che condividono cittadinanza con artisti nati prima del"
    },
    {
        "db_id": "real_estate_properties",
        "q_id": 1030,
        "question": "(Translation: How many functionalities are available in total?) \nQuale è il numero complessivo delle funzionalità a nostra disposizione? \n\n(Translation: What is the total number of functionalities at our disposal?) \nQuante fun"
    },
    {
        "db_id": "real_estate_properties",
        "q_id": 1031,
        "question": "Translated into English: What is the name of the type of Feature Aircon functionality? \nRephrased in Italian: Qual è la denominazione del tipo di funzionalità relativa alla tecnologia Aircon di Feature? \nRe"
    },
    {
        "db_id": "real_estate_properties",
        "q_id": 1032,
        "question": "Mostra anche le proprietà che non sono state ancora impostate.\n\n(Translation: Show the descriptions of the type of property of properties belonging to that code. Show also the properties that have not been set yet.)  |\n\nRephrased question"
    },
    {
        "db_id": "real_estate_properties",
        "q_id": 1033,
        "question": "Translation: What are the names of the properties that are houses or apartments with more than 1 room? \n\nRephrased question:\nQuali sono le denominazioni delle proprietà immobiliari che comprendono abitazioni con più di"
    }
]