[
    {
        "db_id": "concert_singer",
        "question": "Mi puoi dire quanti cantanti abbiamo?",
        "q_id": 0
    },
    {
        "db_id": "concert_singer",
        "question": "Mi puoi dire qual è il numero totale di cantanti?",
        "q_id": 1
    },
    {
        "db_id": "concert_singer",
        "question": "Vorrei chiederti mostra nome, paese, età per tutti i cantanti ordinati per età dal più vecchio al più giovane.",
        "q_id": 2
    },
    {
        "db_id": "concert_singer",
        "question": "Vorrei chiederti quali sono i nomi, i paesi e le età per ogni cantante in ordine di età discendente?",
        "q_id": 3
    },
    {
        "db_id": "concert_singer",
        "question": "Ti posso chiedere qual è l'età media, minima e massima di tutti i cantanti dalla francia?",
        "q_id": 4
    },
    {
        "db_id": "concert_singer",
        "question": "Mi puoi dire qual è l'età media, minima e massima per tutti i cantanti francesi?",
        "q_id": 5
    },
    {
        "db_id": "concert_singer",
        "question": "Vorrei sapere mostra il nome e l'anno di uscita della canzone del cantante più giovane.",
        "q_id": 6
    },
    {
        "db_id": "concert_singer",
        "question": "Vorrei chiederti quali sono i nomi e gli anni di uscita per tutte le canzoni del cantante più giovane?",
        "q_id": 7
    },
    {
        "db_id": "concert_singer",
        "question": "Ti posso chiedere da quali sono tutti i paesi distinti da cui provengono i cantanti di età superiore ai 20 anni?",
        "q_id": 8
    },
    {
        "db_id": "concert_singer",
        "question": "Puoi dirmi quali sono i diversi paesi con cantanti di età superiore ai 20 anni?",
        "q_id": 9
    },
    {
        "db_id": "concert_singer",
        "question": "Puoi dirmi mostra tutti i paesi e il numero di cantanti in ogni paese.",
        "q_id": 10
    },
    {
        "db_id": "concert_singer",
        "question": "Per favore dimmi quanti cantanti sono da ogni paese?",
        "q_id": 11
    },
    {
        "db_id": "concert_singer",
        "question": "Vorrei chiederti elenca tutti i nomi delle canzoni di cantanti al di sopra dell'età media.",
        "q_id": 12
    },
    {
        "db_id": "concert_singer",
        "question": "Vorrei chiederti quali sono tutti i nomi delle canzoni dei cantanti più vecchi della media?",
        "q_id": 13
    },
    {
        "db_id": "concert_singer",
        "question": "Mi puoi dire mostra posizione e nome per tutti gli stadi con una capacità tra 5000 e 10000.",
        "q_id": 14
    },
    {
        "db_id": "concert_singer",
        "question": "Sai quali sono le posizioni e i nomi di tutte le stazioni con capacità tra 5000 e 10000?",
        "q_id": 15
    },
    {
        "db_id": "concert_singer",
        "question": "Sai qual è la capacità massima e la media di tutti gli stadi?",
        "q_id": 16
    },
    {
        "db_id": "concert_singer",
        "question": "Vorrei sapere qual è le capacità medie e massime per tutti gli stadi?",
        "q_id": 17
    },
    {
        "db_id": "concert_singer",
        "question": "Ti posso chiedere qual è il nome e la capacità dello stadio con la più alta frequenza media?",
        "q_id": 18
    },
    {
        "db_id": "concert_singer",
        "question": "Sai qual è il nome e la capacità dello stadio con la più alta frequenza media?",
        "q_id": 19
    },
    {
        "db_id": "concert_singer",
        "question": "Sai quanti concerti ci sono nell'anno 2014 o 2015?",
        "q_id": 20
    },
    {
        "db_id": "concert_singer",
        "question": "Vorrei chiederti quanti concerti si sono verificati nel 2014 o nel 2015?",
        "q_id": 21
    },
    {
        "db_id": "concert_singer",
        "question": "Mi puoi dire mostra il nome dello stadio e il numero di concerti in ogni stadio.",
        "q_id": 22
    },
    {
        "db_id": "concert_singer",
        "question": "Per favore dimmi per ogni stadio, quanti concerti suonano lì?",
        "q_id": 23
    },
    {
        "db_id": "concert_singer",
        "question": "Vorrei chiederti mostra il nome e la capacità dello stadio con la maggior parte dei concerti nell'anno 2014 o dopo.",
        "q_id": 24
    },
    {
        "db_id": "concert_singer",
        "question": "Ti posso chiedere qual è il nome e la capacità dello stadio con il maggior numero di concerti dopo il 2013?",
        "q_id": 25
    },
    {
        "db_id": "concert_singer",
        "question": "Per favore dimmi quale anno ha la maggior parte dei concerti?",
        "q_id": 26
    },
    {
        "db_id": "concert_singer",
        "question": "Sai qual è l'anno che ha avuto il maggior numero di concerti?",
        "q_id": 27
    },
    {
        "db_id": "concert_singer",
        "question": "Ti posso chiedere mostra i nomi dello stadio senza alcun concerto.",
        "q_id": 28
    },
    {
        "db_id": "concert_singer",
        "question": "Puoi dirmi quali sono i nomi degli stadi senza concerti?",
        "q_id": 29
    },
    {
        "db_id": "concert_singer",
        "question": "Vorrei chiederti mostra paesi da cui provengono un cantante di età superiore ai 40 anni e un cantante inferiore a 30.",
        "q_id": 30
    },
    {
        "db_id": "concert_singer",
        "question": "Per favore dimmi mostra nomi per tutti gli stadi ad eccezione degli stadi che hanno un concerto nell'anno 2014.",
        "q_id": 31
    },
    {
        "db_id": "concert_singer",
        "question": "Vorrei sapere quali sono i nomi di tutti gli stadi che non hanno avuto un concerto nel 2014?",
        "q_id": 32
    },
    {
        "db_id": "concert_singer",
        "question": "Vorrei sapere mostra il nome e il tema per tutti i concerti e il numero di cantanti in ogni concerto.",
        "q_id": 33
    },
    {
        "db_id": "concert_singer",
        "question": "Mi puoi dire quali sono i nomi, i temi e il numero di cantanti per ogni concerto?",
        "q_id": 34
    },
    {
        "db_id": "concert_singer",
        "question": "Sai elenca i nomi dei cantanti e il numero di concerti per ogni cantante.",
        "q_id": 35
    },
    {
        "db_id": "concert_singer",
        "question": "Vorrei sapere quali sono i nomi dei cantanti e il numero di concerti per ogni persona?",
        "q_id": 36
    },
    {
        "db_id": "concert_singer",
        "question": "Sai elenca tutti i nomi dei cantanti in concerti nell'anno 2014.",
        "q_id": 37
    },
    {
        "db_id": "concert_singer",
        "question": "Per favore dimmi quali sono i nomi dei cantanti che si sono esibiti in un concerto nel 2014?",
        "q_id": 38
    },
    {
        "db_id": "concert_singer",
        "question": "Per favore dimmi qual è il nome e la nazione del cantante che hanno una canzone con \"ehi\" nel suo nome?",
        "q_id": 39
    },
    {
        "db_id": "concert_singer",
        "question": "Vorrei sapere qual è il nome e il paese di origine di ogni cantante che ha una canzone con la parola \"hey\" nel suo titolo?",
        "q_id": 40
    },
    {
        "db_id": "concert_singer",
        "question": "Per favore dimmi trova il nome e la posizione degli stadi che alcuni concerti si sono verificati negli anni sia del 2014 che del 2015.",
        "q_id": 41
    },
    {
        "db_id": "concert_singer",
        "question": "Puoi dirmi quali sono i nomi e le posizioni degli stadi che hanno avuto concerti che si sono verificati sia nel 2014 che nel 2015?",
        "q_id": 42
    },
    {
        "db_id": "concert_singer",
        "question": "Vorrei sapere trova il numero di concerti è avvenuto nello stadio con la massima capacità.",
        "q_id": 43
    },
    {
        "db_id": "concert_singer",
        "question": "Vorrei sapere quali sono il numero di concerti avvenuti nello stadio con la maggiore capacità?",
        "q_id": 44
    },
    {
        "db_id": "pets_1",
        "question": "Mi puoi dire ​​trova il numero di animali domestici il cui peso è più pesante di 10.",
        "q_id": 45
    },
    {
        "db_id": "pets_1",
        "question": "Sai quanti animali domestici hanno un peso maggiore di 10?",
        "q_id": 46
    },
    {
        "db_id": "pets_1",
        "question": "Mi puoi dire trova il peso del cane più giovane.",
        "q_id": 47
    },
    {
        "db_id": "pets_1",
        "question": "Per favore dimmi quanto pesa il cane più giovane?",
        "q_id": 48
    },
    {
        "db_id": "pets_1",
        "question": "Vorrei chiederti trova il peso massimo per ogni tipo di animale domestico.elenca il peso massimo e il tipo di animale domestico.",
        "q_id": 49
    },
    {
        "db_id": "pets_1",
        "question": "Vorrei sapere elencare il peso massimo e il tipo per ciascun tipo di pet.",
        "q_id": 50
    },
    {
        "db_id": "pets_1",
        "question": "Sai trova il numero di animali domestici di proprietà di studenti di età superiore ai 20 anni.",
        "q_id": 51
    },
    {
        "db_id": "pets_1",
        "question": "Puoi dirmi quanti animali domestici sono di proprietà di studenti che hanno un'età superiore a 20?",
        "q_id": 52
    },
    {
        "db_id": "pets_1",
        "question": "Puoi dirmi trova il numero di animali domestici che sono allevati da studentesse (con sesso f).",
        "q_id": 53
    },
    {
        "db_id": "pets_1",
        "question": "Ti posso chiedere quanti animali domestici sono allevati da studentesse?",
        "q_id": 54
    },
    {
        "db_id": "pets_1",
        "question": "Vorrei sapere trova il numero di tipi distinti di animali domestici.",
        "q_id": 55
    },
    {
        "db_id": "pets_1",
        "question": "Ti posso chiedere quanti diversi tipi di animali domestici ci sono?",
        "q_id": 56
    },
    {
        "db_id": "pets_1",
        "question": "Mi puoi dire trova il nome di studenti che hanno un animale domestico per gatti o cani.",
        "q_id": 57
    },
    {
        "db_id": "pets_1",
        "question": "Puoi dirmi quali sono i primi nomi di ogni studente che ha un gatto o un cane come animale domestico?",
        "q_id": 58
    },
    {
        "db_id": "pets_1",
        "question": "Vorrei sapere trova il nome di studenti che hanno animali domestici sia di gatti che di cane.",
        "q_id": 59
    },
    {
        "db_id": "pets_1",
        "question": "Per favore dimmi quali sono i nomi degli studenti che hanno sia gatti che cani come animali domestici?",
        "q_id": 60
    },
    {
        "db_id": "pets_1",
        "question": "Per favore dimmi trova il maggiore e l'età degli studenti che non hanno un animale domestico.",
        "q_id": 61
    },
    {
        "db_id": "pets_1",
        "question": "Sai quale maggiore è ogni studente che non possiede un gatto come animale domestico, e anche quanti anni hanno?",
        "q_id": 62
    },
    {
        "db_id": "pets_1",
        "question": "Vorrei sapere trova l'id degli studenti che non hanno un animale domestico.",
        "q_id": 63
    },
    {
        "db_id": "pets_1",
        "question": "Ti posso chiedere quali sono gli id degli studenti che non possiedono i gatti come animali domestici?",
        "q_id": 64
    },
    {
        "db_id": "pets_1",
        "question": "Sai trova il nome e l'età degli studenti che hanno un cane ma non hanno un gatto come animale domestico.",
        "q_id": 65
    },
    {
        "db_id": "pets_1",
        "question": "Puoi dirmi qual è il nome di ogni studente che ha un cane ma non ha un gatto?",
        "q_id": 66
    },
    {
        "db_id": "pets_1",
        "question": "Vorrei sapere trova il tipo e il peso dell'animale più giovane.",
        "q_id": 67
    },
    {
        "db_id": "pets_1",
        "question": "Ti posso chiedere che tipo di animale è l'animale più giovane e quanto pesa?",
        "q_id": 68
    },
    {
        "db_id": "pets_1",
        "question": "Ti posso chiedere trova l'id e il peso di tutti gli animali domestici la cui età è più vecchia di 1.",
        "q_id": 69
    },
    {
        "db_id": "pets_1",
        "question": "Sai qual è l'id e il peso di ogni animale domestico che ha più di 1?",
        "q_id": 70
    },
    {
        "db_id": "pets_1",
        "question": "Mi puoi dire trova l'età media e massima per ogni tipo di animale domestico.",
        "q_id": 71
    },
    {
        "db_id": "pets_1",
        "question": "Mi puoi dire qual è l'età media e massima per ogni tipo di animale domestico?",
        "q_id": 72
    },
    {
        "db_id": "pets_1",
        "question": "Vorrei sapere trova il peso medio per ciascun tipo di animale domestico.",
        "q_id": 73
    },
    {
        "db_id": "pets_1",
        "question": "Vorrei chiederti qual è il peso medio per ogni tipo di animale domestico?",
        "q_id": 74
    },
    {
        "db_id": "pets_1",
        "question": "Mi puoi dire trova il nome e l'età degli studenti che hanno un animale domestico.",
        "q_id": 75
    },
    {
        "db_id": "pets_1",
        "question": "Sai quali sono i diversi nomi e età degli studenti che hanno animali domestici?",
        "q_id": 76
    },
    {
        "db_id": "pets_1",
        "question": "Puoi dirmi trova l'id dell'animale di proprietà di student il cui cognome è \"smith\".",
        "q_id": 77
    },
    {
        "db_id": "pets_1",
        "question": "Vorrei chiederti qual è l'id dell'animale di proprietà dello studente il cui cognome è \"smith\"?",
        "q_id": 78
    },
    {
        "db_id": "pets_1",
        "question": "Vorrei sapere trova il numero di animali domestici per ogni studente che ha un documento di identità con animali domestici e studente.",
        "q_id": 79
    },
    {
        "db_id": "pets_1",
        "question": "Per favore dimmi per gli studenti che hanno animali domestici, quanti animali domestici ha ogni studente?elenca i loro id invece di nomi.",
        "q_id": 80
    },
    {
        "db_id": "pets_1",
        "question": "Vorrei chiederti trova il nome e il genere dello studente che hanno più di un animale domestico.",
        "q_id": 81
    },
    {
        "db_id": "pets_1",
        "question": "Puoi dirmi qual è il nome e il genere di tutti gli studenti che hanno più di un animale domestico?",
        "q_id": 82
    },
    {
        "db_id": "pets_1",
        "question": "Ti posso chiedere trova il cognome dello studente che ha un gatto che ha 3 anni.",
        "q_id": 83
    },
    {
        "db_id": "pets_1",
        "question": "Vorrei sapere qual è il cognome dello studente che ha un gatto che ha 3 anni?",
        "q_id": 84
    },
    {
        "db_id": "pets_1",
        "question": "Ti posso chiedere trova l'età media degli studenti che non hanno alcun animale domestico.",
        "q_id": 85
    },
    {
        "db_id": "pets_1",
        "question": "Vorrei chiederti qual è l'età media per tutti gli studenti che non possiedono animali domestici?",
        "q_id": 86
    },
    {
        "db_id": "car_1",
        "question": "Ti posso chiedere quanti continenti ci sono?",
        "q_id": 87
    },
    {
        "db_id": "car_1",
        "question": "Puoi dirmi qual è il numero di continenti?",
        "q_id": 88
    },
    {
        "db_id": "car_1",
        "question": "Ti posso chiedere quanti paesi ha ogni continente?elenca l'id continente, il nome del continente e il numero di paesi.",
        "q_id": 89
    },
    {
        "db_id": "car_1",
        "question": "Vorrei chiederti per ogni continente, elenca il suo id, il nome e quanti paesi ha?",
        "q_id": 90
    },
    {
        "db_id": "car_1",
        "question": "Vorrei chiederti quanti paesi sono elencati?",
        "q_id": 91
    },
    {
        "db_id": "car_1",
        "question": "Vorrei chiederti quanti paesi esistono?",
        "q_id": 92
    },
    {
        "db_id": "car_1",
        "question": "Vorrei chiederti quanti modelli produce ogni produttore di auto?elenco nome completo, id e numero.",
        "q_id": 93
    },
    {
        "db_id": "car_1",
        "question": "Vorrei chiederti qual è il nome completo di ogni produttore di auto, insieme al suo id e a quanti modelli produce?",
        "q_id": 94
    },
    {
        "db_id": "car_1",
        "question": "Ti posso chiedere quale modello dell'auto ha la potenza minima?",
        "q_id": 95
    },
    {
        "db_id": "car_1",
        "question": "Per favore dimmi qual è il modello dell'auto con la più piccola quantità di potenza?",
        "q_id": 96
    },
    {
        "db_id": "car_1",
        "question": "Per favore dimmi trova il modello dell'auto il cui peso è al di sotto del peso medio.",
        "q_id": 97
    },
    {
        "db_id": "car_1",
        "question": "Per favore dimmi qual è il modello per l'auto con un peso inferiore alla media?",
        "q_id": 98
    },
    {
        "db_id": "car_1",
        "question": "Vorrei chiederti trova il nome dei produttori che hanno prodotto alcune auto nell'anno 1970?",
        "q_id": 99
    },
    {
        "db_id": "car_1",
        "question": "Vorrei sapere qual è il nome dei diversi produttori di automobili che hanno prodotto un'auto nel 1970?",
        "q_id": 100
    },
    {
        "db_id": "car_1",
        "question": "Sai trova il tempo di marca e produzione delle auto prodotte nel primo anno?",
        "q_id": 101
    },
    {
        "db_id": "car_1",
        "question": "Ti posso chiedere qual è il produttore del carr prodotto nel primo anno e in che anno è stato?",
        "q_id": 102
    },
    {
        "db_id": "car_1",
        "question": "Ti posso chiedere quali modelli di auto distinte sono prodotti dopo il 1980?",
        "q_id": 103
    },
    {
        "db_id": "car_1",
        "question": "Vorrei chiederti quali sono i diversi modelli per le carte prodotte dopo il 1980?",
        "q_id": 104
    },
    {
        "db_id": "car_1",
        "question": "Ti posso chiedere quanti produttori di automobili ci sono in ogni continente?elenca il nome del continente e il conteggio.",
        "q_id": 105
    },
    {
        "db_id": "car_1",
        "question": "Puoi dirmi qual è il nome di ogni continente e quanti produttori di automobili ci sono in ognuno?",
        "q_id": 106
    },
    {
        "db_id": "car_1",
        "question": "Vorrei chiederti quale dei paesi ha il maggior numero di case automobilistiche?elenca il nome del paese.",
        "q_id": 107
    },
    {
        "db_id": "car_1",
        "question": "Mi puoi dire qual è il nome del paese con la maggior parte dei produttori di automobili?",
        "q_id": 108
    },
    {
        "db_id": "car_1",
        "question": "Sai quanti modelli di auto sono prodotti da ogni produttore?elenca solo il conteggio e il nome completo del produttore.",
        "q_id": 109
    },
    {
        "db_id": "car_1",
        "question": "Vorrei sapere qual è il numero di modelli di auto che sono prodotti da ogni produttore e qual è l'id e il nome completo di ogni produttore?",
        "q_id": 110
    },
    {
        "db_id": "car_1",
        "question": "Ti posso chiedere qual è l'accelerazione dell'auto making amc hornet sportabout (sw)?",
        "q_id": 111
    },
    {
        "db_id": "car_1",
        "question": "Per favore dimmi quanto accelera l'auto che rende amc hornet sportabout (sw)?",
        "q_id": 112
    },
    {
        "db_id": "car_1",
        "question": "Sai quanti produttori di automobili ci sono in francia?",
        "q_id": 113
    },
    {
        "db_id": "car_1",
        "question": "Ti posso chiedere qual è il numero di produttori di cure in francia?",
        "q_id": 114
    },
    {
        "db_id": "car_1",
        "question": "Sai quanti modelli di auto sono prodotti negli stati uniti?",
        "q_id": 115
    },
    {
        "db_id": "car_1",
        "question": "Ti posso chiedere qual è il conteggio dei modelli di auto prodotti negli stati uniti?",
        "q_id": 116
    },
    {
        "db_id": "car_1",
        "question": "Mi puoi dire qual è le miglia medie per gallone (mpg) delle auto con 4 cilindri?",
        "q_id": 117
    },
    {
        "db_id": "car_1",
        "question": "Vorrei chiederti qual è le miglia medie per gallone di tutte le carte con 4 cilindri?",
        "q_id": 118
    },
    {
        "db_id": "car_1",
        "question": "Ti posso chiedere qual è il peso più piccolo dell'auto prodotta con 8 cilindri nel 1974?",
        "q_id": 119
    },
    {
        "db_id": "car_1",
        "question": "Mi puoi dire qual è il peso minimo dell'auto con 8 cilindri prodotti nel 1974?",
        "q_id": 120
    },
    {
        "db_id": "car_1",
        "question": "Ti posso chiedere cosa sono tutti i produttori e i modelli?",
        "q_id": 121
    },
    {
        "db_id": "car_1",
        "question": "Sai cosa sono i produttori e i modelli?",
        "q_id": 122
    },
    {
        "db_id": "car_1",
        "question": "Ti posso chiedere quali sono i paesi che hanno almeno un produttore di automobili?nome elenco e id.",
        "q_id": 123
    },
    {
        "db_id": "car_1",
        "question": "Sai quali sono i nomi e gli id di tutti i paesi con almeno un produttore automobilistico?",
        "q_id": 124
    },
    {
        "db_id": "car_1",
        "question": "Puoi dirmi qual è il numero delle auto con potenza più di 150?",
        "q_id": 125
    },
    {
        "db_id": "car_1",
        "question": "Mi puoi dire qual è il numero di auto con una potenza superiore a 150?",
        "q_id": 126
    },
    {
        "db_id": "car_1",
        "question": "Vorrei chiederti qual è il peso medio delle auto ogni anno?",
        "q_id": 127
    },
    {
        "db_id": "car_1",
        "question": "Vorrei chiederti qual è il peso medio e l'anno per ogni anno?",
        "q_id": 128
    },
    {
        "db_id": "car_1",
        "question": "Mi puoi dire quali paesi in europa hanno almeno 3 case automobilistiche?",
        "q_id": 129
    },
    {
        "db_id": "car_1",
        "question": "Per favore dimmi quali sono i nomi di tutti i paesi europei con almeno 3 produttori?",
        "q_id": 130
    },
    {
        "db_id": "car_1",
        "question": "Sai qual è la potenza massima e la marca dei modelli di auto con 3 cilindri?",
        "q_id": 131
    },
    {
        "db_id": "car_1",
        "question": "Vorrei chiederti qual è la più grande quantità di potenza per i modelli con 3 cilindri e che cosa è?",
        "q_id": 132
    },
    {
        "db_id": "car_1",
        "question": "Puoi dirmi quale modello consente di risparmiare più benzina?vale a dire, avere le miglia massime per gallone.",
        "q_id": 133
    },
    {
        "db_id": "car_1",
        "question": "Puoi dirmi qual è il modello di auto con il mpg più alto?",
        "q_id": 134
    },
    {
        "db_id": "car_1",
        "question": "Per favore dimmi qual è la potenza media delle auto prima del 1980?",
        "q_id": 135
    },
    {
        "db_id": "car_1",
        "question": "Vorrei chiederti qual è la potenza media per tutte le auto prodotte prima del 1980?",
        "q_id": 136
    },
    {
        "db_id": "car_1",
        "question": "Vorrei chiederti qual è l'edispl medio delle auto del modello volvo?",
        "q_id": 137
    },
    {
        "db_id": "car_1",
        "question": "Per favore dimmi qual è l'edispl medio per tutti i volvos?",
        "q_id": 138
    },
    {
        "db_id": "car_1",
        "question": "Sai qual è l'accelerazione massima per il diverso numero di cilindri?",
        "q_id": 139
    },
    {
        "db_id": "car_1",
        "question": "Per favore dimmi qual è l'accelerazione massima per tutti i diversi cilindri?",
        "q_id": 140
    },
    {
        "db_id": "car_1",
        "question": "Vorrei sapere quale modello ha la più versione (make) delle auto?",
        "q_id": 141
    },
    {
        "db_id": "car_1",
        "question": "Vorrei chiederti quale modello ha le versioni più diverse?",
        "q_id": 142
    },
    {
        "db_id": "car_1",
        "question": "Vorrei sapere quante auto hanno più di 4 cilindri?",
        "q_id": 143
    },
    {
        "db_id": "car_1",
        "question": "Vorrei sapere qual è il numero di auto con più di 4 cilindri?",
        "q_id": 144
    },
    {
        "db_id": "car_1",
        "question": "Vorrei chiederti quante auto sono state prodotte nel 1980?",
        "q_id": 145
    },
    {
        "db_id": "car_1",
        "question": "Sai nel 1980, quante auto sono state realizzate?",
        "q_id": 146
    },
    {
        "db_id": "car_1",
        "question": "Vorrei chiederti quanti modelli di auto sono stati prodotti dal produttore con nome completo american motor company?",
        "q_id": 147
    },
    {
        "db_id": "car_1",
        "question": "Ti posso chiedere qual è il numero di modelli di automobili creati dalla compagnia automobilistica americana?",
        "q_id": 148
    },
    {
        "db_id": "car_1",
        "question": "Puoi dirmi quali produttori hanno progettato più di 3 modelli di auto?elenca il nome completo e l'id.",
        "q_id": 149
    },
    {
        "db_id": "car_1",
        "question": "Puoi dirmi quali sono i nomi e gli id di tutti i produttori con più di 3 modelli?",
        "q_id": 150
    },
    {
        "db_id": "car_1",
        "question": "Mi puoi dire quali modelli distintivi sono prodotti dal produttore con il nome completo di motori generali o pesano più di 3500?",
        "q_id": 151
    },
    {
        "db_id": "car_1",
        "question": "Sai quali sono i diversi modelli creati dai motori generali del produttore di automobili o pesavano più di 3500?",
        "q_id": 152
    },
    {
        "db_id": "car_1",
        "question": "Puoi dirmi in quali anni venivano prodotte le auto del peso non meno di 3000 e non più di 4000?",
        "q_id": 153
    },
    {
        "db_id": "car_1",
        "question": "Sai quali sono gli anni diversi in cui c'erano auto prodotte che pesavano meno di 4000 e anche auto che pesavano più di 3000?",
        "q_id": 154
    },
    {
        "db_id": "car_1",
        "question": "Ti posso chiedere qual è la potenza dell'auto con l'accelerazione più grande?",
        "q_id": 155
    },
    {
        "db_id": "car_1",
        "question": "Per favore dimmi qual è la potenza dell'auto con il più grande accelerazione?",
        "q_id": 156
    },
    {
        "db_id": "car_1",
        "question": "Mi puoi dire per il modello volvo, quanti cilindri ha l'auto con il meno accelerato?",
        "q_id": 157
    },
    {
        "db_id": "car_1",
        "question": "Sai per un modello volvo, quanti cilindri ha la versione con meno accelerate?",
        "q_id": 158
    },
    {
        "db_id": "car_1",
        "question": "Sai quante auto hanno un accelerato più grande dell'auto con la più grande potenza?",
        "q_id": 159
    },
    {
        "db_id": "car_1",
        "question": "Puoi dirmi qual è il numero di auto con un accelerato maggiore di quello con più potenza?",
        "q_id": 160
    },
    {
        "db_id": "car_1",
        "question": "Ti posso chiedere quanti paesi hanno più di 2 produttori di automobili?",
        "q_id": 161
    },
    {
        "db_id": "car_1",
        "question": "Puoi dirmi qual è il numero di paesi con più di 2 produttori di auto?",
        "q_id": 162
    },
    {
        "db_id": "car_1",
        "question": "Sai quante auto hanno oltre 6 cilindri?",
        "q_id": 163
    },
    {
        "db_id": "car_1",
        "question": "Per favore dimmi qual è il numero di auto con oltre 6 cilindri?",
        "q_id": 164
    },
    {
        "db_id": "car_1",
        "question": "Vorrei chiederti per le auto con 4 cilindri, quale modello ha la più grande potenza?",
        "q_id": 165
    },
    {
        "db_id": "car_1",
        "question": "Vorrei sapere per tutte le auto a 4 cilindri, quale modello ha più cavalli?",
        "q_id": 166
    },
    {
        "db_id": "car_1",
        "question": "Per favore dimmi tra le auto con potenza più che più bassa, quali non hanno più di 3 cilindri?elenca la macchina per calare e fai il nome.",
        "q_id": 167
    },
    {
        "db_id": "car_1",
        "question": "Per favore dimmi tra le auto che non hanno la potenza minima, quali sono gli id e i nomi di tutti quelli con meno di 4 cilindri?",
        "q_id": 168
    },
    {
        "db_id": "car_1",
        "question": "Vorrei chiederti qual è il massimo miglia per gallone dell'auto con 8 cilindri o prodotti prima del 1980?",
        "q_id": 169
    },
    {
        "db_id": "car_1",
        "question": "Ti posso chiedere qual è il massimo mpg delle auto che avevano 8 cilindri o che furono prodotti prima del 1980?",
        "q_id": 170
    },
    {
        "db_id": "car_1",
        "question": "Vorrei chiederti quali modelli sono più leggeri di 3500 ma non costruiti dalla \"ford motor company\"?",
        "q_id": 171
    },
    {
        "db_id": "car_1",
        "question": "Per favore dimmi quali sono i diversi modelli più leggeri di 3500 ma non sono stati costruiti dalla ford motor company?",
        "q_id": 172
    },
    {
        "db_id": "car_1",
        "question": "Puoi dirmi quali sono il nome dei paesi in cui non esiste un solo produttore di automobili?",
        "q_id": 173
    },
    {
        "db_id": "car_1",
        "question": "Per favore dimmi quali sono i nomi dei paesi senza case automobilistiche?",
        "q_id": 174
    },
    {
        "db_id": "car_1",
        "question": "Ti posso chiedere quali sono i produttori di auto che producono almeno 2 modelli e più di 3 produttori di auto?elenca l'id e il creatore.",
        "q_id": 175
    },
    {
        "db_id": "car_1",
        "question": "Per favore dimmi quali sono gli id e i produttori di tutti i produttori di automobili che producono almeno 2 modelli e producono più di 3 auto?",
        "q_id": 176
    },
    {
        "db_id": "car_1",
        "question": "Vorrei sapere quali sono l'id e i nomi dei paesi che hanno più di 3 produttori di auto o producono il modello \"fiat\"?",
        "q_id": 177
    },
    {
        "db_id": "car_1",
        "question": "Per favore dimmi quali sono gli id e i nomi di tutti i paesi che hanno più di 3 produttori di auto o producono un modello fiat?",
        "q_id": 178
    },
    {
        "db_id": "flight_2",
        "question": "Per favore dimmi a quale paese appartiene la compagnia aerea `` jetblue airways ''?",
        "q_id": 179
    },
    {
        "db_id": "flight_2",
        "question": "Puoi dirmi con quale paese è affiliato jetblue airways?",
        "q_id": 180
    },
    {
        "db_id": "flight_2",
        "question": "Mi puoi dire qual è l'abbreviazione della compagnia aerea `` jetblue airways ''?",
        "q_id": 181
    },
    {
        "db_id": "flight_2",
        "question": "Puoi dirmi quale abbreviazione corrisponde a jetblue airways?",
        "q_id": 182
    },
    {
        "db_id": "flight_2",
        "question": "Per favore dimmi elenca tutti i nomi delle compagnie aeree e le loro abbreviazioni in `` usa ''.",
        "q_id": 183
    },
    {
        "db_id": "flight_2",
        "question": "Vorrei sapere quali sono i nomi delle compagnie aeree e le abbreviazioni per le compagnie aeree negli stati uniti?",
        "q_id": 184
    },
    {
        "db_id": "flight_2",
        "question": "Per favore dimmi elenca il codice dell'aeroporto e il nome nella città di anthony.",
        "q_id": 185
    },
    {
        "db_id": "flight_2",
        "question": "Vorrei sapere dai il codice dell'aeroporto e il nome dell'aeroporto corrispondente alla città anthony.",
        "q_id": 186
    },
    {
        "db_id": "flight_2",
        "question": "Vorrei chiederti quante compagnie aeree abbiamo?",
        "q_id": 187
    },
    {
        "db_id": "flight_2",
        "question": "Mi puoi dire qual è il numero totale di compagnie aeree?",
        "q_id": 188
    },
    {
        "db_id": "flight_2",
        "question": "Per favore dimmi quanti aeroporti abbiamo?",
        "q_id": 189
    },
    {
        "db_id": "flight_2",
        "question": "Per favore dimmi restituisci il numero di aeroporti.",
        "q_id": 190
    },
    {
        "db_id": "flight_2",
        "question": "Puoi dirmi quanti voli abbiamo?",
        "q_id": 191
    },
    {
        "db_id": "flight_2",
        "question": "Puoi dirmi restituisci il numero di voli.",
        "q_id": 192
    },
    {
        "db_id": "flight_2",
        "question": "Sai quale compagnia aerea ha l'abbreviazione \"ual\"?",
        "q_id": 193
    },
    {
        "db_id": "flight_2",
        "question": "Per favore dimmi dai alla compagnia aerea con abbreviazione \"ual\".",
        "q_id": 194
    },
    {
        "db_id": "flight_2",
        "question": "Ti posso chiedere quante compagnie aeree sono dagli stati uniti?",
        "q_id": 195
    },
    {
        "db_id": "flight_2",
        "question": "Sai restituisce il numero di compagnie aeree negli stati uniti.",
        "q_id": 196
    },
    {
        "db_id": "flight_2",
        "question": "Puoi dirmi in quale città e paese è l'aeroporto di alton?",
        "q_id": 197
    },
    {
        "db_id": "flight_2",
        "question": "Vorrei sapere dai la città e il paese per l'aeroporto di alton.",
        "q_id": 198
    },
    {
        "db_id": "flight_2",
        "question": "Puoi dirmi qual è il nome dell'aeroporto per l'aeroporto \"ako\"?",
        "q_id": 199
    },
    {
        "db_id": "flight_2",
        "question": "Puoi dirmi restituisci il nome dell'aeroporto con il codice \"ako\".",
        "q_id": 200
    },
    {
        "db_id": "flight_2",
        "question": "Ti posso chiedere quali sono i nomi degli aeroporti a city \"aberdeen\"?",
        "q_id": 201
    },
    {
        "db_id": "flight_2",
        "question": "Per favore dimmi quali sono i nomi degli aeroporti di aberdeen?",
        "q_id": 202
    },
    {
        "db_id": "flight_2",
        "question": "Mi puoi dire quanti voli partono da \"apg\"?",
        "q_id": 203
    },
    {
        "db_id": "flight_2",
        "question": "Per favore dimmi contare il numero di voli in partenza da \"apg\".",
        "q_id": 204
    },
    {
        "db_id": "flight_2",
        "question": "Vorrei chiederti quanti voli hanno ato di destinazione?",
        "q_id": 205
    },
    {
        "db_id": "flight_2",
        "question": "Per favore dimmi conta il numero di voli in ato.",
        "q_id": 206
    },
    {
        "db_id": "flight_2",
        "question": "Mi puoi dire quanti voli partono da city aberdeen?",
        "q_id": 207
    },
    {
        "db_id": "flight_2",
        "question": "Vorrei chiederti restituisci il numero di voli in partenza da aberdeen.",
        "q_id": 208
    },
    {
        "db_id": "flight_2",
        "question": "Vorrei chiederti quanti voli arrivano a aberdeen city?",
        "q_id": 209
    },
    {
        "db_id": "flight_2",
        "question": "Sai restituisce il numero di voli in arrivo ad aberdeen.",
        "q_id": 210
    },
    {
        "db_id": "flight_2",
        "question": "Vorrei chiederti quanti voli partono dalla città \"aberdeen\" e hai la città di destinazione \"ashley\"?",
        "q_id": 211
    },
    {
        "db_id": "flight_2",
        "question": "Sai quanti voli volano da aberdeen ad ashley?",
        "q_id": 212
    },
    {
        "db_id": "flight_2",
        "question": "Per favore dimmi quanti voli ha la compagnia aerea \"jetblue airways\"?",
        "q_id": 213
    },
    {
        "db_id": "flight_2",
        "question": "Vorrei sapere dai il numero di voli jetblue airways.",
        "q_id": 214
    },
    {
        "db_id": "flight_2",
        "question": "Sai quante voli \"united airlines\" vanno all'aeroporto \"asy\"?",
        "q_id": 215
    },
    {
        "db_id": "flight_2",
        "question": "Vorrei sapere conta il numero di voli della united airlines che arrivano all'aeroporto asy.",
        "q_id": 216
    },
    {
        "db_id": "flight_2",
        "question": "Sai quante voli \"united airlines\" partono dall'aeroporto \"ahd\"?",
        "q_id": 217
    },
    {
        "db_id": "flight_2",
        "question": "Vorrei chiederti restituisci il numero di voli delle united airlines che partono dall'aeroporto ahd.",
        "q_id": 218
    },
    {
        "db_id": "flight_2",
        "question": "Mi puoi dire quanti voli della united airlines vanno in città \"aberdeen\"?",
        "q_id": 219
    },
    {
        "db_id": "flight_2",
        "question": "Per favore dimmi conta il numero di voli della united airlines che arrivano ad aberdeen.",
        "q_id": 220
    },
    {
        "db_id": "flight_2",
        "question": "Puoi dirmi quale città ha la maggior parte dei voli in arrivo?",
        "q_id": 221
    },
    {
        "db_id": "flight_2",
        "question": "Mi puoi dire quale città ha l'aeroporto di destinazione più frequente?",
        "q_id": 222
    },
    {
        "db_id": "flight_2",
        "question": "Sai quale città ha la maggior parte dei voli in partenza?",
        "q_id": 223
    },
    {
        "db_id": "flight_2",
        "question": "Per favore dimmi quale città è l'aeroporto di fonte più frequente?",
        "q_id": 224
    },
    {
        "db_id": "flight_2",
        "question": "Vorrei chiederti qual è il codice dell'aeroporto che ha il maggior numero di voli?",
        "q_id": 225
    },
    {
        "db_id": "flight_2",
        "question": "Ti posso chiedere qual è il codice dell'aeroporto dell'aeroporto con il maggior numero di voli?",
        "q_id": 226
    },
    {
        "db_id": "flight_2",
        "question": "Vorrei sapere qual è il codice dell'aeroporto che ha meno numero di voli?",
        "q_id": 227
    },
    {
        "db_id": "flight_2",
        "question": "Puoi dirmi dai il codice dell'aeroporto con i minimi voli.",
        "q_id": 228
    },
    {
        "db_id": "flight_2",
        "question": "Vorrei chiederti quale compagnia aerea ha la maggior parte dei voli?",
        "q_id": 229
    },
    {
        "db_id": "flight_2",
        "question": "Mi puoi dire quale compagnia aerea serve il maggior numero di voli?",
        "q_id": 230
    },
    {
        "db_id": "flight_2",
        "question": "Sai trova l'abbreviazione e il paese della compagnia aerea che ha meno numero di voli?",
        "q_id": 231
    },
    {
        "db_id": "flight_2",
        "question": "Mi puoi dire qual è l'abbreviazione di airilne ha il minor numero di voli e in che paese si trova?",
        "q_id": 232
    },
    {
        "db_id": "flight_2",
        "question": "Mi puoi dire quali sono le compagnie aeree che hanno un volo in partenza dall'aeroporto \"ahd\"?",
        "q_id": 233
    },
    {
        "db_id": "flight_2",
        "question": "Puoi dirmi quali compagnie aeree hanno un volo con l'aeroporto di origine ahd?",
        "q_id": 234
    },
    {
        "db_id": "flight_2",
        "question": "Per favore dimmi quali sono le compagnie aeree che hanno voli che arrivano all'aeroporto \"ahd\"?",
        "q_id": 235
    },
    {
        "db_id": "flight_2",
        "question": "Ti posso chiedere quali compagnie aeree hanno un volo con l'aeroporto di destinazione ahd?",
        "q_id": 236
    },
    {
        "db_id": "flight_2",
        "question": "Mi puoi dire trova tutte le compagnie aeree che hanno voli da entrambi gli aeroporti \"apg\" e \"cvo\".",
        "q_id": 237
    },
    {
        "db_id": "flight_2",
        "question": "Puoi dirmi quali compagnie aeree hanno voli in partenza dagli aeroporti apg e cvo?",
        "q_id": 238
    },
    {
        "db_id": "flight_2",
        "question": "Puoi dirmi trova tutte le compagnie aeree che hanno voli dall'aeroporto \"cvo\" ma non da \"apg\".",
        "q_id": 239
    },
    {
        "db_id": "flight_2",
        "question": "Vorrei sapere quali compagnie aeree hanno partenza da cvo ma non dagli aeroporti apg?",
        "q_id": 240
    },
    {
        "db_id": "flight_2",
        "question": "Vorrei sapere trova tutte le compagnie aeree che hanno almeno 10 voli.",
        "q_id": 241
    },
    {
        "db_id": "flight_2",
        "question": "Puoi dirmi quali compagnie aeree hanno almeno 10 voli?",
        "q_id": 242
    },
    {
        "db_id": "flight_2",
        "question": "Vorrei chiederti trova tutte le compagnie aeree che hanno meno di 200 voli.",
        "q_id": 243
    },
    {
        "db_id": "flight_2",
        "question": "Per favore dimmi quali compagnie aeree hanno meno di 200 voli?",
        "q_id": 244
    },
    {
        "db_id": "flight_2",
        "question": "Ti posso chiedere quali sono i numeri di volo della compagnia aerea `` united airlines ''?",
        "q_id": 245
    },
    {
        "db_id": "flight_2",
        "question": "Mi puoi dire quali numeri di volo corrispondono ai voli della united airlines?",
        "q_id": 246
    },
    {
        "db_id": "flight_2",
        "question": "Mi puoi dire quali sono i numeri di volo di voli in partenza dall'aeroporto `` apg ''?",
        "q_id": 247
    },
    {
        "db_id": "flight_2",
        "question": "Mi puoi dire dai il numero di voli di voli in partenza da apg.",
        "q_id": 248
    },
    {
        "db_id": "flight_2",
        "question": "Ti posso chiedere quali sono i numeri di volo di voli che arrivano all'aeroporto `` apg ''?",
        "q_id": 249
    },
    {
        "db_id": "flight_2",
        "question": "Ti posso chiedere dai il numero di voli di atterraggio di voli ad apg.",
        "q_id": 250
    },
    {
        "db_id": "flight_2",
        "question": "Vorrei sapere quali sono i numeri di volo di voli in partenza dalla città `` aberdeen ``?",
        "q_id": 251
    },
    {
        "db_id": "flight_2",
        "question": "Sai dai il numero di voli di voli in partenza da aberdeen.",
        "q_id": 252
    },
    {
        "db_id": "flight_2",
        "question": "Puoi dirmi quali sono i numeri di volo di voli che arrivano a city `` aberdeen ''?",
        "q_id": 253
    },
    {
        "db_id": "flight_2",
        "question": "Ti posso chiedere dai il numero di voli di voli in arrivo ad aberdeen.",
        "q_id": 254
    },
    {
        "db_id": "flight_2",
        "question": "Vorrei sapere trova il numero di voli che atterrano nella città di aberdeen o abilene.",
        "q_id": 255
    },
    {
        "db_id": "flight_2",
        "question": "Mi puoi dire quanti voli atterrano ad aberdeen o abilene?",
        "q_id": 256
    },
    {
        "db_id": "flight_2",
        "question": "Puoi dirmi trova il nome di aeroporti che non hanno alcun volo dentro e fuori.",
        "q_id": 257
    },
    {
        "db_id": "flight_2",
        "question": "Ti posso chiedere quali aeroporti non hanno voli in partenza o in arrivo?",
        "q_id": 258
    },
    {
        "db_id": "employee_hire_evaluation",
        "question": "Vorrei sapere quanti dipendenti ci sono?",
        "q_id": 259
    },
    {
        "db_id": "employee_hire_evaluation",
        "question": "Mi puoi dire conta il numero di dipendenti",
        "q_id": 260
    },
    {
        "db_id": "employee_hire_evaluation",
        "question": "Sai ordina i nomi dei dipendenti per la loro età in ordine crescente.",
        "q_id": 261
    },
    {
        "db_id": "employee_hire_evaluation",
        "question": "Mi puoi dire elenca i nomi dei dipendenti e ordina in ordine crescente di età.",
        "q_id": 262
    },
    {
        "db_id": "employee_hire_evaluation",
        "question": "Per favore dimmi qual è il numero di dipendenti di ogni città?",
        "q_id": 263
    },
    {
        "db_id": "employee_hire_evaluation",
        "question": "Mi puoi dire conta il numero di dipendenti per ogni città.",
        "q_id": 264
    },
    {
        "db_id": "employee_hire_evaluation",
        "question": "Vorrei sapere da quali città provengono più di un dipendente di età inferiore ai 30 anni?",
        "q_id": 265
    },
    {
        "db_id": "employee_hire_evaluation",
        "question": "Puoi dirmi trova le città che hanno più di un dipendente di età inferiore ai 30 anni.",
        "q_id": 266
    },
    {
        "db_id": "employee_hire_evaluation",
        "question": "Sai trova il numero di negozi in ogni posizione.",
        "q_id": 267
    },
    {
        "db_id": "employee_hire_evaluation",
        "question": "Puoi dirmi quanti negozi ci sono in ogni posizione?",
        "q_id": 268
    },
    {
        "db_id": "employee_hire_evaluation",
        "question": "Sai trova il nome del direttore e il distretto del negozio il cui numero di prodotti è il più grande.",
        "q_id": 269
    },
    {
        "db_id": "employee_hire_evaluation",
        "question": "Mi puoi dire quali sono il nome manager e il distretto del negozio che vende il maggior numero di prodotti?",
        "q_id": 270
    },
    {
        "db_id": "employee_hire_evaluation",
        "question": "Per favore dimmi trova il numero minimo e massimo di prodotti di tutti i negozi.",
        "q_id": 271
    },
    {
        "db_id": "employee_hire_evaluation",
        "question": "Mi puoi dire quali sono il numero minimo e massimo di prodotti in tutti i negozi?",
        "q_id": 272
    },
    {
        "db_id": "employee_hire_evaluation",
        "question": "Per favore dimmi restituisci il nome, la posizione e il distretto di tutti i negozi in ordine decrescente di numero di prodotti.",
        "q_id": 273
    },
    {
        "db_id": "employee_hire_evaluation",
        "question": "Per favore dimmi ordina tutti i negozi per numero di prodotti in ordine decrescente e restituisci il nome, la posizione e il distretto di ogni negozio.",
        "q_id": 274
    },
    {
        "db_id": "employee_hire_evaluation",
        "question": "Puoi dirmi trova i nomi dei negozi i cui prodotti numerici sono più del numero medio di prodotti.",
        "q_id": 275
    },
    {
        "db_id": "employee_hire_evaluation",
        "question": "Ti posso chiedere quali prodotti numerici dei negozi sono al di sopra della media?dammi i nomi del negozio.",
        "q_id": 276
    },
    {
        "db_id": "employee_hire_evaluation",
        "question": "Sai trova il nome del dipendente a cui è stato assegnato la maggior parte delle volte nella valutazione.",
        "q_id": 277
    },
    {
        "db_id": "employee_hire_evaluation",
        "question": "Vorrei chiederti quale dipendente ha ricevuto il maggior numero di premi nelle valutazioni?dammi il nome del dipendente.",
        "q_id": 278
    },
    {
        "db_id": "employee_hire_evaluation",
        "question": "Puoi dirmi trova il nome del dipendente che ha ottenuto il bonus una volta più alto.",
        "q_id": 279
    },
    {
        "db_id": "employee_hire_evaluation",
        "question": "Puoi dirmi quale dipendente ha ricevuto il bonus più grande?dammi il nome del dipendente.",
        "q_id": 280
    },
    {
        "db_id": "employee_hire_evaluation",
        "question": "Ti posso chiedere trova i nomi dei dipendenti che non hanno mai vinto alcun premio nella valutazione.",
        "q_id": 281
    },
    {
        "db_id": "employee_hire_evaluation",
        "question": "Vorrei sapere quali sono i nomi dei dipendenti che non hanno mai ricevuto alcuna valutazione?",
        "q_id": 282
    },
    {
        "db_id": "employee_hire_evaluation",
        "question": "Vorrei sapere qual è il nome del negozio che sta assumendo il maggior numero di dipendenti?",
        "q_id": 283
    },
    {
        "db_id": "employee_hire_evaluation",
        "question": "Ti posso chiedere quale negozio ha il maggior numero di dipendenti?dammi il nome del negozio.",
        "q_id": 284
    },
    {
        "db_id": "employee_hire_evaluation",
        "question": "Sai trova il nome dei negozi che non assumono alcun dipendente.",
        "q_id": 285
    },
    {
        "db_id": "employee_hire_evaluation",
        "question": "Per favore dimmi quali negozi funzionano senza dipendenti?trova i nomi del negozio",
        "q_id": 286
    },
    {
        "db_id": "employee_hire_evaluation",
        "question": "Per favore dimmi trova il numero di dipendenti assunti in ogni negozio;mostra anche il nome del negozio.",
        "q_id": 287
    },
    {
        "db_id": "employee_hire_evaluation",
        "question": "Puoi dirmi per ogni negozio, restituire il numero di dipendenti che lavorano lì e il nome del negozio.",
        "q_id": 288
    },
    {
        "db_id": "employee_hire_evaluation",
        "question": "Vorrei sapere cosa viene dato il bonus totale in tutte le valutazioni?",
        "q_id": 289
    },
    {
        "db_id": "employee_hire_evaluation",
        "question": "Sai trova la quantità totale di bonus indicato in tutte le valutazioni.",
        "q_id": 290
    },
    {
        "db_id": "employee_hire_evaluation",
        "question": "Per favore dimmi dammi tutte le informazioni sull'assunzione.",
        "q_id": 291
    },
    {
        "db_id": "employee_hire_evaluation",
        "question": "Puoi dirmi quali sono tutte le informazioni sull'assunzione?",
        "q_id": 292
    },
    {
        "db_id": "employee_hire_evaluation",
        "question": "Sai quale distretto ha entrambi i negozi con meno di 3000 prodotti e negozi con oltre 10000 prodotti?",
        "q_id": 293
    },
    {
        "db_id": "employee_hire_evaluation",
        "question": "Per favore dimmi trova i distretti in cui ci sono entrambi i negozi che vendono meno di 3000 prodotti e negozi che vendono più di 10000 prodotti.",
        "q_id": 294
    },
    {
        "db_id": "employee_hire_evaluation",
        "question": "Per favore dimmi quante diverse posizioni dei negozi ci sono?",
        "q_id": 295
    },
    {
        "db_id": "employee_hire_evaluation",
        "question": "Mi puoi dire conta il numero di posizioni distinte dei negozi.",
        "q_id": 296
    },
    {
        "db_id": "cre_Doc_Template_Mgt",
        "question": "Ti posso chiedere quanti documenti abbiamo?",
        "q_id": 297
    },
    {
        "db_id": "cre_Doc_Template_Mgt",
        "question": "Puoi dirmi conta il numero di documenti.",
        "q_id": 298
    },
    {
        "db_id": "cre_Doc_Template_Mgt",
        "question": "Per favore dimmi elenca id documenti, nomi di documenti e descrizioni di documenti per tutti i documenti.",
        "q_id": 299
    },
    {
        "db_id": "cre_Doc_Template_Mgt",
        "question": "Puoi dirmi quali sono gli id, i nomi e le descrizioni per tutti i documenti?",
        "q_id": 300
    },
    {
        "db_id": "cre_Doc_Template_Mgt",
        "question": "Per favore dimmi qual è il nome del documento e l'id modello per il documento con descrizione con la lettera \"w\"?",
        "q_id": 301
    },
    {
        "db_id": "cre_Doc_Template_Mgt",
        "question": "Puoi dirmi restituisci i nomi e gli id modello per documenti che contengono la lettera w nella loro descrizione.",
        "q_id": 302
    },
    {
        "db_id": "cre_Doc_Template_Mgt",
        "question": "Per favore dimmi qual è l'id del documento, l'id modello e la descrizione per il documento denominato `` robbin cv ''?",
        "q_id": 303
    },
    {
        "db_id": "cre_Doc_Template_Mgt",
        "question": "Sai restituisci l'id documento, l'id modello e la descrizione per il documento con il nome robbin cv.",
        "q_id": 304
    },
    {
        "db_id": "cre_Doc_Template_Mgt",
        "question": "Vorrei sapere quanti modelli diversi utilizzano tutti i documenti?",
        "q_id": 305
    },
    {
        "db_id": "cre_Doc_Template_Mgt",
        "question": "Puoi dirmi conta il numero di diversi modelli utilizzati per i documenti.",
        "q_id": 306
    },
    {
        "db_id": "cre_Doc_Template_Mgt",
        "question": "Per favore dimmi quanti documenti utilizzano il modello con il codice di tipo \"ppt\"?",
        "q_id": 307
    },
    {
        "db_id": "cre_Doc_Template_Mgt",
        "question": "Sai conta il numero di documenti che utilizzano il tipo di modello ppt.",
        "q_id": 308
    },
    {
        "db_id": "cre_Doc_Template_Mgt",
        "question": "Vorrei chiederti mostra tutti gli id modello e il numero di documenti usando ciascun modello.",
        "q_id": 309
    },
    {
        "db_id": "cre_Doc_Template_Mgt",
        "question": "Sai quali sono tutti i diversi id modello utilizzati per i documenti e quante volte sono state utilizzate ognuna di esse?",
        "q_id": 310
    },
    {
        "db_id": "cre_Doc_Template_Mgt",
        "question": "Ti posso chiedere qual è il codice id e tipo per il modello utilizzato dal maggior numero di documenti?",
        "q_id": 311
    },
    {
        "db_id": "cre_Doc_Template_Mgt",
        "question": "Per favore dimmi restituisci il codice id e tipo del modello utilizzato per il maggior numero di documenti.",
        "q_id": 312
    },
    {
        "db_id": "cre_Doc_Template_Mgt",
        "question": "Sai mostra id per tutti i modelli utilizzati da più di un documento.",
        "q_id": 313
    },
    {
        "db_id": "cre_Doc_Template_Mgt",
        "question": "Sai quali sono gli id modello di qualsiasi modello utilizzato in più di un singolo documento?",
        "q_id": 314
    },
    {
        "db_id": "cre_Doc_Template_Mgt",
        "question": "Per favore dimmi mostra ids per tutti i modelli non utilizzati da nessun documento.",
        "q_id": 315
    },
    {
        "db_id": "cre_Doc_Template_Mgt",
        "question": "Puoi dirmi quali sono gli id per i modelli che non vengono utilizzati in alcun documento?",
        "q_id": 316
    },
    {
        "db_id": "cre_Doc_Template_Mgt",
        "question": "Per favore dimmi quanti modelli abbiamo?",
        "q_id": 317
    },
    {
        "db_id": "cre_Doc_Template_Mgt",
        "question": "Mi puoi dire conta il numero di modelli.",
        "q_id": 318
    },
    {
        "db_id": "cre_Doc_Template_Mgt",
        "question": "Vorrei chiederti mostra id modello, numeri di versione e codici di tipo modello per tutti i modelli.",
        "q_id": 319
    },
    {
        "db_id": "cre_Doc_Template_Mgt",
        "question": "Puoi dirmi quali sono gli id, i numeri di versione e i codici di tipo per ogni modello?",
        "q_id": 320
    },
    {
        "db_id": "cre_Doc_Template_Mgt",
        "question": "Puoi dirmi mostra tutti i codici di tipo modello distinti per tutti i modelli.",
        "q_id": 321
    },
    {
        "db_id": "cre_Doc_Template_Mgt",
        "question": "Sai quali sono i diversi codici di tipo modello?",
        "q_id": 322
    },
    {
        "db_id": "cre_Doc_Template_Mgt",
        "question": "Per favore dimmi quali sono gli id dei modelli con codice tipo modello pp o ppt?",
        "q_id": 323
    },
    {
        "db_id": "cre_Doc_Template_Mgt",
        "question": "Per favore dimmi restituisci gli id dei modelli che hanno il codice pp o ppt.",
        "q_id": 324
    },
    {
        "db_id": "cre_Doc_Template_Mgt",
        "question": "Vorrei sapere quanti modelli hanno il codice di tipo modello cv?",
        "q_id": 325
    },
    {
        "db_id": "cre_Doc_Template_Mgt",
        "question": "Ti posso chiedere contare il numero di modelli del tipo cv.",
        "q_id": 326
    },
    {
        "db_id": "cre_Doc_Template_Mgt",
        "question": "Vorrei sapere qual è il numero di versione e il tipo di tipo di modello per il modello con numero di versione più tardi di 5?",
        "q_id": 327
    },
    {
        "db_id": "cre_Doc_Template_Mgt",
        "question": "Puoi dirmi restituisci i numeri di versione e i codici di tipo modello di modelli con un numero di versione superiore a 5.",
        "q_id": 328
    },
    {
        "db_id": "cre_Doc_Template_Mgt",
        "question": "Vorrei sapere mostra tutti i codici di tipo modello e il numero di modelli per ciascuno.",
        "q_id": 329
    },
    {
        "db_id": "cre_Doc_Template_Mgt",
        "question": "Vorrei sapere quali sono i diversi codici di tipo modello e quanti modelli corrispondono a ciascuno?",
        "q_id": 330
    },
    {
        "db_id": "cre_Doc_Template_Mgt",
        "question": "Mi puoi dire quale codice di tipo modello ha la maggior parte dei modelli?",
        "q_id": 331
    },
    {
        "db_id": "cre_Doc_Template_Mgt",
        "question": "Vorrei sapere restituisci il codice di tipo del tipo di modello a cui appartiene la maggior parte dei modelli.",
        "q_id": 332
    },
    {
        "db_id": "cre_Doc_Template_Mgt",
        "question": "Sai mostra tutti i codici di tipo modello con meno di tre modelli.",
        "q_id": 333
    },
    {
        "db_id": "cre_Doc_Template_Mgt",
        "question": "Per favore dimmi quali sono i codici dei tipi di modelli che hanno meno di 3 modelli?",
        "q_id": 334
    },
    {
        "db_id": "cre_Doc_Template_Mgt",
        "question": "Puoi dirmi qual è il numero di versione più piccolo e il codice del tipo di modello?",
        "q_id": 335
    },
    {
        "db_id": "cre_Doc_Template_Mgt",
        "question": "Puoi dirmi restituisci il numero di versione più basso, insieme al codice tipo modello corrispondente.",
        "q_id": 336
    },
    {
        "db_id": "cre_Doc_Template_Mgt",
        "question": "Puoi dirmi qual è il codice di tipo modello del modello utilizzato dal documento con il nome `` base di dati ''?",
        "q_id": 337
    },
    {
        "db_id": "cre_Doc_Template_Mgt",
        "question": "Puoi dirmi restituisci il codice tipo modello del modello utilizzato da un documento denominato base di dati.",
        "q_id": 338
    },
    {
        "db_id": "cre_Doc_Template_Mgt",
        "question": "Puoi dirmi mostra tutti i nomi dei documenti usando modelli con codice tipo modello bk.",
        "q_id": 339
    },
    {
        "db_id": "cre_Doc_Template_Mgt",
        "question": "Ti posso chiedere quali sono i nomi dei documenti che utilizzano i modelli con il codice bk?",
        "q_id": 340
    },
    {
        "db_id": "cre_Doc_Template_Mgt",
        "question": "Mi puoi dire mostra tutti i codici di tipo modello e il numero di documenti usando ogni tipo.",
        "q_id": 341
    },
    {
        "db_id": "cre_Doc_Template_Mgt",
        "question": "Mi puoi dire quali sono i diversi codici di tipo modello e quanti documenti usano ogni tipo?",
        "q_id": 342
    },
    {
        "db_id": "cre_Doc_Template_Mgt",
        "question": "Per favore dimmi quale codice di tipo modello viene utilizzato dalla maggior parte del numero di documenti?",
        "q_id": 343
    },
    {
        "db_id": "cre_Doc_Template_Mgt",
        "question": "Mi puoi dire restituisci il codice del tipo di modello più comunemente utilizzato nei documenti.",
        "q_id": 344
    },
    {
        "db_id": "cre_Doc_Template_Mgt",
        "question": "Sai mostra tutti i codici di tipo modello che non sono utilizzati da nessun documento.",
        "q_id": 345
    },
    {
        "db_id": "cre_Doc_Template_Mgt",
        "question": "Vorrei sapere quali sono i codici dei tipi di modelli che non vengono utilizzati per nessun documento?",
        "q_id": 346
    },
    {
        "db_id": "cre_Doc_Template_Mgt",
        "question": "Vorrei chiederti mostra tutti i codici e le descrizioni del tipo di modello.",
        "q_id": 347
    },
    {
        "db_id": "cre_Doc_Template_Mgt",
        "question": "Sai quali sono i codici di tipo e le descrizioni per tutti i tipi di modelli?",
        "q_id": 348
    },
    {
        "db_id": "cre_Doc_Template_Mgt",
        "question": "Vorrei chiederti qual è le descrizioni del tipo di modello per il codice tipo modello `` ad ''.",
        "q_id": 349
    },
    {
        "db_id": "cre_Doc_Template_Mgt",
        "question": "Vorrei sapere restituisci il tipo di modello descrizione del tipo di modello con l'annuncio del codice.",
        "q_id": 350
    },
    {
        "db_id": "cre_Doc_Template_Mgt",
        "question": "Vorrei chiederti qual è il codice tipo modello per il tipo di modello descrizione `` libro ''.",
        "q_id": 351
    },
    {
        "db_id": "cre_Doc_Template_Mgt",
        "question": "Mi puoi dire restituisci il codice tipo del tipo di modello con la descrizione `` libro ''.",
        "q_id": 352
    },
    {
        "db_id": "cre_Doc_Template_Mgt",
        "question": "Sai quali sono le descrizioni del tipo di modello distinte per i modelli mai utilizzati da un documento?",
        "q_id": 353
    },
    {
        "db_id": "cre_Doc_Template_Mgt",
        "question": "Vorrei sapere restituisci le diverse descrizioni per i modelli che sono stati utilizzati in un documento.",
        "q_id": 354
    },
    {
        "db_id": "cre_Doc_Template_Mgt",
        "question": "Mi puoi dire quali sono gli id modello con tipo di modello descrizione `` presentazione ''.",
        "q_id": 355
    },
    {
        "db_id": "cre_Doc_Template_Mgt",
        "question": "Vorrei chiederti restituisci gli id corrispondenti ai modelli con la descrizione \"presentazione\".",
        "q_id": 356
    },
    {
        "db_id": "cre_Doc_Template_Mgt",
        "question": "Per favore dimmi quanti paragrafi in totale?",
        "q_id": 357
    },
    {
        "db_id": "cre_Doc_Template_Mgt",
        "question": "Ti posso chiedere contare il numero di paragrafi.",
        "q_id": 358
    },
    {
        "db_id": "cre_Doc_Template_Mgt",
        "question": "Sai quanti paragrafi per il documento con il nome \"summer show\"?",
        "q_id": 359
    },
    {
        "db_id": "cre_Doc_Template_Mgt",
        "question": "Sai conta il numero di paragrafi nel documento chiamato \"summer show\".",
        "q_id": 360
    },
    {
        "db_id": "cre_Doc_Template_Mgt",
        "question": "Sai mostra i dettagli del paragrafo per il paragrafo con il testo \"corea\".",
        "q_id": 361
    },
    {
        "db_id": "cre_Doc_Template_Mgt",
        "question": "Per favore dimmi quali sono i dettagli per il paragrafo che include il testo \"corea\"?",
        "q_id": 362
    },
    {
        "db_id": "cre_Doc_Template_Mgt",
        "question": "Mi puoi dire mostra tutti gli id e testi di paragrafo per il documento con il nome \"welcome to ny\".",
        "q_id": 363
    },
    {
        "db_id": "cre_Doc_Template_Mgt",
        "question": "Ti posso chiedere quali sono gli id e i testi dei paragrafi nel documento intitolato \"welcome to ny\"?",
        "q_id": 364
    },
    {
        "db_id": "cre_Doc_Template_Mgt",
        "question": "Vorrei chiederti mostra tutti i testi di paragrafo per il documento `` recensioni dei clienti ''.",
        "q_id": 365
    },
    {
        "db_id": "cre_Doc_Template_Mgt",
        "question": "Per favore dimmi quali sono i testi di paragrafo per il documento con il nome \"recensioni dei clienti\"?",
        "q_id": 366
    },
    {
        "db_id": "cre_Doc_Template_Mgt",
        "question": "Ti posso chiedere mostra tutti gli id documenti e il numero di paragrafi in ciascun documento.ordine per documento id.",
        "q_id": 367
    },
    {
        "db_id": "cre_Doc_Template_Mgt",
        "question": "Sai restituisci i diversi id del documento insieme al numero di paragrafi corrispondenti a ciascuno, ordinato per id.",
        "q_id": 368
    },
    {
        "db_id": "cre_Doc_Template_Mgt",
        "question": "Mi puoi dire mostra tutti gli id del documento, i nomi e il numero di paragrafi in ciascun documento.",
        "q_id": 369
    },
    {
        "db_id": "cre_Doc_Template_Mgt",
        "question": "Ti posso chiedere quali sono gli id e i nomi di ciascun documento, nonché il numero di paragrafi in ciascuno?",
        "q_id": 370
    },
    {
        "db_id": "cre_Doc_Template_Mgt",
        "question": "Ti posso chiedere elencare tutti gli id documenti con almeno due paragrafi.",
        "q_id": 371
    },
    {
        "db_id": "cre_Doc_Template_Mgt",
        "question": "Ti posso chiedere quali sono gli id dei documenti che hanno 2 o più paragrafi?",
        "q_id": 372
    },
    {
        "db_id": "cre_Doc_Template_Mgt",
        "question": "Puoi dirmi qual è l'id del documento e il nome con il maggior numero di paragrafi?",
        "q_id": 373
    },
    {
        "db_id": "cre_Doc_Template_Mgt",
        "question": "Sai restituisci l'id e il nome del documento con il maggior numero di paragrafi.",
        "q_id": 374
    },
    {
        "db_id": "cre_Doc_Template_Mgt",
        "question": "Puoi dirmi qual è l'id documento con il minor numero di paragrafi?",
        "q_id": 375
    },
    {
        "db_id": "cre_Doc_Template_Mgt",
        "question": "Vorrei chiederti restituisci l'id del documento con il minor numero di paragrafi.",
        "q_id": 376
    },
    {
        "db_id": "cre_Doc_Template_Mgt",
        "question": "Sai qual è l'id documento con 1-2 paragrafi?",
        "q_id": 377
    },
    {
        "db_id": "cre_Doc_Template_Mgt",
        "question": "Sai dai gli id dei documenti che hanno tra uno e due paragrafi.",
        "q_id": 378
    },
    {
        "db_id": "cre_Doc_Template_Mgt",
        "question": "Sai mostra l'id documento con testo di paragrafo \"brasile\" e \"irlanda\".",
        "q_id": 379
    },
    {
        "db_id": "cre_Doc_Template_Mgt",
        "question": "Vorrei chiederti quali sono gli id dei documenti che contengono il testo di paragrafo \"brasile\" e \"irlanda\"?",
        "q_id": 380
    },
    {
        "db_id": "course_teach",
        "question": "Sai quanti insegnanti ci sono?",
        "q_id": 381
    },
    {
        "db_id": "course_teach",
        "question": "Per favore dimmi qual è il conteggio totale degli insegnanti?",
        "q_id": 382
    },
    {
        "db_id": "course_teach",
        "question": "Ti posso chiedere elenca i nomi degli insegnanti in ordine di età crescente.",
        "q_id": 383
    },
    {
        "db_id": "course_teach",
        "question": "Mi puoi dire quali sono i nomi degli insegnanti ordinati dall'età ascendente?",
        "q_id": 384
    },
    {
        "db_id": "course_teach",
        "question": "Mi puoi dire quali sono l'età e la città natale degli insegnanti?",
        "q_id": 385
    },
    {
        "db_id": "course_teach",
        "question": "Mi puoi dire qual è l'età e la città natale di ogni insegnante?",
        "q_id": 386
    },
    {
        "db_id": "course_teach",
        "question": "Ti posso chiedere elenca il nome di insegnanti la cui città natale non è `` little lever urban district ''.",
        "q_id": 387
    },
    {
        "db_id": "course_teach",
        "question": "Ti posso chiedere quali sono i nomi degli insegnanti la cui città natale non è `` little lever urban district ''?",
        "q_id": 388
    },
    {
        "db_id": "course_teach",
        "question": "Ti posso chiedere mostra il nome di insegnanti di età 32 o 33?",
        "q_id": 389
    },
    {
        "db_id": "course_teach",
        "question": "Puoi dirmi quali sono i nomi degli insegnanti che hanno 32 o 33 anni?",
        "q_id": 390
    },
    {
        "db_id": "course_teach",
        "question": "Puoi dirmi qual è la città natale dell'insegnante più giovane?",
        "q_id": 391
    },
    {
        "db_id": "course_teach",
        "question": "Vorrei chiederti da dove viene l'insegnante più giovane?",
        "q_id": 392
    },
    {
        "db_id": "course_teach",
        "question": "Mi puoi dire mostra diverse città degli insegnanti e il numero di insegnanti di ogni città natale.",
        "q_id": 393
    },
    {
        "db_id": "course_teach",
        "question": "Per favore dimmi per ogni città natale, quanti insegnanti ci sono?",
        "q_id": 394
    },
    {
        "db_id": "course_teach",
        "question": "Mi puoi dire elenca la città natale più comune degli insegnanti.",
        "q_id": 395
    },
    {
        "db_id": "course_teach",
        "question": "Vorrei chiederti qual è la città più comune per gli insegnanti?",
        "q_id": 396
    },
    {
        "db_id": "course_teach",
        "question": "Puoi dirmi mostra le città natalire condivise da almeno due insegnanti.",
        "q_id": 397
    },
    {
        "db_id": "course_teach",
        "question": "Puoi dirmi da cosa provengono le città da cui provengono almeno due insegnanti?",
        "q_id": 398
    },
    {
        "db_id": "course_teach",
        "question": "Ti posso chiedere mostra i nomi degli insegnanti e dei corsi che sono organizzati per insegnare.",
        "q_id": 399
    },
    {
        "db_id": "course_teach",
        "question": "Mi puoi dire qual è il nome di ogni insegnante e quale corso insegnano?",
        "q_id": 400
    },
    {
        "db_id": "course_teach",
        "question": "Sai mostra i nomi degli insegnanti e dei corsi che sono organizzati per insegnare in un ordine alfabetico ascendente del nome dell'insegnante.",
        "q_id": 401
    },
    {
        "db_id": "course_teach",
        "question": "Puoi dirmi quali sono i nomi degli insegnanti e i corsi che insegnano in ordine alfabetico ascendente con il nome dell'insegnante?",
        "q_id": 402
    },
    {
        "db_id": "course_teach",
        "question": "Vorrei chiederti mostra il nome dell'insegnante per il corso di matematica.",
        "q_id": 403
    },
    {
        "db_id": "course_teach",
        "question": "Vorrei sapere quali sono i nomi delle persone che insegnano corsi di matematica?",
        "q_id": 404
    },
    {
        "db_id": "course_teach",
        "question": "Vorrei chiederti mostra i nomi degli insegnanti e il numero di corsi che insegnano.",
        "q_id": 405
    },
    {
        "db_id": "course_teach",
        "question": "Vorrei sapere quali sono i nomi degli insegnanti e quanti corsi insegnano?",
        "q_id": 406
    },
    {
        "db_id": "course_teach",
        "question": "Per favore dimmi mostra nomi di insegnanti che insegnano almeno due corsi.",
        "q_id": 407
    },
    {
        "db_id": "course_teach",
        "question": "Mi puoi dire quali sono i nomi degli insegnanti che insegnano almeno due corsi?",
        "q_id": 408
    },
    {
        "db_id": "course_teach",
        "question": "Sai elenca i nomi degli insegnanti che non sono stati organizzati per insegnare corsi.",
        "q_id": 409
    },
    {
        "db_id": "course_teach",
        "question": "Mi puoi dire quali sono i nomi degli insegnanti i cui corsi non sono stati organizzati?",
        "q_id": 410
    },
    {
        "db_id": "museum_visit",
        "question": "Per favore dimmi quanti visitatori di età inferiore ai 30 anni ci sono?",
        "q_id": 411
    },
    {
        "db_id": "museum_visit",
        "question": "Puoi dirmi trova i nomi dei visitatori il cui livello di iscrizione è superiore a 4 e ordina i risultati dal livello da alto a basso.",
        "q_id": 412
    },
    {
        "db_id": "museum_visit",
        "question": "Mi puoi dire qual è l'età media dei visitatori il cui livello di iscrizione non è superiore a 4?",
        "q_id": 413
    },
    {
        "db_id": "museum_visit",
        "question": "Ti posso chiedere trova il nome e il livello di abbonamento dei visitatori il cui livello di iscrizione è superiore a 4 e ordina per la loro età da vecchio a giovane.",
        "q_id": 414
    },
    {
        "db_id": "museum_visit",
        "question": "Ti posso chiedere trova l'id e il nome del museo che ha il maggior numero di membri dello staff?",
        "q_id": 415
    },
    {
        "db_id": "museum_visit",
        "question": "Sai trova il numero medio di personale che lavora per i musei aperti prima del 2009.",
        "q_id": 416
    },
    {
        "db_id": "museum_visit",
        "question": "Per favore dimmi qual è l'anno di apertura e il numero del personale del museo di nome plaza museum?",
        "q_id": 417
    },
    {
        "db_id": "museum_visit",
        "question": "Vorrei sapere trova i nomi dei musei che hanno più personale rispetto al numero minimo di tutti i musei aperti dopo il 2010.",
        "q_id": 418
    },
    {
        "db_id": "museum_visit",
        "question": "Sai trova l'id, il nome e l'età per i visitatori che hanno visitato alcuni musei più di una volta.",
        "q_id": 419
    },
    {
        "db_id": "museum_visit",
        "question": "Mi puoi dire quali sono l'id, il nome e il livello di iscrizione dei visitatori che hanno speso la più grande quantità di denaro in totale in tutti i biglietti del museo?",
        "q_id": 420
    },
    {
        "db_id": "museum_visit",
        "question": "Vorrei sapere quali sono l'id e il nome del museo visitato la maggior parte delle volte?",
        "q_id": 421
    },
    {
        "db_id": "museum_visit",
        "question": "Mi puoi dire qual è il nome del museo che non aveva ancora visitatori?",
        "q_id": 422
    },
    {
        "db_id": "museum_visit",
        "question": "Per favore dimmi trova il nome e l'età del visitatore che ha acquistato il maggior numero di biglietti contemporaneamente.",
        "q_id": 423
    },
    {
        "db_id": "museum_visit",
        "question": "Per favore dimmi quali sono il numero medio e massimo di biglietti acquistati in tutte le visite?",
        "q_id": 424
    },
    {
        "db_id": "museum_visit",
        "question": "Puoi dirmi qual è la spesa totale del biglietto dei visitatori il cui livello di iscrizione è 1?",
        "q_id": 425
    },
    {
        "db_id": "museum_visit",
        "question": "Per favore dimmi qual è il nome del visitatore che ha visitato sia un museo aperto prima del 2009 e un museo aperto dopo il 2011?",
        "q_id": 426
    },
    {
        "db_id": "museum_visit",
        "question": "Puoi dirmi trova il numero di visitatori che non hanno visitato alcun museo aperto dopo il 2010.",
        "q_id": 427
    },
    {
        "db_id": "museum_visit",
        "question": "Ti posso chiedere quanti musei sono stati aperti dopo il 2013 o prima del 2008?",
        "q_id": 428
    },
    {
        "db_id": "wta_1",
        "question": "Mi puoi dire trova il numero totale di giocatori.",
        "q_id": 429
    },
    {
        "db_id": "wta_1",
        "question": "Vorrei chiederti quanti giocatori ci sono?",
        "q_id": 430
    },
    {
        "db_id": "wta_1",
        "question": "Puoi dirmi trova il numero totale di corrispondenze.",
        "q_id": 431
    },
    {
        "db_id": "wta_1",
        "question": "Sai conta il numero di corrispondenze.",
        "q_id": 432
    },
    {
        "db_id": "wta_1",
        "question": "Mi puoi dire elenca il nome e la data di nascita di tutti i giocatori del paese con code usa.",
        "q_id": 433
    },
    {
        "db_id": "wta_1",
        "question": "Sai quali sono i nomi e le date di nascita dei giocatori degli stati uniti?",
        "q_id": 434
    },
    {
        "db_id": "wta_1",
        "question": "Mi puoi dire trova l'età media dei perdenti e dei vincitori di tutte le partite.",
        "q_id": 435
    },
    {
        "db_id": "wta_1",
        "question": "Puoi dirmi quali sono l'età media dei perdenti e dei vincitori attraverso le partite?",
        "q_id": 436
    },
    {
        "db_id": "wta_1",
        "question": "Ti posso chiedere trova il grado medio di vincitori in tutte le partite.",
        "q_id": 437
    },
    {
        "db_id": "wta_1",
        "question": "Vorrei chiederti qual è il grado medio per i vincitori in tutte le partite?",
        "q_id": 438
    },
    {
        "db_id": "wta_1",
        "question": "Ti posso chiedere trova il più alto grado di perdenti in tutte le partite.",
        "q_id": 439
    },
    {
        "db_id": "wta_1",
        "question": "Per favore dimmi qual è il miglior grado di perdenti in tutte le partite?",
        "q_id": 440
    },
    {
        "db_id": "wta_1",
        "question": "Per favore dimmi trova il numero di codici nazionali distinti di tutti i giocatori.",
        "q_id": 441
    },
    {
        "db_id": "wta_1",
        "question": "Mi puoi dire da quanti paesi distinti provengono i giocatori?",
        "q_id": 442
    },
    {
        "db_id": "wta_1",
        "question": "Vorrei sapere trova il numero di distinti nome di perdenti.",
        "q_id": 443
    },
    {
        "db_id": "wta_1",
        "question": "Per favore dimmi quanti nomi di perdenti diversi ci sono?",
        "q_id": 444
    },
    {
        "db_id": "wta_1",
        "question": "Sai trova il nome del torneo che ha più di 10 partite.",
        "q_id": 445
    },
    {
        "db_id": "wta_1",
        "question": "Puoi dirmi quali sono i nomi dei tornei che hanno più di 10 partite?",
        "q_id": 446
    },
    {
        "db_id": "wta_1",
        "question": "Per favore dimmi elenca i nomi di tutti i vincitori che hanno giocato sia nel 2013 che nel 2016.",
        "q_id": 447
    },
    {
        "db_id": "wta_1",
        "question": "Vorrei chiederti quali sono i nomi dei giocatori che hanno vinto sia nel 2013 che nel 2016?",
        "q_id": 448
    },
    {
        "db_id": "wta_1",
        "question": "Per favore dimmi elenca il numero di tutte le partite che hanno giocato negli anni 2013 o 2016.",
        "q_id": 449
    },
    {
        "db_id": "wta_1",
        "question": "Vorrei sapere quante partite sono state giocate nel 2013 o nel 2016?",
        "q_id": 450
    },
    {
        "db_id": "wta_1",
        "question": "Ti posso chiedere quali sono il codice di campagna e il nome dei giocatori che hanno vinto sia nei campionati wta del torneo che in australian open?",
        "q_id": 451
    },
    {
        "db_id": "wta_1",
        "question": "Vorrei chiederti quali sono i nomi e i codici di campagna per i giocatori che hanno vinto sia i campionati wta che gli australian open?",
        "q_id": 452
    },
    {
        "db_id": "wta_1",
        "question": "Vorrei chiederti trova il nome e il codice di campagna del giocatore più antico.",
        "q_id": 453
    },
    {
        "db_id": "wta_1",
        "question": "Vorrei chiederti qual è il nome e il codice di campagna del giocatore più antico?",
        "q_id": 454
    },
    {
        "db_id": "wta_1",
        "question": "Puoi dirmi elenca il nome e il cognome di tutti i giocatori nell'ordine di nascita.",
        "q_id": 455
    },
    {
        "db_id": "wta_1",
        "question": "Vorrei sapere quali sono i nomi completi di tutti i giocatori, ordinati per data di nascita?",
        "q_id": 456
    },
    {
        "db_id": "wta_1",
        "question": "Vorrei chiederti elenca il nome e il cognome di tutti i giocatori che sono rimasti / l nella data di nascita.",
        "q_id": 457
    },
    {
        "db_id": "wta_1",
        "question": "Vorrei sapere quali sono i nomi completi di tutti i giocatori a sinistra, in ordine di nascita?",
        "q_id": 458
    },
    {
        "db_id": "wta_1",
        "question": "Mi puoi dire trova il nome e il codice di campagna del giocatore che ha fatto il maggior numero di tour.",
        "q_id": 459
    },
    {
        "db_id": "wta_1",
        "question": "Sai qual è il nome e il codice di campagna del giocatore con il maggior numero di tour?",
        "q_id": 460
    },
    {
        "db_id": "wta_1",
        "question": "Ti posso chiedere trova l'anno che ha il maggior numero di partite.",
        "q_id": 461
    },
    {
        "db_id": "wta_1",
        "question": "Puoi dirmi in quale anno ha avuto il maggior numero di partite?",
        "q_id": 462
    },
    {
        "db_id": "wta_1",
        "question": "Puoi dirmi trova il nome e i punti di rango del vincitore che ha vinto il maggior numero di volte.",
        "q_id": 463
    },
    {
        "db_id": "wta_1",
        "question": "Vorrei sapere qual è il nome del vincitore che ha vinto il maggior numero di partite e quanti punti di rango ha questo giocatore?",
        "q_id": 464
    },
    {
        "db_id": "wta_1",
        "question": "Ti posso chiedere trova il nome del vincitore che ha i punti più alti e ha partecipato al torneo aperto australiano.",
        "q_id": 465
    },
    {
        "db_id": "wta_1",
        "question": "Puoi dirmi qual è il nome del vincitore con i punti più di rango che hanno partecipato al torneo australian open?",
        "q_id": 466
    },
    {
        "db_id": "wta_1",
        "question": "Sai trova i nomi del perdente e del vincitore che hanno giocato nella partita con un maggior numero di minuti.",
        "q_id": 467
    },
    {
        "db_id": "wta_1",
        "question": "Vorrei chiederti quali sono i nomi del vincitore e del perdente che hanno giocato nella partita più lunga?",
        "q_id": 468
    },
    {
        "db_id": "wta_1",
        "question": "Ti posso chiedere trova la classifica media per ogni giocatore e il loro nome.",
        "q_id": 469
    },
    {
        "db_id": "wta_1",
        "question": "Vorrei sapere quali sono i primi nomi di tutti i giocatori e le loro classifiche medie?",
        "q_id": 470
    },
    {
        "db_id": "wta_1",
        "question": "Puoi dirmi trova i punti di classificazione totale per ogni giocatore e il loro nome.",
        "q_id": 471
    },
    {
        "db_id": "wta_1",
        "question": "Puoi dirmi quali sono i primi nomi di tutti i giocatori e i loro punti di classificazione totale?",
        "q_id": 472
    },
    {
        "db_id": "wta_1",
        "question": "Per favore dimmi trova il numero di giocatori per ogni paese.",
        "q_id": 473
    },
    {
        "db_id": "wta_1",
        "question": "Vorrei sapere quanti giocatori sono da ogni paese?",
        "q_id": 474
    },
    {
        "db_id": "wta_1",
        "question": "Vorrei sapere trova il codice del paese dove ha il maggior numero di giocatori.",
        "q_id": 475
    },
    {
        "db_id": "wta_1",
        "question": "Mi puoi dire qual è il codice del paese con la maggior parte dei giocatori?",
        "q_id": 476
    },
    {
        "db_id": "wta_1",
        "question": "Puoi dirmi trova i codici dei paesi che hanno più di 50 giocatori.",
        "q_id": 477
    },
    {
        "db_id": "wta_1",
        "question": "Mi puoi dire quali sono i codici dei paesi con più di 50 giocatori?",
        "q_id": 478
    },
    {
        "db_id": "wta_1",
        "question": "Sai trova il numero totale di tour per ogni data di classificazione.",
        "q_id": 479
    },
    {
        "db_id": "wta_1",
        "question": "Vorrei chiederti quanti tour totali c'erano per ogni data di classificazione?",
        "q_id": 480
    },
    {
        "db_id": "wta_1",
        "question": "Vorrei sapere trova il numero di partite è avvenuto ogni anno.",
        "q_id": 481
    },
    {
        "db_id": "wta_1",
        "question": "Mi puoi dire quante partite venivano giocate ogni anno?",
        "q_id": 482
    },
    {
        "db_id": "wta_1",
        "question": "Puoi dirmi trova il nome e il grado dei 3 vincitori più giovani in tutte le partite.",
        "q_id": 483
    },
    {
        "db_id": "wta_1",
        "question": "Vorrei chiederti quali sono i nomi e i ranghi dei tre più giovani vincitori in tutte le partite?",
        "q_id": 484
    },
    {
        "db_id": "wta_1",
        "question": "Per favore dimmi quanti vincitori diversi hanno partecipato entrambi ai campionati wta e sono stati mancino?",
        "q_id": 485
    },
    {
        "db_id": "wta_1",
        "question": "Ti posso chiedere trova il numero di vincitori a sinistra che hanno partecipato ai campionati wta.",
        "q_id": 486
    },
    {
        "db_id": "wta_1",
        "question": "Mi puoi dire trova il nome, il codice del paese e la data di nascita del vincitore che ha i punti più alti in tutte le partite.",
        "q_id": 487
    },
    {
        "db_id": "wta_1",
        "question": "Sai qual è il nome, il codice del paese e la data di nascita del giocatore con i punti di classificazione più vincitori in tutte le partite?",
        "q_id": 488
    },
    {
        "db_id": "wta_1",
        "question": "Ti posso chiedere trova il numero di giocatori per ogni tipo di mano.",
        "q_id": 489
    },
    {
        "db_id": "wta_1",
        "question": "Ti posso chiedere quanti giocatori ci sono per ogni tipo di mano?",
        "q_id": 490
    },
    {
        "db_id": "battle_death",
        "question": "Sai quante navi hanno finito per essere \"catturate\"?",
        "q_id": 491
    },
    {
        "db_id": "battle_death",
        "question": "Per favore dimmi elencare il nome e il tonnellaggio ordinati da in ordine alfabetico discendente per i nomi.",
        "q_id": 492
    },
    {
        "db_id": "battle_death",
        "question": "Mi puoi dire elenca il nome, la data e il risultato di ogni battaglia.",
        "q_id": 493
    },
    {
        "db_id": "battle_death",
        "question": "Sai qual è il bilancio delle vittime massimo e minimo causato ogni volta?",
        "q_id": 494
    },
    {
        "db_id": "battle_death",
        "question": "Mi puoi dire qual è il numero medio di lesioni causate ogni volta?",
        "q_id": 495
    },
    {
        "db_id": "battle_death",
        "question": "Vorrei sapere quali sono le situazioni di morte e lesioni causate dalla nave con tonnellaggio \"t\"?",
        "q_id": 496
    },
    {
        "db_id": "battle_death",
        "question": "Mi puoi dire quali sono il nome e i risultati delle battaglie quando il comandante bulgaro non è \"boril\"",
        "q_id": 497
    },
    {
        "db_id": "battle_death",
        "question": "Per favore dimmi quali sono i diversi id e nomi delle battaglie che hanno perso qualsiasi tipo di tipo \"brig\"?",
        "q_id": 498
    },
    {
        "db_id": "battle_death",
        "question": "Vorrei sapere quali sono gli id e i nomi delle battaglie che hanno portato a più di 10 persone uccise in totale.",
        "q_id": 499
    },
    {
        "db_id": "battle_death",
        "question": "Vorrei chiederti qual è l'id e il nome della nave che hanno causato la maggior parte delle lesioni totali?",
        "q_id": 500
    },
    {
        "db_id": "battle_death",
        "question": "Vorrei sapere quali sono i nomi di battaglia distinti che sono tra il comandante bulgaro \"kaloyan\" e il comandante latino \"baldwin i\"?",
        "q_id": 501
    },
    {
        "db_id": "battle_death",
        "question": "Vorrei sapere quanti risultati diversi ci sono per le battaglie?",
        "q_id": 502
    },
    {
        "db_id": "battle_death",
        "question": "Per favore dimmi quante battaglie non hanno perso la nave con il tonnellaggio \"225\"?",
        "q_id": 503
    },
    {
        "db_id": "battle_death",
        "question": "Vorrei chiederti elenca il nome e la data della battaglia che ha perso la nave chiamata \"lettice\" e la nave chiamata \"hms atalanta\"",
        "q_id": 504
    },
    {
        "db_id": "battle_death",
        "question": "Ti posso chiedere mostra nomi, risultati e comandanti bulgari delle battaglie senza navi perse nel \"canale di inglese\".",
        "q_id": 505
    },
    {
        "db_id": "battle_death",
        "question": "Vorrei chiederti quali sono le note degli eventi di morte che ha la sottostringa \"est\"?",
        "q_id": 506
    },
    {
        "db_id": "student_transcripts_tracking",
        "question": "Per favore dimmi quali sono tutti gli indirizzi tra cui la riga 1 e la riga 2?",
        "q_id": 507
    },
    {
        "db_id": "student_transcripts_tracking",
        "question": "Puoi dirmi qual è la prima e la seconda riga per tutti gli indirizzi?",
        "q_id": 508
    },
    {
        "db_id": "student_transcripts_tracking",
        "question": "Per favore dimmi quanti corsi in totale sono elencati?",
        "q_id": 509
    },
    {
        "db_id": "student_transcripts_tracking",
        "question": "Ti posso chiedere quanti corsi ci sono?",
        "q_id": 510
    },
    {
        "db_id": "student_transcripts_tracking",
        "question": "Vorrei chiederti come viene descritto il corso di matematica?",
        "q_id": 511
    },
    {
        "db_id": "student_transcripts_tracking",
        "question": "Per favore dimmi quali sono le descrizioni per tutti i corsi di matematica?",
        "q_id": 512
    },
    {
        "db_id": "student_transcripts_tracking",
        "question": "Vorrei chiederti qual è il codice postale dell'indirizzo nel port chelsea della città?",
        "q_id": 513
    },
    {
        "db_id": "student_transcripts_tracking",
        "question": "Ti posso chiedere qual è il codice postale per port chelsea?",
        "q_id": 514
    },
    {
        "db_id": "student_transcripts_tracking",
        "question": "Puoi dirmi quale dipartimento offre il maggior numero di gradi?elenco nome del dipartimento e id.",
        "q_id": 515
    },
    {
        "db_id": "student_transcripts_tracking",
        "question": "Mi puoi dire qual è il nome e l'id del dipartimento con il maggior numero di gradi?",
        "q_id": 516
    },
    {
        "db_id": "student_transcripts_tracking",
        "question": "Per favore dimmi quanti dipartimenti offrono qualche laurea?",
        "q_id": 517
    },
    {
        "db_id": "student_transcripts_tracking",
        "question": "Per favore dimmi quanti dipartimenti diversi offrono gradi?",
        "q_id": 518
    },
    {
        "db_id": "student_transcripts_tracking",
        "question": "Mi puoi dire quanti nomi di laurea diversi sono offerti?",
        "q_id": 519
    },
    {
        "db_id": "student_transcripts_tracking",
        "question": "Mi puoi dire quanti gradi diversi sono offerti?",
        "q_id": 520
    },
    {
        "db_id": "student_transcripts_tracking",
        "question": "Vorrei chiederti quanti gradi offre il dipartimento di ingegneria?",
        "q_id": 521
    },
    {
        "db_id": "student_transcripts_tracking",
        "question": "Ti posso chiedere quanti gradi ha il dipartimento di ingegneria?",
        "q_id": 522
    },
    {
        "db_id": "student_transcripts_tracking",
        "question": "Vorrei chiederti quali sono i nomi e le descrizioni di tutte le sezioni?",
        "q_id": 523
    },
    {
        "db_id": "student_transcripts_tracking",
        "question": "Mi puoi dire quali sono i nomi e le descrizioni per tutte le sezioni?",
        "q_id": 524
    },
    {
        "db_id": "student_transcripts_tracking",
        "question": "Vorrei sapere quali sono i nomi e l'id dei corsi che hanno al massimo 2 sezioni?",
        "q_id": 525
    },
    {
        "db_id": "student_transcripts_tracking",
        "question": "Vorrei sapere quali sono i nomi e gli id di ogni corso con meno di 2 sezioni?",
        "q_id": 526
    },
    {
        "db_id": "student_transcripts_tracking",
        "question": "Per favore dimmi elenca il sezione_name in ordine lessicografico invertito.",
        "q_id": 527
    },
    {
        "db_id": "student_transcripts_tracking",
        "question": "Ti posso chiedere quali sono i nomi delle sezioni in ordine alfabetico inverso?",
        "q_id": 528
    },
    {
        "db_id": "student_transcripts_tracking",
        "question": "Sai qual è il semestre in cui la maggior parte degli studenti si è registrata?mostra sia il nome che l'id.",
        "q_id": 529
    },
    {
        "db_id": "student_transcripts_tracking",
        "question": "Ti posso chiedere per ogni semestre, qual è il nome e l'id di quello con il maggior numero di studenti registrati?",
        "q_id": 530
    },
    {
        "db_id": "student_transcripts_tracking",
        "question": "Puoi dirmi qual è la descrizione del dipartimento il cui nome ha la sottostrimento del computer?",
        "q_id": 531
    },
    {
        "db_id": "student_transcripts_tracking",
        "question": "Puoi dirmi qual è la descrizione del dipartimento per chi ha la parola computer?",
        "q_id": 532
    },
    {
        "db_id": "student_transcripts_tracking",
        "question": "Mi puoi dire chi sono iscritti in programmi a 2 gradi in un semestre?elenca il nome, il secondo nome e il cognome e l'id.",
        "q_id": 533
    },
    {
        "db_id": "student_transcripts_tracking",
        "question": "Per favore dimmi quali sono i primi, medi e cognomi, insieme agli id, di tutti gli studenti che si sono iscritti a programmi di 2 gradi in un semestre?",
        "q_id": 534
    },
    {
        "db_id": "student_transcripts_tracking",
        "question": "Ti posso chiedere chi è iscritto a un programma di laurea?elenca il nome, il secondo nome, il cognome.",
        "q_id": 535
    },
    {
        "db_id": "student_transcripts_tracking",
        "question": "Ti posso chiedere quali sono i primi, medi e cognomi per tutti iscritti a un programma di scapolo?",
        "q_id": 536
    },
    {
        "db_id": "student_transcripts_tracking",
        "question": "Mi puoi dire trova il tipo di programma in cui è iscritto la maggior parte del numero di studenti?",
        "q_id": 537
    },
    {
        "db_id": "student_transcripts_tracking",
        "question": "Ti posso chiedere qual è il nome di sintesi di laurea che ha il maggior numero di studenti iscritti?",
        "q_id": 538
    },
    {
        "db_id": "student_transcripts_tracking",
        "question": "Vorrei sapere trova il programma in cui la maggior parte degli studenti è iscritta.elenca sia l'id che il riepilogo.",
        "q_id": 539
    },
    {
        "db_id": "student_transcripts_tracking",
        "question": "Per favore dimmi qual è l'id del programma e il riassunto della laurea che ha il maggior numero di studenti iscritti?",
        "q_id": 540
    },
    {
        "db_id": "student_transcripts_tracking",
        "question": "Per favore dimmi quale studente si è iscritto per la maggior parte delle volte in qualsiasi programma?elenca l'id, il nome, il secondo nome, il cognome, il numero di iscrizioni e id studente.",
        "q_id": 541
    },
    {
        "db_id": "student_transcripts_tracking",
        "question": "Puoi dirmi qual è il primo, medio e cognome, insieme all'id e al numero di iscrizioni, per lo studente che si è iscritto di più in qualsiasi programma?",
        "q_id": 542
    },
    {
        "db_id": "student_transcripts_tracking",
        "question": "Vorrei sapere quali semestri non hanno uno studente iscritto?elenca il nome del semestre.",
        "q_id": 543
    },
    {
        "db_id": "student_transcripts_tracking",
        "question": "Mi puoi dire qual è il nome del semestre senza studenti iscritti?",
        "q_id": 544
    },
    {
        "db_id": "student_transcripts_tracking",
        "question": "Puoi dirmi quali sono tutti i nomi dei corsi dei corsi che hanno mai iscritto gli studenti?",
        "q_id": 545
    },
    {
        "db_id": "student_transcripts_tracking",
        "question": "Vorrei sapere quali sono i nomi di tutti i corsi che hanno alcuni studenti iscritti?",
        "q_id": 546
    },
    {
        "db_id": "student_transcripts_tracking",
        "question": "Vorrei chiederti qual è il nome del corso con la maggior parte delle iscrizioni?",
        "q_id": 547
    },
    {
        "db_id": "student_transcripts_tracking",
        "question": "Ti posso chiedere qual è il nome del corso con la maggior parte degli studenti iscritti?",
        "q_id": 548
    },
    {
        "db_id": "student_transcripts_tracking",
        "question": "Puoi dirmi trova il cognome degli studenti che attualmente vivono nello stato della carolina del nord ma non si sono registrati in nessun programma di laurea.",
        "q_id": 549
    },
    {
        "db_id": "student_transcripts_tracking",
        "question": "Sai quali sono i cognome degli studenti che vivono nella carolina del nord ma non si sono registrati in programmi di laurea?",
        "q_id": 550
    },
    {
        "db_id": "student_transcripts_tracking",
        "question": "Sai mostra la data e l'id della trascrizione con almeno 2 risultati del corso.",
        "q_id": 551
    },
    {
        "db_id": "student_transcripts_tracking",
        "question": "Mi puoi dire qual è la data e l'id della trascrizione con almeno 2 corsi elencati?",
        "q_id": 552
    },
    {
        "db_id": "student_transcripts_tracking",
        "question": "Sai qual è il numero di telefono dell'uomo con il nome timmothy e il cognome ward?",
        "q_id": 553
    },
    {
        "db_id": "student_transcripts_tracking",
        "question": "Mi puoi dire qual è il numero di cellulare dello studente di nome timmothy ward?",
        "q_id": 554
    },
    {
        "db_id": "student_transcripts_tracking",
        "question": "Vorrei chiederti chi è il primo studente a registrarsi?elenca il nome, il secondo nome e il cognome.",
        "q_id": 555
    },
    {
        "db_id": "student_transcripts_tracking",
        "question": "Ti posso chiedere qual è il primo, medio e cognome del primo studente a registrarsi?",
        "q_id": 556
    },
    {
        "db_id": "student_transcripts_tracking",
        "question": "Puoi dirmi chi è il primo diplomato della scuola?elenca il nome, il secondo nome e il cognome.",
        "q_id": 557
    },
    {
        "db_id": "student_transcripts_tracking",
        "question": "Vorrei chiederti qual è il primo, medio e cognome del primo diplomato della scuola?",
        "q_id": 558
    },
    {
        "db_id": "student_transcripts_tracking",
        "question": "Ti posso chiedere il cui indirizzo permanente è diverso dal suo indirizzo attuale?elenca il suo nome.",
        "q_id": 559
    },
    {
        "db_id": "student_transcripts_tracking",
        "question": "Ti posso chiedere qual è il nome dello studente il cui indirizzo permanente è diverso da quello attuale?",
        "q_id": 560
    },
    {
        "db_id": "student_transcripts_tracking",
        "question": "Sai quale indirizzo contiene il maggior numero di studenti attualmente?elenca l'id indirizzo e tutte le righe.",
        "q_id": 561
    },
    {
        "db_id": "student_transcripts_tracking",
        "question": "Vorrei chiederti qual è l'id, la riga 1 e la riga 2 dell'indirizzo con il maggior numero di studenti?",
        "q_id": 562
    },
    {
        "db_id": "student_transcripts_tracking",
        "question": "Ti posso chiedere in media, quando sono state stampate le trascrizioni?",
        "q_id": 563
    },
    {
        "db_id": "student_transcripts_tracking",
        "question": "Vorrei sapere qual è la data di trascrizione media?",
        "q_id": 564
    },
    {
        "db_id": "student_transcripts_tracking",
        "question": "Vorrei sapere quando viene rilasciata la prima trascrizione?elenca la data e i dettagli.",
        "q_id": 565
    },
    {
        "db_id": "student_transcripts_tracking",
        "question": "Puoi dirmi qual è la prima data di una versione trascritta e quali dettagli puoi dirmi?",
        "q_id": 566
    },
    {
        "db_id": "student_transcripts_tracking",
        "question": "Sai quante trascrizioni vengono rilasciate?",
        "q_id": 567
    },
    {
        "db_id": "student_transcripts_tracking",
        "question": "Ti posso chiedere quante trascrizioni sono elencate?",
        "q_id": 568
    },
    {
        "db_id": "student_transcripts_tracking",
        "question": "Per favore dimmi qual è l'ultima data di rilascio della trascrizione?",
        "q_id": 569
    },
    {
        "db_id": "student_transcripts_tracking",
        "question": "Ti posso chiedere quando è stata rilasciata l'ultima trascrizione?",
        "q_id": 570
    },
    {
        "db_id": "student_transcripts_tracking",
        "question": "Mi puoi dire quante volte al massimo può mostrare un risultato di iscrizione al corso in diverse trascrizioni?mostra anche l'id di iscrizione al corso.",
        "q_id": 571
    },
    {
        "db_id": "student_transcripts_tracking",
        "question": "Per favore dimmi qual è il numero massimo di volte in cui un corso viene visualizzato in diverse trascrizioni e qual è l'id di iscrizione di quel corso?",
        "q_id": 572
    },
    {
        "db_id": "student_transcripts_tracking",
        "question": "Mi puoi dire mostra la data della trascrizione che mostra il minimo numero di risultati, elenca anche l'id.",
        "q_id": 573
    },
    {
        "db_id": "student_transcripts_tracking",
        "question": "Vorrei chiederti qual è la data e l'id della trascrizione con il minimo numero di risultati?",
        "q_id": 574
    },
    {
        "db_id": "student_transcripts_tracking",
        "question": "Per favore dimmi trova il semestre in cui si sono iscritti sia gli studenti maestri che gli studenti di laurea.",
        "q_id": 575
    },
    {
        "db_id": "student_transcripts_tracking",
        "question": "Mi puoi dire qual è l'id del semestre che aveva sia i maestri che gli studenti di scapoli iscritti?",
        "q_id": 576
    },
    {
        "db_id": "student_transcripts_tracking",
        "question": "Sai quanti indirizzi diversi vivono gli studenti?",
        "q_id": 577
    },
    {
        "db_id": "student_transcripts_tracking",
        "question": "Ti posso chiedere quali sono i diversi indirizzi che hanno studenti che vivono lì?",
        "q_id": 578
    },
    {
        "db_id": "student_transcripts_tracking",
        "question": "Vorrei chiederti elenca tutti i dettagli degli studenti in ordine lessicografico invertito.",
        "q_id": 579
    },
    {
        "db_id": "student_transcripts_tracking",
        "question": "Vorrei chiederti quali altri dettagli puoi parlarmi degli studenti in ordine alfabetico inverso?",
        "q_id": 580
    },
    {
        "db_id": "student_transcripts_tracking",
        "question": "Vorrei sapere descrivi la sezione h.",
        "q_id": 581
    },
    {
        "db_id": "student_transcripts_tracking",
        "question": "Sai qual è la descrizione per la sezione chiamata h?",
        "q_id": 582
    },
    {
        "db_id": "student_transcripts_tracking",
        "question": "Vorrei sapere trova il nome degli studenti che vivono permanentemente nel paese haiti o hanno il numero di cellulare 09700166582.",
        "q_id": 583
    },
    {
        "db_id": "student_transcripts_tracking",
        "question": "Mi puoi dire quali sono i primi nomi degli studenti che vivono ad haiti permanentemente o hanno il numero di cellulare 09700166582?",
        "q_id": 584
    },
    {
        "db_id": "tvshow",
        "question": "Per favore dimmi elencare il titolo di tutti i cartoni in ordine alfabetico.",
        "q_id": 585
    },
    {
        "db_id": "tvshow",
        "question": "Vorrei sapere quali sono i titoli dei cartoni ordinati in ordine alfabetico?",
        "q_id": 586
    },
    {
        "db_id": "tvshow",
        "question": "Puoi dirmi elenca tutti i cartoni animati diretti da `` ben jones ''.",
        "q_id": 587
    },
    {
        "db_id": "tvshow",
        "question": "Sai quali sono i nomi di tutti i cartoni diretti da ben jones?",
        "q_id": 588
    },
    {
        "db_id": "tvshow",
        "question": "Sai quanti cartoni sono stati scritti da `` joseph kuhr ''?",
        "q_id": 589
    },
    {
        "db_id": "tvshow",
        "question": "Vorrei sapere qual è il numero di cartooni scritte da joseph kuhr?",
        "q_id": 590
    },
    {
        "db_id": "tvshow",
        "question": "Vorrei chiederti elenca tutti i titoli dei cartoni animati e i loro registi ordinati entro la loro data di aereo",
        "q_id": 591
    },
    {
        "db_id": "tvshow",
        "question": "Vorrei sapere qual è il nome e i registi di tutti i cartoni che sono ordinati per data dell'aria?",
        "q_id": 592
    },
    {
        "db_id": "tvshow",
        "question": "Mi puoi dire elenca il titolo di tutti i cartoni animati diretti da `` ben jones '' o `` brandon vietti ''.",
        "q_id": 593
    },
    {
        "db_id": "tvshow",
        "question": "Ti posso chiedere quali sono i titoli di tutti i cartoni diretti da ben jones o brandon vietti?",
        "q_id": 594
    },
    {
        "db_id": "tvshow",
        "question": "Per favore dimmi quale paese ha la maggior parte dei canali tv?elenca il paese e il numero di canali tv che ha.",
        "q_id": 595
    },
    {
        "db_id": "tvshow",
        "question": "Ti posso chiedere qual è il paese con il maggior numero di canali tv e quanti hanno?",
        "q_id": 596
    },
    {
        "db_id": "tvshow",
        "question": "Puoi dirmi elencare il numero di nomi e contenuti di serie diversi nella tabella dei canali tv.",
        "q_id": 597
    },
    {
        "db_id": "tvshow",
        "question": "Vorrei sapere quante serie e contenuti diversi sono elencati nella tabella dei canali tv?",
        "q_id": 598
    },
    {
        "db_id": "tvshow",
        "question": "Mi puoi dire qual è il contenuto del canale tv con il nome seriale `` sky radio ''?",
        "q_id": 599
    },
    {
        "db_id": "tvshow",
        "question": "Vorrei sapere qual è il contenuto della serie sky radio?",
        "q_id": 600
    },
    {
        "db_id": "tvshow",
        "question": "Puoi dirmi qual è l'opzione pacchetto del canale tv con il nome seriale `` sky radio ''?",
        "q_id": 601
    },
    {
        "db_id": "tvshow",
        "question": "Mi puoi dire quali sono le opzioni del pacchetto dei canali tv i cui nomi delle serie sono sky radio?",
        "q_id": 602
    },
    {
        "db_id": "tvshow",
        "question": "Vorrei chiederti quanti canali tv usando l'inglese linguistico?",
        "q_id": 603
    },
    {
        "db_id": "tvshow",
        "question": "Ti posso chiedere quanti canali tv usano la lingua inglese?",
        "q_id": 604
    },
    {
        "db_id": "tvshow",
        "question": "Mi puoi dire elenca il linguaggio utilizzato per il minor numero di canali tv.lingua di elenco e numero di canale tv.",
        "q_id": 605
    },
    {
        "db_id": "tvshow",
        "question": "Puoi dirmi quali sono le lingue utilizzate dal minimo numero di canali tv e quanti canali lo usano?",
        "q_id": 606
    },
    {
        "db_id": "tvshow",
        "question": "Mi puoi dire elenca ogni lingua e il numero di canali tv che la utilizzano.",
        "q_id": 607
    },
    {
        "db_id": "tvshow",
        "question": "Vorrei sapere per ogni lingua, elenca il numero di canali tv che lo utilizzano.",
        "q_id": 608
    },
    {
        "db_id": "tvshow",
        "question": "Per favore dimmi qual è il canale tv che mostra il cartone animato `` the rise of the blue beetle!''?elenca il nome della serie del canale tv.",
        "q_id": 609
    },
    {
        "db_id": "tvshow",
        "question": "Vorrei sapere qual è il nome della serie del canale tv che mostra il cartone animato `` the rise of the blue beetle ''?",
        "q_id": 610
    },
    {
        "db_id": "tvshow",
        "question": "Sai elencare il titolo di tutti i cartoni animati mostrati sul canale tv con il nome della serie `` sky radio ''.",
        "q_id": 611
    },
    {
        "db_id": "tvshow",
        "question": "Vorrei chiederti qual è il titolo di tutti i cartools che si trovano sul canale tv con il nome della serie `` sky radio ''?",
        "q_id": 612
    },
    {
        "db_id": "tvshow",
        "question": "Puoi dirmi elenca l'episodio di tutte le serie tv ordinate per valutazione.",
        "q_id": 613
    },
    {
        "db_id": "tvshow",
        "question": "Vorrei chiederti quali sono tutti gli episodi ordinati dalle valutazioni?",
        "q_id": 614
    },
    {
        "db_id": "tvshow",
        "question": "Mi puoi dire elenco le prime 3 serie tv di valutazione più alta.elenca l'episodio e la valutazione della serie tv.",
        "q_id": 615
    },
    {
        "db_id": "tvshow",
        "question": "Puoi dirmi quali sono i 3 episodi più apprezzati nella tabella delle serie tv e quali erano quelle valutazioni?",
        "q_id": 616
    },
    {
        "db_id": "tvshow",
        "question": "Per favore dimmi qual è la quota minima e massima delle serie tv?",
        "q_id": 617
    },
    {
        "db_id": "tvshow",
        "question": "Per favore dimmi qual è la quota massima e minima per la serie tv?",
        "q_id": 618
    },
    {
        "db_id": "tvshow",
        "question": "Sai qual è la data dell'aria della serie tv con l'episodio `` a love of a lifetime ''?",
        "q_id": 619
    },
    {
        "db_id": "tvshow",
        "question": "Ti posso chiedere quando è stato l'episodio `` un amore per una vita '' '?",
        "q_id": 620
    },
    {
        "db_id": "tvshow",
        "question": "Mi puoi dire qual è il grado settimanale di serie tv con l'episodio `` a love of a lifetime ''?",
        "q_id": 621
    },
    {
        "db_id": "tvshow",
        "question": "Sai qual è il rango settimanale per l'episodio `` a love of a lifetime ''?",
        "q_id": 622
    },
    {
        "db_id": "tvshow",
        "question": "Vorrei sapere qual è il canale tv della serie tv con l'episodio `` a love of a lifetime ''?elenca il nome della serie del canale tv.",
        "q_id": 623
    },
    {
        "db_id": "tvshow",
        "question": "Puoi dirmi qual è il nome della serie che ha l'episodio `` a love of a lifetime ''?",
        "q_id": 624
    },
    {
        "db_id": "tvshow",
        "question": "Per favore dimmi elenca l'episodio di tutte le serie tv mostrate su tv canale con il nome della serie `` sky radio ''.",
        "q_id": 625
    },
    {
        "db_id": "tvshow",
        "question": "Per favore dimmi qual è l'episodio per la serie tv chiamata `` sky radio ''?",
        "q_id": 626
    },
    {
        "db_id": "tvshow",
        "question": "Vorrei chiederti trova il numero di cartoni diretti da ciascuno dei direttori elencati.",
        "q_id": 627
    },
    {
        "db_id": "tvshow",
        "question": "Vorrei sapere quanti cartoni hanno creato ogni regista?",
        "q_id": 628
    },
    {
        "db_id": "tvshow",
        "question": "Mi puoi dire trova il codice di produzione e il canale del cartone animato in onda più recente.",
        "q_id": 629
    },
    {
        "db_id": "tvshow",
        "question": "Vorrei sapere qual è il codice di produzione e il canale del cartone animato più recente?",
        "q_id": 630
    },
    {
        "db_id": "tvshow",
        "question": "Puoi dirmi trova la scelta del pacchetto e il nome della serie del canale tv con tv ad alta definizione.",
        "q_id": 631
    },
    {
        "db_id": "tvshow",
        "question": "Mi puoi dire quali sono le opzioni del pacchetto e il nome della serie per il canale tv che supporta tv ad alta definizione?",
        "q_id": 632
    },
    {
        "db_id": "tvshow",
        "question": "Ti posso chiedere quali canali tv dei paesi stanno giocando un cartone animato scritto da todd casey?",
        "q_id": 633
    },
    {
        "db_id": "tvshow",
        "question": "Sai quali sono i paesi che hanno cartoni animati in tv che sono stati scritti da todd casey?",
        "q_id": 634
    },
    {
        "db_id": "tvshow",
        "question": "Per favore dimmi quali canali tv dei paesi non suonano alcun cartone animato scritto da todd casey?",
        "q_id": 635
    },
    {
        "db_id": "tvshow",
        "question": "Vorrei chiederti quali sono i paesi che non suonano i cartoni animati scritti da todd casey?",
        "q_id": 636
    },
    {
        "db_id": "tvshow",
        "question": "Vorrei sapere trova il nome della serie e il paese del canale televisivo che suona alcuni cartoni diretti da ben jones e michael chang?",
        "q_id": 637
    },
    {
        "db_id": "tvshow",
        "question": "Per favore dimmi qual è il nome della serie e il paese di tutti i canali tv che suonano i cartoni diretti da ben jones e cartoni animati diretti da michael chang?",
        "q_id": 638
    },
    {
        "db_id": "tvshow",
        "question": "Vorrei chiederti trova il rapporto pixel e la nazione dei canali tv che non usano l'inglese.",
        "q_id": 639
    },
    {
        "db_id": "tvshow",
        "question": "Ti posso chiedere qual è l'aspetto pixel e il paese di origine per tutti i canali tv che non usano l'inglese?",
        "q_id": 640
    },
    {
        "db_id": "tvshow",
        "question": "Mi puoi dire trova id dei canali tv che dai paesi in cui hanno più di due canali tv.",
        "q_id": 641
    },
    {
        "db_id": "tvshow",
        "question": "Mi puoi dire quali sono gli id di tutti i canali tv che hanno più di 2 canali tv?",
        "q_id": 642
    },
    {
        "db_id": "tvshow",
        "question": "Vorrei chiederti trova l'id dei canali tv che non suonano alcun cartone animato diretto da ben jones.",
        "q_id": 643
    },
    {
        "db_id": "tvshow",
        "question": "Per favore dimmi quali sono gli id dei canali tv che non hanno cartoni animati diretti da ben jones?",
        "q_id": 644
    },
    {
        "db_id": "tvshow",
        "question": "Mi puoi dire trova l'opzione pacchetto del canale tv che non ha alcun cartone animato diretto da ben jones.",
        "q_id": 645
    },
    {
        "db_id": "tvshow",
        "question": "Sai quali sono le opzioni di pacchetto di tutti i canali tv che non suonano cartoni animati diretti da ben jones?",
        "q_id": 646
    },
    {
        "db_id": "poker_player",
        "question": "Vorrei sapere quanti giocatori di poker ci sono?",
        "q_id": 647
    },
    {
        "db_id": "poker_player",
        "question": "Per favore dimmi conta il numero di giocatori di poker.",
        "q_id": 648
    },
    {
        "db_id": "poker_player",
        "question": "Sai elenca i guadagni dei giocatori di poker in ordine decrescente.",
        "q_id": 649
    },
    {
        "db_id": "poker_player",
        "question": "Ti posso chiedere quali sono i guadagni dei giocatori di poker, ordinato di scendere per valore?",
        "q_id": 650
    },
    {
        "db_id": "poker_player",
        "question": "Vorrei sapere elenca le tabelle finali realizzate e le migliori finiture dei giocatori di poker.",
        "q_id": 651
    },
    {
        "db_id": "poker_player",
        "question": "Vorrei chiederti quali sono i tavoli finali realizzati e le migliori finiture per tutti i giocatori di poker?",
        "q_id": 652
    },
    {
        "db_id": "poker_player",
        "question": "Sai qual è il guadagno medio dei giocatori di poker?",
        "q_id": 653
    },
    {
        "db_id": "poker_player",
        "question": "Sai restituisci i guadagni medi in tutti i giocatori di poker.",
        "q_id": 654
    },
    {
        "db_id": "poker_player",
        "question": "Ti posso chiedere qual è il rango di denaro del giocatore di poker con i guadagni più alti?",
        "q_id": 655
    },
    {
        "db_id": "poker_player",
        "question": "Sai restituisce il grado di denaro del giocatore con i maggiori guadagni.",
        "q_id": 656
    },
    {
        "db_id": "poker_player",
        "question": "Mi puoi dire qual è il numero massimo di tabelle finali realizzate tra i giocatori di poker con guadagni inferiori a 200000?",
        "q_id": 657
    },
    {
        "db_id": "poker_player",
        "question": "Vorrei sapere restituisci i tavoli finali massimi realizzati su tutti i giocatori di poker che hanno guadagni inferiori a 200000.",
        "q_id": 658
    },
    {
        "db_id": "poker_player",
        "question": "Vorrei sapere quali sono i nomi dei giocatori di poker?",
        "q_id": 659
    },
    {
        "db_id": "poker_player",
        "question": "Ti posso chiedere restituisci i nomi di tutti i giocatori di poker.",
        "q_id": 660
    },
    {
        "db_id": "poker_player",
        "question": "Sai quali sono i nomi dei giocatori di poker i cui guadagni sono superiori a 300000?",
        "q_id": 661
    },
    {
        "db_id": "poker_player",
        "question": "Vorrei chiederti dai i nomi dei giocatori di poker che hanno guadagni superiori a 300000.",
        "q_id": 662
    },
    {
        "db_id": "poker_player",
        "question": "Vorrei sapere elenca i nomi dei giocatori di poker ordinati dalle tabelle finali realizzate in ordine crescente.",
        "q_id": 663
    },
    {
        "db_id": "poker_player",
        "question": "Per favore dimmi quali sono i nomi dei giocatori di poker, ordinati ascendenti dal numero di tabelle finali che hanno fatto?",
        "q_id": 664
    },
    {
        "db_id": "poker_player",
        "question": "Puoi dirmi qual è la data di nascita del giocatore di poker con i guadagni più bassi?",
        "q_id": 665
    },
    {
        "db_id": "poker_player",
        "question": "Sai restituisci la data di nascita del giocatore di poker con i guadagni più bassi.",
        "q_id": 666
    },
    {
        "db_id": "poker_player",
        "question": "Vorrei sapere qual è il rango di denaro del giocatore di poker più alto?",
        "q_id": 667
    },
    {
        "db_id": "poker_player",
        "question": "Puoi dirmi restituisci il grado di denaro del giocatore di poker con la massima altezza.",
        "q_id": 668
    },
    {
        "db_id": "poker_player",
        "question": "Ti posso chiedere qual è il guadagno medio dei giocatori di poker con altezza superiore a 200?",
        "q_id": 669
    },
    {
        "db_id": "poker_player",
        "question": "Ti posso chiedere dai guadagni medi di giocatori di poker più alti di 200.",
        "q_id": 670
    },
    {
        "db_id": "poker_player",
        "question": "Vorrei sapere quali sono i nomi dei giocatori di poker in ordine decrescente di guadagni?",
        "q_id": 671
    },
    {
        "db_id": "poker_player",
        "question": "Sai restituisce i nomi dei giocatori di poker ordinati con i loro guadagni discendenti.",
        "q_id": 672
    },
    {
        "db_id": "poker_player",
        "question": "Vorrei sapere quali sono le diverse nazionalità delle persone e il numero corrispondente di persone di ogni nazione?",
        "q_id": 673
    },
    {
        "db_id": "poker_player",
        "question": "Puoi dirmi quante persone ci sono di ogni nazionalità?",
        "q_id": 674
    },
    {
        "db_id": "poker_player",
        "question": "Sai qual è la nazionalità più comune delle persone?",
        "q_id": 675
    },
    {
        "db_id": "poker_player",
        "question": "Mi puoi dire dai la nazionalità che è più comune in tutte le persone.",
        "q_id": 676
    },
    {
        "db_id": "poker_player",
        "question": "Sai quali sono le nazionalità condivise da almeno due persone?",
        "q_id": 677
    },
    {
        "db_id": "poker_player",
        "question": "Ti posso chiedere restituisci le nazionalità per le quali ci sono due o più persone.",
        "q_id": 678
    },
    {
        "db_id": "poker_player",
        "question": "Ti posso chiedere elenca i nomi e le date di nascita delle persone in ordine alfabetico ascendente.",
        "q_id": 679
    },
    {
        "db_id": "poker_player",
        "question": "Puoi dirmi quali sono i nomi e le date di nascita delle persone, ordinate con i loro nomi in ordine alfabetico?",
        "q_id": 680
    },
    {
        "db_id": "poker_player",
        "question": "Puoi dirmi mostra nomi di persone la cui nazionalità non è `` russia ''.",
        "q_id": 681
    },
    {
        "db_id": "poker_player",
        "question": "Vorrei sapere quali sono i nomi delle persone che non sono dalla russia?",
        "q_id": 682
    },
    {
        "db_id": "poker_player",
        "question": "Vorrei chiederti elenca i nomi delle persone che non sono giocatori di poker.",
        "q_id": 683
    },
    {
        "db_id": "poker_player",
        "question": "Vorrei sapere quali sono i nomi delle persone che non giocano a poker?",
        "q_id": 684
    },
    {
        "db_id": "poker_player",
        "question": "Sai quante nazionalità distinte ci sono?",
        "q_id": 685
    },
    {
        "db_id": "poker_player",
        "question": "Ti posso chiedere conta il numero di diverse nazionalità.",
        "q_id": 686
    },
    {
        "db_id": "voter_1",
        "question": "Vorrei sapere quanti stati ci sono?",
        "q_id": 687
    },
    {
        "db_id": "voter_1",
        "question": "Vorrei chiederti elenca i numeri e i nomi dei concorrenti, ordinati dal nome del concorrente discendente.",
        "q_id": 688
    },
    {
        "db_id": "voter_1",
        "question": "Puoi dirmi elenca gli id voti, i numeri di telefono e gli stati di tutti i voti.",
        "q_id": 689
    },
    {
        "db_id": "voter_1",
        "question": "Vorrei chiederti quali sono i valori massimi e minimi dei codici di area?",
        "q_id": 690
    },
    {
        "db_id": "voter_1",
        "question": "Sai qual è l'ultima data creata dai voti dallo stato \"ca\"?",
        "q_id": 691
    },
    {
        "db_id": "voter_1",
        "question": "Puoi dirmi quali sono i nomi dei concorrenti i cui nomi non sono \"jessie abilit\"",
        "q_id": 692
    },
    {
        "db_id": "voter_1",
        "question": "Mi puoi dire quali sono gli stati distinti e creare tempo di tutti i voti?",
        "q_id": 693
    },
    {
        "db_id": "voter_1",
        "question": "Mi puoi dire quali sono i numeri dei concorrenti e i nomi dei concorrenti che hanno avuto almeno due voti?",
        "q_id": 694
    },
    {
        "db_id": "voter_1",
        "question": "Puoi dirmi di tutti i concorrenti che sono stati votati, qual è il numero del concorrente e il nome del concorrente che ha ottenuto il minimo voto?",
        "q_id": 695
    },
    {
        "db_id": "voter_1",
        "question": "Mi puoi dire qual è il numero di voti dello stato \"ny\" o \"ca\"?",
        "q_id": 696
    },
    {
        "db_id": "voter_1",
        "question": "Vorrei sapere quanti concorrenti non sono stati votati?",
        "q_id": 697
    },
    {
        "db_id": "voter_1",
        "question": "Vorrei chiederti qual è il codice di area in cui ha votato la maggior parte degli elettori?",
        "q_id": 698
    },
    {
        "db_id": "voter_1",
        "question": "Puoi dirmi quali sono le date di creazione, gli stati e i numeri di telefono dei voti che erano per il concorrente chiamato \"tabatha gehling\"?",
        "q_id": 699
    },
    {
        "db_id": "voter_1",
        "question": "Puoi dirmi elenca i codici di area in cui gli elettori hanno votato sia per il concorrente \"tabatha gehling\" sia per il concorrente \"kelly clauss\".",
        "q_id": 700
    },
    {
        "db_id": "voter_1",
        "question": "Ti posso chiedere restituisci i nomi dei concorrenti i cui nomi contengono la sottostringa \"al\".",
        "q_id": 701
    },
    {
        "db_id": "world_1",
        "question": "Per favore dimmi quali sono i nomi di tutti i paesi che sono diventati indipendenti dopo il 1950?",
        "q_id": 702
    },
    {
        "db_id": "world_1",
        "question": "Ti posso chiedere dai i nomi delle nazioni che furono fondate dopo il 1950.",
        "q_id": 703
    },
    {
        "db_id": "world_1",
        "question": "Per favore dimmi quanti paesi hanno una repubblica come forma di governo?",
        "q_id": 704
    },
    {
        "db_id": "world_1",
        "question": "Mi puoi dire quanti paesi hanno governi che sono repubbliche?",
        "q_id": 705
    },
    {
        "db_id": "world_1",
        "question": "Per favore dimmi qual è la superficie totale dei paesi nella regione dei caraibi?",
        "q_id": 706
    },
    {
        "db_id": "world_1",
        "question": "Vorrei sapere quanta superficie fanno i paesi nella copertura dei caraibi?",
        "q_id": 707
    },
    {
        "db_id": "world_1",
        "question": "Mi puoi dire in quale continente si trova anguilla?",
        "q_id": 708
    },
    {
        "db_id": "world_1",
        "question": "Ti posso chiedere qual è il nome del continente a cui appartiene anguilla?",
        "q_id": 709
    },
    {
        "db_id": "world_1",
        "question": "Vorrei sapere in quale regione si trova la città di kabul?",
        "q_id": 710
    },
    {
        "db_id": "world_1",
        "question": "Ti posso chiedere in che regione si trova kabul?",
        "q_id": 711
    },
    {
        "db_id": "world_1",
        "question": "Puoi dirmi quale lingua è la più popolare in aruba?",
        "q_id": 712
    },
    {
        "db_id": "world_1",
        "question": "Vorrei sapere quale lingua si parla prevalentemente in aruba?",
        "q_id": 713
    },
    {
        "db_id": "world_1",
        "question": "Vorrei chiederti quali sono le aspettative di popolazione e vita in brasile?",
        "q_id": 714
    },
    {
        "db_id": "world_1",
        "question": "Per favore dimmi dammi la popolazione del brasile e le aspettative di vita.",
        "q_id": 715
    },
    {
        "db_id": "world_1",
        "question": "Mi puoi dire quali sono la regione e la popolazione dell'angola?",
        "q_id": 716
    },
    {
        "db_id": "world_1",
        "question": "Per favore dimmi a quale regione appartiene l'angola e qual è la sua popolazione?",
        "q_id": 717
    },
    {
        "db_id": "world_1",
        "question": "Puoi dirmi qual è l'aspettativa di vita media prevista per i paesi nella regione dell'africa centrale?",
        "q_id": 718
    },
    {
        "db_id": "world_1",
        "question": "Mi puoi dire quanto dura l'aspettativa di vita media delle persone in africa centrale?",
        "q_id": 719
    },
    {
        "db_id": "world_1",
        "question": "Mi puoi dire qual è il nome del paese che ha la più breve aspettativa di vita in asia?",
        "q_id": 720
    },
    {
        "db_id": "world_1",
        "question": "Mi puoi dire dai il nome del paese in asia con la più bassa aspettativa di vita.",
        "q_id": 721
    },
    {
        "db_id": "world_1",
        "question": "Mi puoi dire qual è la popolazione totale e il massimo pil in asia?",
        "q_id": 722
    },
    {
        "db_id": "world_1",
        "question": "Per favore dimmi quante persone vivono in asia e qual è il più grande gnp tra loro?",
        "q_id": 723
    },
    {
        "db_id": "world_1",
        "question": "Sai qual è l'aspettativa di vita media nei paesi africani che sono repubbliche?",
        "q_id": 724
    },
    {
        "db_id": "world_1",
        "question": "Sai dai l'aspettativa di vita media per i paesi in africa quali sono le repubbliche?",
        "q_id": 725
    },
    {
        "db_id": "world_1",
        "question": "Per favore dimmi qual è la superficie totale dei continenti asia e europa?",
        "q_id": 726
    },
    {
        "db_id": "world_1",
        "question": "Vorrei chiederti dai la superficie totale coperta da paesi in asia o in europa.",
        "q_id": 727
    },
    {
        "db_id": "world_1",
        "question": "Sai quante persone vivono nel distretto di gelderland?",
        "q_id": 728
    },
    {
        "db_id": "world_1",
        "question": "Vorrei chiederti qual è la popolazione totale del distretto di gelderland?",
        "q_id": 729
    },
    {
        "db_id": "world_1",
        "question": "Vorrei sapere qual è il pil medio e la popolazione totale in tutte le nazioni il cui governo è il territorio degli stati uniti?",
        "q_id": 730
    },
    {
        "db_id": "world_1",
        "question": "Mi puoi dire dai il pil medio e la popolazione totale di nazioni che sono considerati territorio statunitense.",
        "q_id": 731
    },
    {
        "db_id": "world_1",
        "question": "Puoi dirmi quante lingue uniche sono parlate nel mondo?",
        "q_id": 732
    },
    {
        "db_id": "world_1",
        "question": "Sai qual è il numero di lingue distinte usate in tutto il mondo?",
        "q_id": 733
    },
    {
        "db_id": "world_1",
        "question": "Puoi dirmi quanti tipi di governi sono in africa?",
        "q_id": 734
    },
    {
        "db_id": "world_1",
        "question": "Per favore dimmi quante diverse forme di governi ci sono in africa?",
        "q_id": 735
    },
    {
        "db_id": "world_1",
        "question": "Vorrei chiederti qual è il numero totale di lingue utilizzate in aruba?",
        "q_id": 736
    },
    {
        "db_id": "world_1",
        "question": "Vorrei chiederti quante lingue sono parlate in aruba?",
        "q_id": 737
    },
    {
        "db_id": "world_1",
        "question": "Vorrei sapere quante lingue ufficiali ha l'afghanistan?",
        "q_id": 738
    },
    {
        "db_id": "world_1",
        "question": "Puoi dirmi quante lingue ufficiali sono pronunciate in afghanistan?",
        "q_id": 739
    },
    {
        "db_id": "world_1",
        "question": "Mi puoi dire qual è il nome del paese che parla il maggior numero di lingue?",
        "q_id": 740
    },
    {
        "db_id": "world_1",
        "question": "Mi puoi dire dai il nome della nazione che usa la massima quantità di lingue.",
        "q_id": 741
    },
    {
        "db_id": "world_1",
        "question": "Sai quale continente ha le lingue più diverse?",
        "q_id": 742
    },
    {
        "db_id": "world_1",
        "question": "Per favore dimmi quale continente parla più lingue?",
        "q_id": 743
    },
    {
        "db_id": "world_1",
        "question": "Mi puoi dire quanti paesi parlano sia inglese che olandese?",
        "q_id": 744
    },
    {
        "db_id": "world_1",
        "question": "Puoi dirmi qual è il numero di nazioni che usano l'inglese e l'olandese?",
        "q_id": 745
    },
    {
        "db_id": "world_1",
        "question": "Mi puoi dire quali sono i nomi delle nazioni parlano sia inglese che francese?",
        "q_id": 746
    },
    {
        "db_id": "world_1",
        "question": "Vorrei sapere dai i nomi delle nazioni che parlano sia inglese che francese.",
        "q_id": 747
    },
    {
        "db_id": "world_1",
        "question": "Vorrei chiederti quali sono i nomi delle nazioni in cui inglesi e francesi sono lingue ufficiali?",
        "q_id": 748
    },
    {
        "db_id": "world_1",
        "question": "Vorrei sapere dai i nomi dei paesi con inglese e francese come lingue ufficiali.",
        "q_id": 749
    },
    {
        "db_id": "world_1",
        "question": "Puoi dirmi qual è il numero di continenti distinti in cui si parla cinese?",
        "q_id": 750
    },
    {
        "db_id": "world_1",
        "question": "Mi puoi dire quanti continenti parlano cinese?",
        "q_id": 751
    },
    {
        "db_id": "world_1",
        "question": "Puoi dirmi quali sono le regioni che usano l'inglese o l'olandese?",
        "q_id": 752
    },
    {
        "db_id": "world_1",
        "question": "Per favore dimmi quali regioni parlano olandese o inglese?",
        "q_id": 753
    },
    {
        "db_id": "world_1",
        "question": "Ti posso chiedere quali sono i paesi in cui l'inglese o l'olandese è la lingua ufficiale?",
        "q_id": 754
    },
    {
        "db_id": "world_1",
        "question": "Vorrei chiederti quali paesi hanno inglese o olandese come lingua ufficiale?",
        "q_id": 755
    },
    {
        "db_id": "world_1",
        "question": "Vorrei chiederti quale lingua è la più popolare nel continente asiatico?",
        "q_id": 756
    },
    {
        "db_id": "world_1",
        "question": "Per favore dimmi qual è la lingua che viene utilizzata dal maggior numero di nazioni asiatiche?",
        "q_id": 757
    },
    {
        "db_id": "world_1",
        "question": "Per favore dimmi quali lingue sono parlate da un solo paese nei governi della repubblica?",
        "q_id": 758
    },
    {
        "db_id": "world_1",
        "question": "Mi puoi dire quali lingue vengono utilizzate solo da un singolo paese con un governo della repubblica?",
        "q_id": 759
    },
    {
        "db_id": "world_1",
        "question": "Mi puoi dire trova la città con la popolazione più grande che usa l'inglese.",
        "q_id": 760
    },
    {
        "db_id": "world_1",
        "question": "Vorrei sapere qual è la città più popolare che parla inglese?",
        "q_id": 761
    },
    {
        "db_id": "world_1",
        "question": "Vorrei chiederti trova il nome, la popolazione e la lunghezza della vita attesa del paese asiatico con la più grande area?",
        "q_id": 762
    },
    {
        "db_id": "world_1",
        "question": "Vorrei chiederti qual è il nome, la popolazione e l'aspettativa di vita del più grande paese asiatico per terra?",
        "q_id": 763
    },
    {
        "db_id": "world_1",
        "question": "Per favore dimmi qual è l'aspettativa di vita media nei paesi in cui l'inglese non è la lingua ufficiale?",
        "q_id": 764
    },
    {
        "db_id": "world_1",
        "question": "Puoi dirmi dai l'aspettativa di vita media dei paesi in cui l'inglese non è la lingua ufficiale.",
        "q_id": 765
    },
    {
        "db_id": "world_1",
        "question": "Mi puoi dire qual è il numero totale di persone che vivono nelle nazioni che non usano l'inglese?",
        "q_id": 766
    },
    {
        "db_id": "world_1",
        "question": "Ti posso chiedere quante persone vivono in paesi che non parlano inglese?",
        "q_id": 767
    },
    {
        "db_id": "world_1",
        "question": "Puoi dirmi qual è la lingua ufficiale parlata nel paese il cui capo di stato è beatrix?",
        "q_id": 768
    },
    {
        "db_id": "world_1",
        "question": "Sai qual è la lingua ufficiale usata nel paese il nome del cui capo di stato è beatrix.",
        "q_id": 769
    },
    {
        "db_id": "world_1",
        "question": "Sai qual è il numero totale di lingue ufficiali uniche parlate nei paesi che si fondono prima del 1930?",
        "q_id": 770
    },
    {
        "db_id": "world_1",
        "question": "Ti posso chiedere per i paesi fondati prima del 1930, qual è il numero totale di lingue ufficiali distinte?",
        "q_id": 771
    },
    {
        "db_id": "world_1",
        "question": "Vorrei sapere quali sono i paesi che hanno una superficie maggiore di qualsiasi paese in europa?",
        "q_id": 772
    },
    {
        "db_id": "world_1",
        "question": "Puoi dirmi quali paesi hanno un'area maggiore di quella di qualsiasi paese in europa?",
        "q_id": 773
    },
    {
        "db_id": "world_1",
        "question": "Sai quali sono i paesi africani che hanno una popolazione inferiore a qualsiasi paese in asia?",
        "q_id": 774
    },
    {
        "db_id": "world_1",
        "question": "Vorrei sapere quali paesi africani hanno una popolazione più piccola di quella di qualsiasi paese in asia?",
        "q_id": 775
    },
    {
        "db_id": "world_1",
        "question": "Mi puoi dire quali paesi asiatici hanno una popolazione più grande di qualsiasi paese in africa?",
        "q_id": 776
    },
    {
        "db_id": "world_1",
        "question": "Per favore dimmi quali sono i paesi asiatici che hanno una popolazione più grande di quella di qualsiasi paese in africa?",
        "q_id": 777
    },
    {
        "db_id": "world_1",
        "question": "Ti posso chiedere quali sono i codici nazionali per i paesi che non parlano inglese?",
        "q_id": 778
    },
    {
        "db_id": "world_1",
        "question": "Puoi dirmi restituisci i codici del paese per i paesi che non parlano inglese.",
        "q_id": 779
    },
    {
        "db_id": "world_1",
        "question": "Vorrei sapere quali sono i codici nazionali dei paesi in cui le persone usano lingue diverse dall'inglese?",
        "q_id": 780
    },
    {
        "db_id": "world_1",
        "question": "Vorrei sapere dai i codici del paese per i paesi in cui le persone parlano lingue che non sono inglesi.",
        "q_id": 781
    },
    {
        "db_id": "world_1",
        "question": "Sai quali sono i codici dei paesi che non parlano inglese e le cui forme governative non sono repubbliche?",
        "q_id": 782
    },
    {
        "db_id": "world_1",
        "question": "Mi puoi dire restituisci i codici dei paesi che non parlano inglese e non hanno repubbliche per i governi.",
        "q_id": 783
    },
    {
        "db_id": "world_1",
        "question": "Puoi dirmi quali città sono nei paesi europei in cui l'inglese non è la lingua ufficiale?",
        "q_id": 784
    },
    {
        "db_id": "world_1",
        "question": "Sai quali sono i nomi delle città in europa per quale inglese non è la lingua ufficiale?",
        "q_id": 785
    },
    {
        "db_id": "world_1",
        "question": "Per favore dimmi quali città uniche si trovano nei paesi asiatici in cui i cinesi sono la lingua ufficiale?",
        "q_id": 786
    },
    {
        "db_id": "world_1",
        "question": "Mi puoi dire restituisci i diversi nomi delle città che si trovano in asia e per le quali il cinese è la lingua ufficiale.",
        "q_id": 787
    },
    {
        "db_id": "world_1",
        "question": "Vorrei chiederti qual è il nome, l'anno di indipendenza e la superficie del paese con la popolazione più piccola?",
        "q_id": 788
    },
    {
        "db_id": "world_1",
        "question": "Puoi dirmi dai il nome, l'anno di indipendenza e la superficie del paese che ha la popolazione più bassa.",
        "q_id": 789
    },
    {
        "db_id": "world_1",
        "question": "Per favore dimmi quali sono la popolazione, il nome e il leader del paese con la più grande area?",
        "q_id": 790
    },
    {
        "db_id": "world_1",
        "question": "Vorrei sapere dai il nome, la popolazione e il capo di stato per il paese che ha la più grande area.",
        "q_id": 791
    },
    {
        "db_id": "world_1",
        "question": "Sai restituisci il nome del paese e il numero di lingue parlate per ogni paese che parla almeno 3 lingue.",
        "q_id": 792
    },
    {
        "db_id": "world_1",
        "question": "Puoi dirmi quali sono i nomi dei paesi che parlano più di 2 lingue, nonché quante lingue parlano?",
        "q_id": 793
    },
    {
        "db_id": "world_1",
        "question": "Sai trova il numero di città in ogni distretto la cui popolazione è maggiore della popolazione media delle città?",
        "q_id": 794
    },
    {
        "db_id": "world_1",
        "question": "Per favore dimmi quante città in ogni distretto hanno una popolazione al di sopra della popolazione media in tutte le città?",
        "q_id": 795
    },
    {
        "db_id": "world_1",
        "question": "Puoi dirmi trova il nome del modulo del governo e la popolazione totale per ogni forma del governo la cui aspettativa di vita media è più lunga di 72.",
        "q_id": 796
    },
    {
        "db_id": "world_1",
        "question": "Sai quali sono le diverse forme del governo e qual è la popolazione totale di ciascuno per le forme governative che hanno un'aspettativa di vita media superiore a 72?",
        "q_id": 797
    },
    {
        "db_id": "world_1",
        "question": "Puoi dirmi trova l'aspettativa di vita media e la popolazione totale per ogni continente in cui l'aspettativa di vita media è inferiore a 72?",
        "q_id": 798
    },
    {
        "db_id": "world_1",
        "question": "Vorrei sapere quali sono i diversi continenti e la popolazione totale e l'aspettativa di vita media corrispondenti a ciascuno, per i continenti che hanno un'aspettativa di vita media inferiore a 72?",
        "q_id": 799
    },
    {
        "db_id": "world_1",
        "question": "Vorrei chiederti quali sono i nomi e le aree dei paesi con le prime 5 aree più grandi?",
        "q_id": 800
    },
    {
        "db_id": "world_1",
        "question": "Per favore dimmi restituisci i nomi e le aree di superficie dei 5 paesi più grandi.",
        "q_id": 801
    },
    {
        "db_id": "world_1",
        "question": "Ti posso chiedere quali sono i nomi dei paesi con le prime 3 popolazioni più grandi?",
        "q_id": 802
    },
    {
        "db_id": "world_1",
        "question": "Vorrei sapere restituisci i nomi dei 3 paesi più popolati.",
        "q_id": 803
    },
    {
        "db_id": "world_1",
        "question": "Ti posso chiedere quali sono i nomi delle nazioni con le 3 popolazioni più basse?",
        "q_id": 804
    },
    {
        "db_id": "world_1",
        "question": "Ti posso chiedere restituisci i nomi dei 3 paesi con il minor numero di persone.",
        "q_id": 805
    },
    {
        "db_id": "world_1",
        "question": "Per favore dimmi quanti paesi sono in asia?",
        "q_id": 806
    },
    {
        "db_id": "world_1",
        "question": "Puoi dirmi contare il numero di paesi in asia.",
        "q_id": 807
    },
    {
        "db_id": "world_1",
        "question": "Sai quali sono i nomi dei paesi che si trovano nel continente europeo e hanno una popolazione di 80000?",
        "q_id": 808
    },
    {
        "db_id": "world_1",
        "question": "Vorrei chiederti dai i nomi dei paesi in europa e hanno una popolazione pari a 80000.",
        "q_id": 809
    },
    {
        "db_id": "world_1",
        "question": "Vorrei chiederti qual è la popolazione totale e l'area media dei paesi nel continente del nord america la cui area è maggiore di 3000?",
        "q_id": 810
    },
    {
        "db_id": "world_1",
        "question": "Puoi dirmi fornire la popolazione totale e la superficie media corrispondente ai paesi del nord america che hanno una superficie superiore a 3000.",
        "q_id": 811
    },
    {
        "db_id": "world_1",
        "question": "Puoi dirmi quali sono le città la cui popolazione è tra il 160000 e il 900000?",
        "q_id": 812
    },
    {
        "db_id": "world_1",
        "question": "Ti posso chiedere restituisci i nomi delle città che hanno una popolazione tra il 160000 e il 900000.",
        "q_id": 813
    },
    {
        "db_id": "world_1",
        "question": "Vorrei sapere quale lingua è parlata dal maggior numero di paesi?",
        "q_id": 814
    },
    {
        "db_id": "world_1",
        "question": "Vorrei chiederti dai la lingua parlata nella maggior parte dei paesi.",
        "q_id": 815
    },
    {
        "db_id": "world_1",
        "question": "Puoi dirmi qual è la lingua parlata dalla più grande percentuale di persone in ogni paese?",
        "q_id": 816
    },
    {
        "db_id": "world_1",
        "question": "Vorrei chiederti quali sono i codici nazionali dei diversi paesi e quali sono le lingue parlate dalla più grande percentuale di persone per ciascuno?",
        "q_id": 817
    },
    {
        "db_id": "world_1",
        "question": "Sai qual è il numero totale di paesi in cui lo spagnolo è parlato dalla più grande percentuale di persone?",
        "q_id": 818
    },
    {
        "db_id": "world_1",
        "question": "Sai conta il numero di paesi per i quali lo spagnolo è la lingua prevalentemente parlata.",
        "q_id": 819
    },
    {
        "db_id": "world_1",
        "question": "Sai quali sono i codici dei paesi in cui lo spagnolo è parlato dalla più grande percentuale di persone?",
        "q_id": 820
    },
    {
        "db_id": "world_1",
        "question": "Vorrei sapere restituisci i codici dei paesi per i quali lo spagnolo è la lingua prevalentemente parlata.",
        "q_id": 821
    },
    {
        "db_id": "orchestra",
        "question": "Puoi dirmi quanti conduttori ci sono?",
        "q_id": 822
    },
    {
        "db_id": "orchestra",
        "question": "Per favore dimmi contare il numero di conduttori.",
        "q_id": 823
    },
    {
        "db_id": "orchestra",
        "question": "Ti posso chiedere elencare i nomi dei conduttori in ordine di età crescente.",
        "q_id": 824
    },
    {
        "db_id": "orchestra",
        "question": "Mi puoi dire quali sono i nomi dei conduttori, ordinati per età?",
        "q_id": 825
    },
    {
        "db_id": "orchestra",
        "question": "Vorrei sapere quali sono i nomi dei conduttori le cui nazionalità non sono `` usa ''?",
        "q_id": 826
    },
    {
        "db_id": "orchestra",
        "question": "Vorrei chiederti restituisci i nomi dei conduttori che non hanno la nazionalità `` usa ''.",
        "q_id": 827
    },
    {
        "db_id": "orchestra",
        "question": "Vorrei sapere quali sono le case discografiche delle orchestre in ordine decrescente in cui sono state fondate?",
        "q_id": 828
    },
    {
        "db_id": "orchestra",
        "question": "Vorrei chiederti restituire le case discografiche delle orchestre, ordinate scendendo negli anni in cui sono state fondate.",
        "q_id": 829
    },
    {
        "db_id": "orchestra",
        "question": "Per favore dimmi qual è la frequenza media degli spettacoli?",
        "q_id": 830
    },
    {
        "db_id": "orchestra",
        "question": "Vorrei chiederti restituisci la frequenza media in tutti gli spettacoli.",
        "q_id": 831
    },
    {
        "db_id": "orchestra",
        "question": "Ti posso chiedere quali sono la quota massima e minima di spettacoli il cui tipo non è `` live final ''.",
        "q_id": 832
    },
    {
        "db_id": "orchestra",
        "question": "Vorrei sapere restituisci le azioni massime e minime per spettacoli che non hanno il tipo `` in diretta \".",
        "q_id": 833
    },
    {
        "db_id": "orchestra",
        "question": "Vorrei chiederti quante nazionalità diverse hanno i conduttori?",
        "q_id": 834
    },
    {
        "db_id": "orchestra",
        "question": "Vorrei sapere contare il numero di diverse nazionalità dei conduttori.",
        "q_id": 835
    },
    {
        "db_id": "orchestra",
        "question": "Sai elenco i nomi dei conduttori in ordine decrescente di anni di lavoro.",
        "q_id": 836
    },
    {
        "db_id": "orchestra",
        "question": "Puoi dirmi quali sono i nomi dei conduttori, ordinati scendendo per il numero di anni che hanno lavorato?",
        "q_id": 837
    },
    {
        "db_id": "orchestra",
        "question": "Sai elenca il nome del conduttore con la maggior parte degli anni di lavoro.",
        "q_id": 838
    },
    {
        "db_id": "orchestra",
        "question": "Mi puoi dire qual è il nome del direttore che ha lavorato il maggior numero di anni?",
        "q_id": 839
    },
    {
        "db_id": "orchestra",
        "question": "Vorrei sapere mostra i nomi dei conduttori e delle orchestre che hanno condotto.",
        "q_id": 840
    },
    {
        "db_id": "orchestra",
        "question": "Vorrei chiederti quali sono i nomi dei conduttori e le corrispondenti orchestre che hanno condotto?",
        "q_id": 841
    },
    {
        "db_id": "orchestra",
        "question": "Vorrei sapere mostra i nomi dei conduttori che hanno condotto più di una orchestre.",
        "q_id": 842
    },
    {
        "db_id": "orchestra",
        "question": "Ti posso chiedere quali sono i nomi dei conduttori che hanno condotto in più di un'orchestra?",
        "q_id": 843
    },
    {
        "db_id": "orchestra",
        "question": "Ti posso chiedere mostra il nome del conduttore che ha condotto il maggior numero di orchestre.",
        "q_id": 844
    },
    {
        "db_id": "orchestra",
        "question": "Vorrei sapere qual è il nome del direttore che ha condotto più orchestre?",
        "q_id": 845
    },
    {
        "db_id": "orchestra",
        "question": "Ti posso chiedere si prega di mostrare il nome del conduttore che ha condotto orchestre fondate dopo il 2008.",
        "q_id": 846
    },
    {
        "db_id": "orchestra",
        "question": "Ti posso chiedere quali sono i nomi dei conduttori che hanno condotto orchestre fondate dopo l'anno 2008?",
        "q_id": 847
    },
    {
        "db_id": "orchestra",
        "question": "Ti posso chiedere mostra le diverse case discografiche e il numero corrispondente di orchestre.",
        "q_id": 848
    },
    {
        "db_id": "orchestra",
        "question": "Mi puoi dire quante orchestre gestisce ogni casa discografica?",
        "q_id": 849
    },
    {
        "db_id": "orchestra",
        "question": "Per favore dimmi si prega di mostrare i formati di record delle orchestre in ordine di conteggio ascendente.",
        "q_id": 850
    },
    {
        "db_id": "orchestra",
        "question": "Puoi dirmi quali sono i principali formati di record di orchestre, ordinati per la loro frequenza?",
        "q_id": 851
    },
    {
        "db_id": "orchestra",
        "question": "Per favore dimmi elencare la casa discografica condivisa dal maggior numero di orchestre.",
        "q_id": 852
    },
    {
        "db_id": "orchestra",
        "question": "Per favore dimmi qual è la casa discografica utilizzata dal maggior numero di orchestre?",
        "q_id": 853
    },
    {
        "db_id": "orchestra",
        "question": "Vorrei sapere elenca i nomi delle orchestre che non hanno prestazioni.",
        "q_id": 854
    },
    {
        "db_id": "orchestra",
        "question": "Mi puoi dire quali sono le orchestre che non hanno prestazioni?",
        "q_id": 855
    },
    {
        "db_id": "orchestra",
        "question": "Sai mostra le case discografiche condivise da orchestre fondate prima del 2003 e dopo il 2003.",
        "q_id": 856
    },
    {
        "db_id": "orchestra",
        "question": "Puoi dirmi quali sono le case discografiche utilizzate da entrambe le orchestre fondate prima del 2003 e quelle fondate dopo il 2003?",
        "q_id": 857
    },
    {
        "db_id": "orchestra",
        "question": "Per favore dimmi trova il numero di orchestre il cui formato record è `` cd '' o `` dvd ''.",
        "q_id": 858
    },
    {
        "db_id": "orchestra",
        "question": "Vorrei sapere conta il numero di orchestre che hanno cd o dvd come formato record.",
        "q_id": 859
    },
    {
        "db_id": "orchestra",
        "question": "Per favore dimmi mostra gli anni in cui vengono fondate orchestre che hanno dato più di una performance.",
        "q_id": 860
    },
    {
        "db_id": "orchestra",
        "question": "Mi puoi dire quali sono gli anni di fondazione per le orchestre che hanno avuto più di una singola performance?",
        "q_id": 861
    },
    {
        "db_id": "network_1",
        "question": "Vorrei sapere quanti licei ci sono?",
        "q_id": 862
    },
    {
        "db_id": "network_1",
        "question": "Puoi dirmi conta il numero di licei.",
        "q_id": 863
    },
    {
        "db_id": "network_1",
        "question": "Mi puoi dire mostra i nomi e i voti di ogni liceo.",
        "q_id": 864
    },
    {
        "db_id": "network_1",
        "question": "Puoi dirmi quali sono i nomi e i voti per ogni liceo?",
        "q_id": 865
    },
    {
        "db_id": "network_1",
        "question": "Sai mostra tutti i gradi dei licei.",
        "q_id": 866
    },
    {
        "db_id": "network_1",
        "question": "Per favore dimmi qual è il voto di ogni liceo?",
        "q_id": 867
    },
    {
        "db_id": "network_1",
        "question": "Sai in che voto è kyle?",
        "q_id": 868
    },
    {
        "db_id": "network_1",
        "question": "Ti posso chiedere restituisci il voto per il liceo di nome kyle.",
        "q_id": 869
    },
    {
        "db_id": "network_1",
        "question": "Vorrei chiederti mostra i nomi di tutti i licei di grado 10.",
        "q_id": 870
    },
    {
        "db_id": "network_1",
        "question": "Vorrei sapere quali sono i nomi di tutti i licei di grado 10?",
        "q_id": 871
    },
    {
        "db_id": "network_1",
        "question": "Ti posso chiedere mostra l'id del liceo di nome kyle.",
        "q_id": 872
    },
    {
        "db_id": "network_1",
        "question": "Ti posso chiedere qual è l'id di kyle?",
        "q_id": 873
    },
    {
        "db_id": "network_1",
        "question": "Sai quanti licei ci sono in grado 9 o 10?",
        "q_id": 874
    },
    {
        "db_id": "network_1",
        "question": "Puoi dirmi conta il numero di liceali nei gradi 9 o 10.",
        "q_id": 875
    },
    {
        "db_id": "network_1",
        "question": "Vorrei chiederti mostra il numero di liceali per ogni grado.",
        "q_id": 876
    },
    {
        "db_id": "network_1",
        "question": "Vorrei sapere quanti licei ci sono in ogni grado?",
        "q_id": 877
    },
    {
        "db_id": "network_1",
        "question": "Mi puoi dire quale voto ha più liceali?",
        "q_id": 878
    },
    {
        "db_id": "network_1",
        "question": "Sai restituisci il voto che ha il maggior numero di liceali.",
        "q_id": 879
    },
    {
        "db_id": "network_1",
        "question": "Sai mostrami tutti i voti che hanno almeno 4 studenti.",
        "q_id": 880
    },
    {
        "db_id": "network_1",
        "question": "Sai quali voti hanno 4 o più liceali?",
        "q_id": 881
    },
    {
        "db_id": "network_1",
        "question": "Puoi dirmi mostra gli id studenti e il numero di amici corrispondenti a ciascuno.",
        "q_id": 882
    },
    {
        "db_id": "network_1",
        "question": "Vorrei sapere quanti amici ha ogni studente?",
        "q_id": 883
    },
    {
        "db_id": "network_1",
        "question": "Sai mostra i nomi degli studenti delle scuole superiori e il loro corrispondente numero di amici.",
        "q_id": 884
    },
    {
        "db_id": "network_1",
        "question": "Mi puoi dire quali sono i nomi dei licei e quanti amici hanno ciascuno?",
        "q_id": 885
    },
    {
        "db_id": "network_1",
        "question": "Sai qual è il nome del liceo che ha il maggior numero di amici?",
        "q_id": 886
    },
    {
        "db_id": "network_1",
        "question": "Per favore dimmi restituisci il nome dello studente delle scuole superiori con la maggior parte degli amici.",
        "q_id": 887
    },
    {
        "db_id": "network_1",
        "question": "Per favore dimmi mostra i nomi dei licei che hanno almeno 3 amici.",
        "q_id": 888
    },
    {
        "db_id": "network_1",
        "question": "Puoi dirmi quali sono i nomi dei liceali che hanno 3 o più amici?",
        "q_id": 889
    },
    {
        "db_id": "network_1",
        "question": "Vorrei sapere mostra i nomi di tutti gli amici del liceo kyle.",
        "q_id": 890
    },
    {
        "db_id": "network_1",
        "question": "Ti posso chiedere restituisci i nomi degli amici dello studente del liceo kyle.",
        "q_id": 891
    },
    {
        "db_id": "network_1",
        "question": "Sai quanti amici ha lo studente del liceo kyle?",
        "q_id": 892
    },
    {
        "db_id": "network_1",
        "question": "Mi puoi dire conta il numero di amici che kyle ha.",
        "q_id": 893
    },
    {
        "db_id": "network_1",
        "question": "Vorrei chiederti mostra id di tutti gli studenti che non hanno amici.",
        "q_id": 894
    },
    {
        "db_id": "network_1",
        "question": "Vorrei chiederti quali sono gli id degli studenti delle scuole superiori che non hanno amici?",
        "q_id": 895
    },
    {
        "db_id": "network_1",
        "question": "Ti posso chiedere mostra nomi di tutti gli studenti delle scuole superiori che non hanno amici.",
        "q_id": 896
    },
    {
        "db_id": "network_1",
        "question": "Per favore dimmi quali sono i nomi degli studenti che non hanno amici?",
        "q_id": 897
    },
    {
        "db_id": "network_1",
        "question": "Ti posso chiedere mostra gli id dei licei che hanno amici e sono anche apprezzati da qualcun altro.",
        "q_id": 898
    },
    {
        "db_id": "network_1",
        "question": "Ti posso chiedere quali sono gli id degli studenti che hanno entrambi amici e che sono apprezzati?",
        "q_id": 899
    },
    {
        "db_id": "network_1",
        "question": "Ti posso chiedere mostra il nome di tutti gli studenti che hanno alcuni amici e anche per qualcun altro.",
        "q_id": 900
    },
    {
        "db_id": "network_1",
        "question": "Ti posso chiedere quali sono i nomi dei licei che hanno entrambi amici e che sono piaciuti?",
        "q_id": 901
    },
    {
        "db_id": "network_1",
        "question": "Vorrei sapere conta il numero di mi piace per ogni id studente.",
        "q_id": 902
    },
    {
        "db_id": "network_1",
        "question": "Ti posso chiedere quanti mi piace corrispondono a ciascun id studente?",
        "q_id": 903
    },
    {
        "db_id": "network_1",
        "question": "Puoi dirmi mostra i nomi dei licei che hanno i mi piace e un numero di mi piace per ciascuno.",
        "q_id": 904
    },
    {
        "db_id": "network_1",
        "question": "Per favore dimmi quali sono i nomi dei liceali che hanno i piacciono e quanti mi piace hanno ciascuno?",
        "q_id": 905
    },
    {
        "db_id": "network_1",
        "question": "Vorrei sapere qual è il nome del liceo che ha il maggior numero di mi piace?",
        "q_id": 906
    },
    {
        "db_id": "network_1",
        "question": "Ti posso chiedere dai il nome dello studente con più mi piace.",
        "q_id": 907
    },
    {
        "db_id": "network_1",
        "question": "Sai mostra i nomi degli studenti che hanno almeno 2 mi piace.",
        "q_id": 908
    },
    {
        "db_id": "network_1",
        "question": "Sai quali sono i nomi degli studenti che hanno 2 o più mi piace?",
        "q_id": 909
    },
    {
        "db_id": "network_1",
        "question": "Vorrei sapere mostra i nomi degli studenti che hanno un voto superiore a 5 e hanno almeno 2 amici.",
        "q_id": 910
    },
    {
        "db_id": "network_1",
        "question": "Ti posso chiedere quali sono i nomi dei liceali che hanno un voto di oltre 5 e hanno 2 o più amici?",
        "q_id": 911
    },
    {
        "db_id": "network_1",
        "question": "Vorrei chiederti quanti mi piace ha kyle?",
        "q_id": 912
    },
    {
        "db_id": "network_1",
        "question": "Sai restituisce il numero di mi piace che il liceo di nome kyle ha.",
        "q_id": 913
    },
    {
        "db_id": "network_1",
        "question": "Sai trova il grado medio di tutti gli studenti che hanno degli amici.",
        "q_id": 914
    },
    {
        "db_id": "network_1",
        "question": "Puoi dirmi qual è il grado medio di studenti che hanno amici?",
        "q_id": 915
    },
    {
        "db_id": "network_1",
        "question": "Sai trova il grado minimo di studenti che non hanno amici.",
        "q_id": 916
    },
    {
        "db_id": "network_1",
        "question": "Sai qual è il grado più basso di studenti che non hanno amici?",
        "q_id": 917
    },
    {
        "db_id": "dog_kennels",
        "question": "Per favore dimmi quali stati hanno sia proprietari che professionisti che vivono lì?",
        "q_id": 918
    },
    {
        "db_id": "dog_kennels",
        "question": "Ti posso chiedere trova gli stati in cui vivono sia proprietari che professionisti.",
        "q_id": 919
    },
    {
        "db_id": "dog_kennels",
        "question": "Per favore dimmi qual è l'età media dei cani che hanno attraversato trattamenti?",
        "q_id": 920
    },
    {
        "db_id": "dog_kennels",
        "question": "Sai trova l'età media dei cani che hanno attraversato trattamenti.",
        "q_id": 921
    },
    {
        "db_id": "dog_kennels",
        "question": "Sai quali professionisti vivono nello stato dell'indiana o hanno fatto cure su più di 2 trattamenti?elenca il suo id, cognome e telefono cellulare.",
        "q_id": 922
    },
    {
        "db_id": "dog_kennels",
        "question": "Vorrei sapere trova l'id, il cognome e il cellulare dei professionisti che vivono nello stato dell'indiana o hanno eseguito più di due trattamenti.",
        "q_id": 923
    },
    {
        "db_id": "dog_kennels",
        "question": "Mi puoi dire quali cani non sono costati al loro proprietario più di 1000 per il trattamento?elenca i nomi dei cani.",
        "q_id": 924
    },
    {
        "db_id": "dog_kennels",
        "question": "Vorrei chiederti quali sono i nomi dei cani per i quali il proprietario non ha speso più di 1000 per il trattamento?",
        "q_id": 925
    },
    {
        "db_id": "dog_kennels",
        "question": "Per favore dimmi quali nomi sono usati per professionisti o proprietari ma non sono usati come nomi di cani?",
        "q_id": 926
    },
    {
        "db_id": "dog_kennels",
        "question": "Ti posso chiedere trova i nomi che vengono utilizzati per professionisti o proprietari ma non sono usati come nomi di cani.",
        "q_id": 927
    },
    {
        "db_id": "dog_kennels",
        "question": "Ti posso chiedere quale professionista non ha operato alcun trattamento sui cani?elenca l'id, il ruolo ed e -mail del professionista.",
        "q_id": 928
    },
    {
        "db_id": "dog_kennels",
        "question": "Per favore dimmi dammi l'id, il ruolo ed e -mail dei professionisti che non hanno eseguito alcun trattamento sui cani.",
        "q_id": 929
    },
    {
        "db_id": "dog_kennels",
        "question": "Puoi dirmi quale proprietario possiede il maggior numero di cani?elenca l'id proprietario, il nome e il cognome.",
        "q_id": 930
    },
    {
        "db_id": "dog_kennels",
        "question": "Per favore dimmi restituisci l'id proprietario, il nome e il cognome del proprietario che ha il maggior numero di cani.",
        "q_id": 931
    },
    {
        "db_id": "dog_kennels",
        "question": "Vorrei sapere quali professionisti hanno fatto almeno due trattamenti?elenca l'id, il ruolo e il nome del professionista.",
        "q_id": 932
    },
    {
        "db_id": "dog_kennels",
        "question": "Vorrei chiederti quali sono l'id, il ruolo e il nome dei professionisti che hanno eseguito due o più trattamenti?",
        "q_id": 933
    },
    {
        "db_id": "dog_kennels",
        "question": "Vorrei chiederti qual è il nome della razza con il maggior numero di cani?",
        "q_id": 934
    },
    {
        "db_id": "dog_kennels",
        "question": "Vorrei sapere quale razza hanno più cani?dammi il nome della razza.",
        "q_id": 935
    },
    {
        "db_id": "dog_kennels",
        "question": "Vorrei sapere quale proprietario ha pagato per il maggior numero di trattamenti sui suoi cani?elenca l'id proprietario e il cognome.",
        "q_id": 936
    },
    {
        "db_id": "dog_kennels",
        "question": "Vorrei sapere dimmi l'id proprietario e il cognome del proprietario che ha speso di più per i trattamenti dei suoi cani.",
        "q_id": 937
    },
    {
        "db_id": "dog_kennels",
        "question": "Sai qual è la descrizione del tipo di trattamento che costa meno denaro in totale?",
        "q_id": 938
    },
    {
        "db_id": "dog_kennels",
        "question": "Ti posso chiedere dammi la descrizione del tipo di trattamento il cui costo totale è il più basso.",
        "q_id": 939
    },
    {
        "db_id": "dog_kennels",
        "question": "Vorrei chiederti quale proprietario ha pagato la più grande quantità di denaro in totale per i loro cani?mostra l'id proprietario e il codice postale.",
        "q_id": 940
    },
    {
        "db_id": "dog_kennels",
        "question": "Puoi dirmi trova l'id proprietario e il codice postale del proprietario che ha speso più denaro in totale per i suoi cani.",
        "q_id": 941
    },
    {
        "db_id": "dog_kennels",
        "question": "Per favore dimmi quali professionisti hanno fatto almeno due tipi di trattamenti?elenca l'id professionale e il cellulare.",
        "q_id": 942
    },
    {
        "db_id": "dog_kennels",
        "question": "Per favore dimmi trova l'id e il telefono cellulare dei professionisti che gestiscono due o più tipi di trattamenti.",
        "q_id": 943
    },
    {
        "db_id": "dog_kennels",
        "question": "Vorrei sapere quali sono il nome e il cognome dei professionisti che hanno fatto cure con costo inferiore alla media?",
        "q_id": 944
    },
    {
        "db_id": "dog_kennels",
        "question": "Mi puoi dire quali professionisti hanno gestito un trattamento che costa meno della media?dammi teor nomi e cognomi.",
        "q_id": 945
    },
    {
        "db_id": "dog_kennels",
        "question": "Mi puoi dire elenca la data di ciascun trattamento, insieme al nome del professionista che lo ha gestito.",
        "q_id": 946
    },
    {
        "db_id": "dog_kennels",
        "question": "Per favore dimmi qual è la data e il nome del professionista operativo di ogni trattamento?",
        "q_id": 947
    },
    {
        "db_id": "dog_kennels",
        "question": "Ti posso chiedere elencare il costo di ciascun trattamento e la descrizione del tipo di trattamento corrispondente.",
        "q_id": 948
    },
    {
        "db_id": "dog_kennels",
        "question": "Mi puoi dire quali sono la descrizione del tipo di costo e del trattamento di ciascun trattamento?",
        "q_id": 949
    },
    {
        "db_id": "dog_kennels",
        "question": "Ti posso chiedere elenca il nome, il cognome e le dimensioni di ciascun proprietario per il suo cane.",
        "q_id": 950
    },
    {
        "db_id": "dog_kennels",
        "question": "Ti posso chiedere qual è il nome, il cognome e le dimensioni del loro cane?",
        "q_id": 951
    },
    {
        "db_id": "dog_kennels",
        "question": "Puoi dirmi elenca le coppie del nome del proprietario e il nome dei cani.",
        "q_id": 952
    },
    {
        "db_id": "dog_kennels",
        "question": "Puoi dirmi qual è il nome di ciascun proprietario e il nome dei loro cani?",
        "q_id": 953
    },
    {
        "db_id": "dog_kennels",
        "question": "Ti posso chiedere elenca i nomi dei cani della razza più rara e le date di trattamento.",
        "q_id": 954
    },
    {
        "db_id": "dog_kennels",
        "question": "Vorrei sapere quali cani sono della razza più rara?mostra i loro nomi e le date del trattamento.",
        "q_id": 955
    },
    {
        "db_id": "dog_kennels",
        "question": "Mi puoi dire quali cani sono di proprietà di qualcuno che vive in virginia?elenca il nome del proprietario e il nome del cane.",
        "q_id": 956
    },
    {
        "db_id": "dog_kennels",
        "question": "Ti posso chiedere trova i nomi dei nomi dei proprietari che vivono in virginia e i nomi dei cani che possiedono.",
        "q_id": 957
    },
    {
        "db_id": "dog_kennels",
        "question": "Puoi dirmi quali sono la data in arrivo e la data in partenza dei cani che hanno subito un trattamento?",
        "q_id": 958
    },
    {
        "db_id": "dog_kennels",
        "question": "Mi puoi dire trova la data in arrivo e la data di partenza dei cani che hanno ricevuto un trattamento.",
        "q_id": 959
    },
    {
        "db_id": "dog_kennels",
        "question": "Puoi dirmi elenca il cognome del proprietario che possiede il cane più giovane.",
        "q_id": 960
    },
    {
        "db_id": "dog_kennels",
        "question": "Puoi dirmi chi possiede il cane più giovane?dammi il suo cognome.",
        "q_id": 961
    },
    {
        "db_id": "dog_kennels",
        "question": "Puoi dirmi elenca le e -mail dei professionisti che vivono nello stato delle hawaii o nello stato del wisconsin.",
        "q_id": 962
    },
    {
        "db_id": "dog_kennels",
        "question": "Vorrei chiederti quali sono le e -mail dei professionisti che vivono nello stato delle hawaii o nello stato del wisconsin?",
        "q_id": 963
    },
    {
        "db_id": "dog_kennels",
        "question": "Mi puoi dire qual è la data in arrivo e la data in partenza di tutti i cani?",
        "q_id": 964
    },
    {
        "db_id": "dog_kennels",
        "question": "Mi puoi dire elencare la data di arrivo e la data di partenza per tutti i cani.",
        "q_id": 965
    },
    {
        "db_id": "dog_kennels",
        "question": "Ti posso chiedere quanti cani hanno attraversato trattamenti?",
        "q_id": 966
    },
    {
        "db_id": "dog_kennels",
        "question": "Per favore dimmi conta il numero di cani che hanno attraversato un trattamento.",
        "q_id": 967
    },
    {
        "db_id": "dog_kennels",
        "question": "Per favore dimmi quanti professionisti hanno eseguito un trattamento per i cani?",
        "q_id": 968
    },
    {
        "db_id": "dog_kennels",
        "question": "Per favore dimmi trova il numero di professionisti che hanno mai trattato i cani.",
        "q_id": 969
    },
    {
        "db_id": "dog_kennels",
        "question": "Puoi dirmi quali professionisti vivono in una città contenente la sottostringa \"west\"?elenca il suo ruolo, strada, città e stato.",
        "q_id": 970
    },
    {
        "db_id": "dog_kennels",
        "question": "Mi puoi dire trova il ruolo, strada, città e stato dei professionisti che vivono in una città che contiene la sottostringa \"west\".",
        "q_id": 971
    },
    {
        "db_id": "dog_kennels",
        "question": "Vorrei chiederti quali proprietari vivono nello stato il cui nome contiene la sottostringa \"north\"?elenca il suo nome, cognome ed e -mail.",
        "q_id": 972
    },
    {
        "db_id": "dog_kennels",
        "question": "Puoi dirmi restituisci il nome, il cognome e l'e -mail dei proprietari che vivono in uno stato il cui nome contiene la sottostringa \"north\".",
        "q_id": 973
    },
    {
        "db_id": "dog_kennels",
        "question": "Mi puoi dire quanti cani hanno un'età inferiore alla media?",
        "q_id": 974
    },
    {
        "db_id": "dog_kennels",
        "question": "Vorrei sapere conta il numero di cani di età inferiore alla media.",
        "q_id": 975
    },
    {
        "db_id": "dog_kennels",
        "question": "Per favore dimmi quanto costa il trattamento più recente?",
        "q_id": 976
    },
    {
        "db_id": "dog_kennels",
        "question": "Mi puoi dire mostrami il costo del trattamento eseguito più recentemente.",
        "q_id": 977
    },
    {
        "db_id": "dog_kennels",
        "question": "Vorrei chiederti quanti cani non hanno subito alcun trattamento?",
        "q_id": 978
    },
    {
        "db_id": "dog_kennels",
        "question": "Puoi dirmi dimmi il numero di cani che non hanno ricevuto alcun trattamento.",
        "q_id": 979
    },
    {
        "db_id": "dog_kennels",
        "question": "Puoi dirmi quanti proprietari temporaneamente non hanno cani?",
        "q_id": 980
    },
    {
        "db_id": "dog_kennels",
        "question": "Vorrei chiederti trova il numero di proprietari che non possiedono cani in questo momento.",
        "q_id": 981
    },
    {
        "db_id": "dog_kennels",
        "question": "Ti posso chiedere quanti professionisti non hanno operato alcun trattamento sui cani?",
        "q_id": 982
    },
    {
        "db_id": "dog_kennels",
        "question": "Ti posso chiedere trova il numero di professionisti che non hanno trattato alcun cani.",
        "q_id": 983
    },
    {
        "db_id": "dog_kennels",
        "question": "Ti posso chiedere elenca il nome del cane, l'età e il peso dei cani che sono stati abbandonati?1 sta per sì e 0 sta per il no.",
        "q_id": 984
    },
    {
        "db_id": "dog_kennels",
        "question": "Sai quali sono il nome del cane, l'età e il peso dei cani che sono stati abbandonati?si noti che 1 sta per sì e 0 sta per no nelle tabelle.",
        "q_id": 985
    },
    {
        "db_id": "dog_kennels",
        "question": "Sai qual è l'età media di tutti i cani?",
        "q_id": 986
    },
    {
        "db_id": "dog_kennels",
        "question": "Per favore dimmi calcola l'età media di tutti i cani.",
        "q_id": 987
    },
    {
        "db_id": "dog_kennels",
        "question": "Sai qual è l'età del cane più antico?",
        "q_id": 988
    },
    {
        "db_id": "dog_kennels",
        "question": "Mi puoi dire dimmi l'età del cane più antico.",
        "q_id": 989
    },
    {
        "db_id": "dog_kennels",
        "question": "Sai quanto costa ogni tipo di addebito?elencare sia il tipo di addebito che l'importo.",
        "q_id": 990
    },
    {
        "db_id": "dog_kennels",
        "question": "Per favore dimmi elencare ogni tipo di addebito e il suo importo.",
        "q_id": 991
    },
    {
        "db_id": "dog_kennels",
        "question": "Puoi dirmi quanto costa il tipo di addebito più costoso?",
        "q_id": 992
    },
    {
        "db_id": "dog_kennels",
        "question": "Per favore dimmi qual è la quantità di addebito del tipo di addebito più costoso?",
        "q_id": 993
    },
    {
        "db_id": "dog_kennels",
        "question": "Vorrei sapere elenca l'e -mail, il telefono cellulare e il telefono domestico di tutti i professionisti.",
        "q_id": 994
    },
    {
        "db_id": "dog_kennels",
        "question": "Puoi dirmi quali sono l'e -mail, il telefono cellulare e il telefono di casa di ogni professionista?",
        "q_id": 995
    },
    {
        "db_id": "dog_kennels",
        "question": "Ti posso chiedere quali sono tutte le possibili combinazioni di tipo di razza e tipo di dimensione?",
        "q_id": 996
    },
    {
        "db_id": "dog_kennels",
        "question": "Per favore dimmi trova le distinte combinazioni di tipo di razza e tipo di dimensione per i cani.",
        "q_id": 997
    },
    {
        "db_id": "dog_kennels",
        "question": "Ti posso chiedere elenca il nome di tutti i professionisti insieme alla descrizione del trattamento che hanno fatto.",
        "q_id": 998
    },
    {
        "db_id": "dog_kennels",
        "question": "Mi puoi dire qual è il nome e la descrizione di ciascun professionista del trattamento che hanno eseguito?",
        "q_id": 999
    },
    {
        "db_id": "singer",
        "question": "Mi puoi dire quanti cantanti ci sono?",
        "q_id": 1000
    },
    {
        "db_id": "singer",
        "question": "Per favore dimmi qual è il conteggio dei cantanti?",
        "q_id": 1001
    },
    {
        "db_id": "singer",
        "question": "Ti posso chiedere elenca il nome dei cantanti in ordine crescente del patrimonio netto.",
        "q_id": 1002
    },
    {
        "db_id": "singer",
        "question": "Sai quali sono i nomi dei cantanti ordinati dal patrimonio netto ascendente?",
        "q_id": 1003
    },
    {
        "db_id": "singer",
        "question": "Vorrei sapere quali sono l'anno di nascita e la cittadinanza dei cantanti?",
        "q_id": 1004
    },
    {
        "db_id": "singer",
        "question": "Per favore dimmi quali sono gli anni di nascita e la cittadinanza dei cantanti?",
        "q_id": 1005
    },
    {
        "db_id": "singer",
        "question": "Sai elenca il nome di cantanti la cui cittadinanza non è `` francia ''.",
        "q_id": 1006
    },
    {
        "db_id": "singer",
        "question": "Vorrei sapere quali sono i nomi dei cantanti che non sono cittadini francesi?",
        "q_id": 1007
    },
    {
        "db_id": "singer",
        "question": "Sai mostra il nome di cantanti il cui anno di nascita è 1948 o 1949?",
        "q_id": 1008
    },
    {
        "db_id": "singer",
        "question": "Per favore dimmi quali sono i nomi dei cantanti i cui anni di nascita sono 1948 o 1949?",
        "q_id": 1009
    },
    {
        "db_id": "singer",
        "question": "Vorrei chiederti qual è il nome del cantante con il più grande patrimonio netto?",
        "q_id": 1010
    },
    {
        "db_id": "singer",
        "question": "Vorrei chiederti qual è il nome del cantante che vale di più?",
        "q_id": 1011
    },
    {
        "db_id": "singer",
        "question": "Vorrei sapere 1013. translation error",
        "q_id": 1012
    },
    {
        "db_id": "singer",
        "question": "Puoi dirmi per ogni cittadinanza, quanti cantanti provengono da quel paese?",
        "q_id": 1013
    },
    {
        "db_id": "singer",
        "question": "Puoi dirmi per favore, mostra la cittadinanza più comune dei cantanti.",
        "q_id": 1014
    },
    {
        "db_id": "singer",
        "question": "Ti posso chiedere qual è la cittadinanza del cantante più comune?",
        "q_id": 1015
    },
    {
        "db_id": "singer",
        "question": "Vorrei chiederti mostra diverse cittadini e il patrimonio netto massimo di cantanti di ogni cittadinanza.",
        "q_id": 1016
    },
    {
        "db_id": "singer",
        "question": "Ti posso chiedere per ogni cittadinanza, qual è il patrimonio netto massimo?",
        "q_id": 1017
    },
    {
        "db_id": "singer",
        "question": "Vorrei chiederti mostra titoli di canzoni e nomi di cantanti.",
        "q_id": 1018
    },
    {
        "db_id": "singer",
        "question": "Sai quali sono i titoli delle canzoni e i nomi dei cantanti?",
        "q_id": 1019
    },
    {
        "db_id": "singer",
        "question": "Vorrei chiederti mostra nomi distinti di cantanti che hanno canzoni con vendite più di 300000.",
        "q_id": 1020
    },
    {
        "db_id": "singer",
        "question": "Vorrei sapere quali sono i diversi nomi dei cantanti che hanno vendite più di 300000?",
        "q_id": 1021
    },
    {
        "db_id": "singer",
        "question": "Vorrei chiederti mostra i nomi dei cantanti che hanno più di una canzone.",
        "q_id": 1022
    },
    {
        "db_id": "singer",
        "question": "Mi puoi dire quali sono i nomi dei cantanti che hanno più di una canzone?",
        "q_id": 1023
    },
    {
        "db_id": "singer",
        "question": "Mi puoi dire mostra i nomi dei cantanti e le vendite totali delle loro canzoni.",
        "q_id": 1024
    },
    {
        "db_id": "singer",
        "question": "Per favore dimmi per il nome di ogni cantante, quali sono le vendite totali per le loro canzoni?",
        "q_id": 1025
    },
    {
        "db_id": "singer",
        "question": "Mi puoi dire 1027. translation error",
        "q_id": 1026
    },
    {
        "db_id": "singer",
        "question": "Sai qual è il nome di ogni canzone che non ha alcuna canzone?",
        "q_id": 1027
    },
    {
        "db_id": "singer",
        "question": "Vorrei chiederti mostra la cittadinanza condivisa dai cantanti con l'anno di nascita prima del 1945 e dopo il 1955.",
        "q_id": 1028
    },
    {
        "db_id": "singer",
        "question": "Ti posso chiedere quali sono le cittadini che sono condivise dai cantanti con un anno di nascita prima del 1945 e dopo il 1955?",
        "q_id": 1029
    },
    {
        "db_id": "real_estate_properties",
        "question": "Mi puoi dire quante funzionalità disponibili ci sono in totale?",
        "q_id": 1030
    },
    {
        "db_id": "real_estate_properties",
        "question": "Puoi dirmi qual è il nome del tipo di funzionalità di feature aircon?",
        "q_id": 1031
    },
    {
        "db_id": "real_estate_properties",
        "question": "Per favore dimmi mostra le descrizioni del tipo di proprietà delle proprietà appartenenti a quel codice.",
        "q_id": 1032
    },
    {
        "db_id": "real_estate_properties",
        "question": "Per favore dimmi quali sono i nomi delle proprietà che sono case o appartamenti con più di 1 camera?",
        "q_id": 1033
    }
]